[
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/cilbir-turkish-poached-eggs-with-garlic-yogurt-5313021",
        "recipe_name":"Çılbır (Turkish Poached Eggs with Garlic Yogurt)",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2018\/6\/24\/0\/FNM_070118-Turkish-Poached-Eggs_s4x3.jpg.rend.hgtvcom.826.620.suffix\/1529966607715.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Egg Recipes",
            "Dairy Recipes"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"30 min\n          \n        \n        \n          Active:\n           30 min",
            "Servings":"None",
            "Yield":"4 servings"
        },
        "recipe_ingredients_formatted":[
            "1 1\/3 cups plain Greek yogurt",
            "2 small cloves garlic, minced",
            "3 tablespoons chopped fresh dill",
            "3 tablespoons extra-virgin olive oil",
            "Kosher salt and freshly ground pepper",
            "2 tablespoons white wine vinegar",
            "8 large eggs",
            "2 large pinches red pepper flakes",
            "2 tablespoons chopped walnuts",
            "2 tablespoons unsalted butter",
            "1 bunch watercress, tough stems trimmed",
            "1 small whole-wheat baguette, split, toasted and cut into pieces"
        ],
        "recipe_directions_formatted":[
            "Combine the yogurt, garlic, dill, 2 tablespoons olive oil, 1\/2 teaspoon salt and a few grinds of pepper in a medium bowl; stir until smooth. Spread the yogurt on 4 plates.",
            "Bring about 3 inches of water to a boil in a wide pot. Add the vinegar and reduce the heat to medium to maintain a gentle simmer. Crack 4 eggs into individual small bowls or ramekins. Carefully lower each egg into the water. Cook until the whites are set but the yolks are still runny, about 3 minutes. Remove the poached eggs with a slotted spoon and blot the bottoms dry on a kitchen towel. Divide among the plates. Let the water return to a simmer and repeat with the remaining 4 eggs; add to the plates. Season the eggs with a pinch each of salt and red pepper flakes.",
            "Toast the walnuts in a small skillet over medium heat, stirring, until golden, about 4 minutes. Stir in a pinch of red pepper flakes, then stir in the butter until melted. Spoon over the eggs.",
            "Toss the watercress with the remaining 1 tablespoon olive oil and a pinch of salt in a medium bowl; divide among the plates. Serve with the bread."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"540",
            "Total Fat":"33 grams",
            "Carbohydrates":"34 grams",
            "Protein":"27 grams"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/kymal-borek-turkish-borek-with-ground-beef-17884638",
        "recipe_name":"Kıymalı Börek (Turkish Börek with Ground Beef)",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Main Dish"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"2 hr\n          \n        \n        \n          Active:\n           40 min",
            "Servings":"None",
            "Yield":"8 servings"
        },
        "recipe_ingredients_formatted":[
            "3 tablespoons olive oil",
            "1 large onion, diced",
            "1 pound ground beef (80\/20)",
            "1 teaspoon Aleppo pepper, optional",
            "Kosher salt and freshly ground black pepper",
            "1 cup milk",
            "2 large eggs",
            "1\/2 cup neutral oil, such as canola or vegetable oil",
            "1 box frozen phyllo dough (15 to 18 sheets), thawed",
            "Sesame seeds and nigella seeds or black sesame seeds, for topping"
        ],
        "recipe_directions_formatted":[
            "Heat 2 tablespoons of the olive oil in a large skillet over medium heat. Add the onions and cook, stirring frequently, until soft and translucent, about 10 minutes. Add the beef and cook, breaking the meat up with a spatula, until completely browned, about 10 minutes. Stir in the Aleppo pepper, if using, and 1 teaspoon salt and 1\/2 teaspoon black pepper. Add 1\/2 cup water and let the mixture simmer until the water has completely evaporated, about 15 minutes. Let the filling cool to room temperature. Season with more salt and pepper to taste if needed.",
            "Meanwhile, make the basting sauce by whisking the milk, eggs and neutral oil together in a medium bowl. Unwrap and unroll the phyllo dough and cover the sheets with a kitchen towel to keep them from drying out.",
            "Preheat the oven to 375 degrees F. Brush the bottom of a round 16-inch baking pan (see Cook’s Note) with the remaining 1 tablespoon olive oil.",
            "Take 2 phyllo sheets and place them on top of each other in front of you on a clean work surface. Brush the top sheet with the milk mixture. Place 3 to 4 tablespoons of the filling across the bottom (the longer side) of the phyllo and roll up, enclosing the filling. Make sure you’re not rolling too tightly or loosely. Twist the log into a spiral and transfer it to the center of the prepared pan. Repeat the steps to make another log and coil that log around the spiral you already have in the pan. Repeat these steps to make the spiral larger and larger until you run out of phyllo dough and\/or filling.",
            "Brush the coil liberally with the remaining milk mixture and top it with sesame seeds and nigella seeds. Bake until the top is golden and crispy, about 35 minutes. Cut into wedges and serve warm."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"476",
            "Total Fat":"35 g",
            "Carbohydrates":"24 g",
            "Protein":"15 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/turkish-beef-patties-with-confetti-couscous-5478638",
        "recipe_name":"Turkish Beef Patties with Confetti Couscous",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2018\/10\/29\/0\/FNM_110118-Turkish-Beef-Patties-with-Confetti-Couscous_s4x3.jpg.rend.hgtvcom.826.620.suffix\/1540856970850.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Beef",
            "Couscous",
            "Main Dish",
            "Low Calorie",
            "High Fiber"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"40 min\n          \n        \n        \n          Active:\n           40 min",
            "Servings":"None",
            "Yield":"4 servings"
        },
        "recipe_ingredients_formatted":[
            "2 tablespoons extra-virgin olive oil",
            "3 cups frozen pepper-and-onion stir-fry blend, finely chopped",
            "1 cup whole-wheat couscous",
            "Kosher salt and freshly ground pepper",
            "1 1\/4 pounds lean ground beef",
            "2 cloves garlic, finely grated",
            "1 tablespoon ras el hanout (Moroccan seasoning)",
            "3\/4 cup nonfat plain Greek yogurt",
            "Finely grated zest and juice of 1\/2 lemon",
            "1\/4 cup chopped fresh mint",
            "1\/4 cup chopped fresh parsley",
            "1\/4 cup chopped dried apricots"
        ],
        "recipe_directions_formatted":[
            "Heat 1 tablespoon olive oil in a large nonstick skillet over medium-high heat. Add the frozen vegetables and cook, stirring occasionally, until the liquid is evaporated, 8 to 10 minutes. Transfer half the vegetables to a large bowl and half to a medium bowl; reserve the skillet. Add the couscous, 1\/2 teaspoon salt, a few grinds of pepper and 1 1\/2 cups boiling water to the large bowl. Stir to combine, cover and set aside 10 minutes.",
            "Meanwhile, add the ground beef, garlic, ras el hanout, 1\/2 teaspoon salt and a few grinds of pepper to the medium bowl. Mix with your hands until completely combined. Divide into eight 4-inch logs. Heat the remaining 1 tablespoon olive oil in the reserved skillet over medium heat; add the beef logs and cook, turning, until browned, about 8 minutes.",
            "Whisk the yogurt, lemon zest and juice in a small bowl. Fluff the couscous with a fork and stir in the mint, parsley and dried apricots. Divide the couscous, yogurt sauce and patties among plates."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"490",
            "Total Fat":"18 grams",
            "Carbohydrates":"46 grams",
            "Protein":"39 grams"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/turkish-pide-with-eggs-and-sucuk-11931018",
        "recipe_name":"Turkish Pide with Eggs and Sucuk",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2021\/11\/19\/0\/FNK_TURKISH_PIDE_W_EGGS_N_SUCUK_H_f_s4x3.jpg.rend.hgtvcom.1280.720.suffix\/1637334693107.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Egg Recipes"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"2 hr 30 min\n          \n            (includes rising and resting time)\n          \n        \n        \n          Active:\n           35 min",
            "Servings":"None",
            "Yield":"5 to 6 servings"
        },
        "recipe_ingredients_formatted":[
            "4 cups all-purpose flour, plus more for dusting",
            "1 teaspoon granulated sugar",
            "1 teaspoon instant yeast",
            "Kosher salt",
            "Vegetable oil, for the bowl",
            "1 pound kaşar cheese, shredded (about 5 cups; use mozzarella if kaşar is not available)",
            "4 ounces hot or mild sucuk (Turkish dry sausage), casing removed, sliced into 1\/8-inch-thick pieces",
            "4 tablespoons vegetable oil",
            "5 large eggs"
        ],
        "recipe_directions_formatted":[
            "For the dough: Put 1 1\/2 cups warm water (about 110 degrees F) in the bowl of a stand mixer with the paddle attachment. Add the flour, sugar, yeast and 1 teaspoon salt to the water and mix on low until barely incorporated. Let the mixture sit for 5 minutes for the flour to absorb the water. Attach the dough hook and knead the dough on medium high until smooth, about 7 minutes. Coat a large bowl with vegetable oil and transfer the dough to the bowl. Move the dough around so it’s coated with oil on all sides. Cover and let rise in a draft-free space, such as an unlit oven, until increased in size but not quite doubled, about 1 hour.",
            "Uncover the dough and place on a well-floured surface.",
            "Place a baking sheet upside down on the middle rack of the oven and preheat to 450 degrees F. Turn a second baking sheet upside down and cover with a piece of parchment.",
            "Divide the dough into 5 pieces (see Cook's Note) and cover 4 with a damp cloth. Roll out the uncovered piece using a rolling pin into an oval about 20 inches long and 5 inches wide. Transfer the dough to the parchment on the back of the baking sheet. Repeat with a second piece of dough.",
            "For the toppings: Sprinkle about 1 cup kaşar on each oval, leaving about a 1-inch border on all sides. Top the cheese with sucuk slices, leaving some space in the middle to add an egg later. Fold the dough up and over about 3\/4 inch onto the cheese on all sides and pinch the ends. Brush with vegetable oil.",
            "Slide the pides with the parchment onto the baking sheet in the oven. Bake until the cheese is melted and starting to brown, 7 to 10 minutes. Crack 2 eggs into 2 small bowls. Add 1 egg on top of each pide in the middle. Continue to bake until the eggs are set to your preference, another 4 to 5 minutes. Repeat with the remaining dough, cheese, sucuk, oil and eggs."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"1391",
            "Total Fat":"110 g",
            "Carbohydrates":"67 g",
            "Protein":"34 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/elmal-kurabiye-turkish-apple-cookies-17872494",
        "recipe_name":"Elmalı Kurabiye (Turkish Apple Cookies)",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Cookie",
            "Apple Recipes",
            "Fruit",
            "Dessert",
            "Low Sodium"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"1 hr 30 min\n          \n            (includes chilling time)\n          \n        \n        \n          Active:\n           30 min",
            "Servings":"None",
            "Yield":"24 cookies"
        },
        "recipe_ingredients_formatted":[
            "2 Gala or Golden Delicious apples, peeled and shredded",
            "2 tablespoons granulated sugar",
            "1 teaspoon ground cinnamon",
            "1\/3 cup chopped walnuts",
            "2 sticks (1 cup) butter, at room temperature",
            "1\/2 cup confectioners’ sugar, plus more for sprinkling",
            "1 tablespoon plain yogurt",
            "1\/2 teaspoon pure vanilla extract",
            "1 1\/2 cups plus 3 tablespoons all-purpose flour (see Cook’s Note), plus more as needed",
            "1\/2 teaspoon baking soda",
            "1\/4 teaspoon kosher salt"
        ],
        "recipe_directions_formatted":[
            "For the filling: Place the apples, sugar and cinnamon in a medium saucepan over medium-high heat. Cook, stirring occasionally, until the apples have released their juices and the juice has evaporated, about 15 minutes. Let the mixture cool completely, then stir in the walnuts.",
            "For the dough: Meanwhile, put the butter, confectioners’ sugar, yogurt and vanilla in a large bowl and mix with a spatula until combined. Add the flour, baking soda and salt. Mix gently using a spatula and add more flour, 1 tablespoon at a time, until the dough comes together and is no longer sticky. Cut the dough into 3 pieces and shape each piece into a ball. Wrap each in plastic wrap and refrigerate for 45 minutes.",
            "Preheat the oven to 350 degrees F. Line 2 baking sheets with parchment paper.",
            "Place a dough ball on a lightly floured surface and sprinkle with a bit of flour. Roll the dough out with a rolling pin into a 6-inch circle about 1\/4 inch thick. If the dough is too stiff, let it sit at room temperature for 5 minutes and then roll it out. Cut into 4 pieces and then cut each piece into 2 wedges for a total of 8 triangles.",
            "Spoon about 1\/2 tablespoon of the apple filling onto the wide part of each triangle and roll up towards the narrow end like a croissant. Place the cookies on a prepared baking sheet. Repeat with the remaining dough and filling.",
            "Bake the cookies until they are puffed and the dough is no longer shiny, about 12 minutes. Let the cookies cool 5 minutes on the baking sheets, then transfer to a rack to cool completely. Sprinkle with confectioners’ sugar. Store the cookies in an airtight container for 2 days at room temperature and up to 1 week in the fridge."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"133",
            "Total Fat":"9 g",
            "Carbohydrates":"13 g",
            "Protein":"1 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/turkish-cheese-and-herb-cigars-3635261",
        "recipe_name":"Turkish Cheese and Herb Cigars",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2017\/2\/6\/0\/FNK_Turkish-Feta-and-Herb-Cigars_s4x3.jpg.rend.hgtvcom.826.620.suffix\/1486405389306.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Appetizer"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"55 min\n          \n        \n        \n          Active:\n           30 min",
            "Servings":"None",
            "Yield":"12 cigars"
        },
        "recipe_ingredients_formatted":[
            "4 ounces farmer's cheese",
            "2 ounces feta, crumbled",
            "1\/4 cup shredded part-skim mozzarella",
            "1 large egg",
            "3 tablespoons finely chopped fresh parsley",
            "2 tablespoons finely chopped dill fronds",
            "1 tablespoon chopped fresh chives",
            "1\/2 teaspoon grated lemon zest",
            "Freshly ground black pepper",
            "Six 16- to 17-by-12-inch sheets phyllo dough, thawed according to package directions (see Cook's Note)",
            "6 tablespoons unsalted butter, melted"
        ],
        "recipe_directions_formatted":[
            "Preheat the oven to 400 degrees F. Mash the farmer's cheese, feta and mozzarella together in a bowl using a fork. Work the egg in with the fork, then stir in the parsley, dill, chives, lemon zest and a large pinch of black pepper.",
            "Put a damp, clean towel on your counter. Unfold the phyllo sheets on top and cover with another damp, clean towel.",
            "Put 1 sheet of phyllo on a cutting board with the long side closest to you and brush lightly with butter. Top with another sheet of phyllo and brush lightly with butter. Top with a third sheet of phyllo and brush lightly with butter. Cut the phyllo in half crosswise, then cut each half horizontally into thirds. Place the rectangles on a baking sheet and set aside. Repeat with the remaining phyllo.",
            "Working with one buttered phyllo stack at a time, spread a heaping tablespoon of cheese along the long edge of each rectangle, leaving a 1\/2-inch border at each end. Fold the sides over the filling, then roll up from the bottom edge of the phyllo. Transfer rolled cigars to a baking sheet seam-side down and brush each with a little butter. Repeat with the remaining phyllo, filling and butter.",
            "Bake the cigars, rotating the pan halfway through, until crispy and golden-brown, about 25 minutes. Transfer to a serving platter and serve."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"115",
            "Total Fat":"9 g",
            "Carbohydrates":"6 g",
            "Protein":"4 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/marc-murphy\/turkish-butternut-squash-kabak-tatlisi-11823257",
        "recipe_name":"Turkish Butternut Squash (Kabak Tatlisi)",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2021\/10\/08\/YK507_Butternut-Squash-Kabak-Tatlisi_s4x3.jpg.rend.hgtvcom.826.620.suffix\/1633726005752.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Butternut Squash",
            "Dessert",
            "Gluten Free",
            "High Fiber",
            "Low Sodium"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"12 hr\n          \n            (includes overnight refrigeration)\n          \n        \n        \n          Active:\n           1 hr",
            "Servings":"None",
            "Yield":"6 servings"
        },
        "recipe_ingredients_formatted":[
            "1 1\/2 to 2 pounds butternut squash",
            "9 ounces cane sugar",
            "1\/2 teaspoon ground cinnamon",
            "1\/2 teaspoon freshly ground black pepper",
            "1 lemon, zested",
            "Pinch salt",
            "1 cup heavy cream",
            "4 tablespoons tahini",
            "3\/4 cup toasted and crushed pistachios"
        ],
        "recipe_directions_formatted":[
            "Peel and cut butternut squash into 1-inch-thick rounds or the size of a hockey puck.",
            "Mix together in a bowl the sugar, cinnamon, black pepper, lemon zest and salt. Mix with the butternut squash. Cover with plastic wrap placed in the refrigerator overnight.",
            "Preheat the oven at 350 degrees F.",
            "Take the plastic wrap off the squash and cover with foil. Bake for 45 minutes. Remove from the oven, flip the butternut squash, place the foil back on and cook for another 45 minutes.",
            "Remove from the oven and let sit on the counter in its juices to get to room temperature. Once at room temperature, cover with plastic wrap and refrigerate for about 2 hours.",
            "Whip the heavy cream until soft peaks form and add half of the tahini to the whipped cream. Reserve the other 2 tablespoons tahini to drizzle on top for garnish. Put the cooked butternut squash on a large platter and ladle over some of the cooking juices. Top with a few large dollops of whipped cream and garnish with drizzled tahini and the crushed pistachio nuts."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"507",
            "Total Fat":"27 g",
            "Carbohydrates":"66 g",
            "Protein":"7 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/turkish-3-ingredient-flour-cookies-17859066",
        "recipe_name":"Turkish 3-Ingredient Flour Cookies",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Cookie",
            "Dessert",
            "Low Sodium",
            "Vegan"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"2 hr\n          \n            (includes chilling and cooling times)\n          \n        \n        \n          Active:\n           25 min",
            "Servings":"None",
            "Yield":"20 cookies"
        },
        "recipe_ingredients_formatted":[
            "1 1\/2 cups all-purpose flour (see Cook’s Note)",
            "1\/2 cup avocado oil or light olive oil",
            "1\/3 cup confectioners’ sugar"
        ],
        "recipe_directions_formatted":[
            "Mix together the flour, oil and confectioners’ sugar in a medium bowl with a spatula until the dough comes together. There is no need to knead the dough. Wrap the dough in plastic wrap and freeze for 1 hour or refrigerate for 2 to 4 hours.",
            "Preheat the oven to 350 degrees F. Line a baking sheet with parchment.",
            "Scoop up 1 tablespoon of dough and shape it into a ball. Place it on the prepared baking sheet and repeat with the remaining dough, leaving 1 inch between balls. Press down lightly with a fork on top of the cookies. All 20 cookies will fit on 1 baking sheet.",
            "Bake until the cookies are just set and matte on top, 15 to 18 minutes. Let the cookies cool for 10 minutes on the pan before transferring them with a spatula to a wire rack to cool completely. The cookies can be stored in an airtight container at room temperature for up to 5 days or in the fridge for up to a month."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"90",
            "Total Fat":"5 g",
            "Carbohydrates":"9 g",
            "Protein":"1 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/turkish-style-scrambled-eggs-17128617",
        "recipe_name":"Turkish-Style Scrambled Eggs",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2023\/7\/19\/FNM090123-turkish-style-scrambled-eggs_s4x3.jpg.rend.hgtvcom.826.620.suffix\/1689795888123.jpeg",
        "recipe_tags_formatted":[
            "Vegetarian",
            "Egg Recipes",
            "Main Dish"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"40 min\n          \n        \n        \n          Active:\n           40 min",
            "Servings":"None",
            "Yield":"4 servings"
        },
        "recipe_ingredients_formatted":[
            "2 pieces lavash",
            "1\/4 cup plus 1 teaspoon extra-virgin olive oil",
            "1 onion, chopped",
            "1 Anaheim chile pepper, seeded, halved lengthwise and thinly sliced",
            "Kosher salt",
            "1 pound heirloom tomatoes (1 to 2 large), diced",
            "2 teaspoons Aleppo pepper, plus a pinch 3\/4 teaspoon dried oregano",
            "8 large eggs, beaten",
            "2 cloves garlic, finely chopped",
            "1\/3 cup crumbled feta cheese (about 2 ounces)",
            "3 tablespoons finely chopped fresh chives"
        ],
        "recipe_directions_formatted":[
            "Preheat the oven to 375 degrees F. Bake the lavash on a rimmed baking sheet until golden and crisp, 10 minutes. Set aside.",
            "Heat 2 tablespoons olive oil in a large nonstick skillet over medium heat. Add the onion, Anaheim pepper and a pinch of salt; cook, stirring, until soft, 5 minutes. Add the tomatoes; cook until they are broken down and the skillet is dry, 5 to 6 minutes. Add 2 teaspoons Aleppo pepper, the oregano, 1\/2 teaspoon salt and a few grinds of black pepper; stir until toasted, about 2 minutes. Remove to a bowl.",
            "Remove the skillet from the heat and add 1 teaspoon olive oil. Add the eggs and cook over low heat, stirring constantly with a rubber spatula, until soft, creamy curds form, 10 to 12 minutes. Season with 1\/4 teaspoon salt, then fold in the tomato mixture. Cook until the flavors are blended, about 2 minutes.",
            "Meanwhile, cook the remaining 2 tablespoons olive oil and the garlic in a small skillet over medium-high until the garlic begins to brown, 1 to 2 minutes. Brush the garlic oil on the lavash.",
            "Divide the eggs among plates and top with the crumbled feta, chives and a pinch of Aleppo pepper. Serve with the lavash."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"440",
            "Total Fat":"29 grams",
            "Carbohydrates":"25 grams",
            "Protein":"19 grams"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/fnk\/recipes\/menemen-turkish-scrambled-eggs-7151645",
        "recipe_name":"Menemen (Turkish Scrambled Eggs)",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2019\/7\/16\/1\/menemen-turkish-scrambled-eggs-7126408.jpg.rend.hgtvcom.826.620.suffix\/1563298355404.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Middle Eastern Recipes",
            "Tomato",
            "Egg Recipes",
            "Main Dish",
            "Breakfast",
            "Brunch",
            "Vegetarian"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"30 min\n          \n        \n        \n          Active:\n           30 min",
            "Servings":"None",
            "Yield":"4 servings"
        },
        "recipe_ingredients_formatted":[
            "1 cubanelle pepper, or pepper of your choice, mild or spicy",
            "1 green bell pepper",
            "2 tablespoons unsalted butter",
            "2 tablespoons extra-virgin olive oil, divided",
            "kosher salt",
            "1 teaspoon tomato paste",
            "1 teaspoon harissa, can be found online or at Middle Eastern specialty stores",
            "1\/2 teaspoon Maras or Aleppo pepper, can be found online or at Middle Eastern specialty stores",
            "3 scallions",
            "2 large beefsteak tomatoes",
            "8 large eggs",
            "2 tablespoons chopped parsley",
            "2 Persian cucumbers or half an English cucumber",
            "12 ounces Armenian string cheese, can be found online or at Middle Eastern specialty stores",
            "4 pitas, microwave for 10 seconds to warm"
        ],
        "recipe_directions_formatted":[
            "Sauce: Roughly chop the peppers by slicing off the tops, then cut strips lengthwise around the core. Dice strips, discarding the core with some of the rib and most of the seeds. Heat 1 tablespoon butter and 1 tablespoon oil in a skillet over medium heat. Add peppers, a pinch of salt, tomato paste, harissa, Maras (or Aleppo) pepper, and sauté until soft, 3–4 minutes. Meanwhile, chop the scallions and add to the peppers when they're soft, after about 3 minutes.",
            "Halve tomatoes crosswise and pull out some of the seeds. Put a box grater in a bowl and grate the tomatoes over the largest holes until all that's left is the flattened tomato skin. Stir grated tomatoes into the peppers along with the remaining tablespoon of oil and simmer until the tomatoes are cooked and the sauce is thickened, 3–4 minutes. Taste and add more salt if necessary.",
            "Eggs: Whisk eggs with a pinch of salt. Set aside. Stir parsley and remaining tablespoon of butter into the pepper-tomato mixture. Slowly pour in the eggs, stopping and stirring in 4 additions. The eggs will scramble right away but also make the sauce creamy. Stir until eggs are still slightly runny but set, 1–2 minutes. Turn off heat and let rest (eggs will continue cooking) while you prepare the garnish.",
            "Assembly: Thinly slice cucumbers on a mandoline. Set aside. Untwist string cheese, pulling it apart into thin strands. Set aside. Spoon eggs evenly into pita bread. Garnish with string cheese and cucumbers (or leave on the side) and enjoy like a breakfast burrito."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"246",
            "Total Fat":"16 g",
            "Carbohydrates":"13 g",
            "Protein":"14 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/kabak-tatls-17884665",
        "recipe_name":"Kabak Tatlısı",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Pumpkin",
            "Squash",
            "Dessert",
            "Gluten Free",
            "Low Sodium",
            "Vegan"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"10 hr 25 min\n          \n        \n        \n          Active:\n           25 min",
            "Servings":"None",
            "Yield":"6 servings"
        },
        "recipe_ingredients_formatted":[
            "One 2-pound sugar pumpkin or kabocha squash",
            "1 1\/3 cups granulated sugar",
            "1\/2 cup tahini",
            "1\/3 cup grape or mulberry molasses (see Cook’s Note)",
            "2 tablespoons slivered or ground pistachios, optional"
        ],
        "recipe_directions_formatted":[
            "Wash, peel and remove the seeds and stringy fibers from the inside of the pumpkin. Cut it into 3-by-2-inch pieces and place them in a bowl or other container. Add the sugar, give it a good toss and cover with a lid or plastic wrap. Refrigerate for 6 to 8 hours or overnight so the pumpkin releases its juice.",
            "Preheat the oven to 350 degrees F. Transfer the pumpkin and syrupy liquid to a 9-by-13-inch baking dish. Bake until the pumpkin is tender but not mushy, 40 to 50 minutes. Let it cool completely and refrigerate for at least an hour before serving.",
            "When you’re ready to serve, place the pumpkin pieces on individual serving plates or bowls, drizzle with tahini and molasses and top with pistachios if using."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"406",
            "Total Fat":"12 g",
            "Carbohydrates":"75 g",
            "Protein":"5 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/steamed-mussels-with-white-wine-and-parsley-recipe-1963429",
        "recipe_name":"Steamed Mussels with White Wine and Parsley",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Easy Appetizer",
            "Appetizer",
            "Easy Main Dish",
            "Main Dish",
            "Mussel",
            "Shellfish Recipes",
            "Shallot Recipes",
            "Gluten Free"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"None",
            "Servings":"None",
            "Yield":"8 servings"
        },
        "recipe_ingredients_formatted":[
            "6 pounds mussels, preferably small cultivated",
            "2 cups dry white wine",
            "3 shallots, finely chopped",
            "1 Turkish bay leaf",
            "2 fresh thyme sprigs or 1\/2 teaspoon dried",
            "3 tablespoons finely chopped parsley",
            "1\/4 pound unsalted butter (optional) pepper"
        ],
        "recipe_directions_formatted":[
            "Wash and sort the mussels, pulling off any pieces of protruding beard. Combine the wine, shallots, bay leaf, and thyme in a 10-quart pot and bring to a simmer over medium heat. Simmer for about 5 minutes, then add the mussels, cover the pot, and turn the heat up to high. When steam starts to shoot out from under the lid, turn the heat back down to medium. Leave the pot on the heat for 5 minutes more. Leave the lid on the pot and holding down the lid with a kitchen towel. Shake pot to redistribute the mussels. Put the pot back on the heat for 2 minutes more. Take off the lid and check to see if all the mussels have opened. If not, replace the lid and cook for 2 minutes more. Remove the lid, wait a minute for the steam to dissipate, scoop the mussels out of the pot with a large spoon or skimmer, and place them in hot bowls, discarding any unopened mussels. If the liquid in the bottom of the pan is sandy, carefully pour it into a clean saucepan, leaving any sand or grit behind. Add the chopped parsley to the hot broth, whisk in the butter if desired, and season with pepper. Heat the broth for a 1or 2 and ladle it over the hot mussels. Serve slices of crusty bread at the table."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"361",
            "Total Fat":"8 g",
            "Carbohydrates":"19 g",
            "Protein":"41 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/tyler-florence\/ottoman-empire-yogurt-soup-recipe-1914719",
        "recipe_name":"Ottoman Empire Yogurt Soup",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Dutch Oven",
            "Middle Eastern Recipes",
            "Soup",
            "Egg Recipes",
            "Dairy Recipes",
            "Grain Recipes",
            "Barley",
            "Winter",
            "High Fiber"
        ],
        "recipe_details_formatted":{
            "Prep":"25 min\n        \n        \n        \n          Cook:\n           40 min",
            "Cook":"None",
            "Total":"1 hr 5 min",
            "Servings":"None",
            "Yield":"4 servings"
        },
        "recipe_ingredients_formatted":[
            "6 tablespoons unsalted butter",
            "1\/4 cup all-purpose flour",
            "1 quart chicken stock",
            "1 cup barley",
            "1 tablespoon kosher salt",
            "3 cups plain yogurt",
            "2 large egg yolks",
            "1 small handful fresh mint leaves, chopped",
            "1 teaspoon paprika (or traditional Kirmizi biber or Aleppo pepper if available)"
        ],
        "recipe_directions_formatted":[
            "Melt 4 tablespoons of the butter over medium heat in a Dutch oven or other large, heavy pot. Just as the foam subsides, add the flour, stirring constantly with a wooden spoon or whisk to prevent lumps. Pour in the chicken stock and continue to stir well. Bring the mixture to a simmer, and then add the barley and the salt. Reduce the heat to medium-low flame, cover, and cook for about 25 to 30 minutes, or until the barley is tender.",
            "In a large mixing bowl, blend together the yogurt and egg yolks until smooth.",
            "After the barley has softened, lower the heat and gradually whisk the yogurt mixture into the barley and cook just until it is ready to boil.",
            "For the finishing touch, melt the remaining 2 tablespoons of butter in a saute pan. When the butter is foamy, mix in the mint and paprika. Let this turn golden and stir it into the soup. Serve the soup piping hot."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"572",
            "Total Fat":"30 g",
            "Carbohydrates":"58 g",
            "Protein":"21 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/tyler-florence\/dessert-borek-recipe-1914525",
        "recipe_name":"Dessert Borek",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Fruit Dessert Recipes",
            "Dessert",
            "Fruit",
            "Baking",
            "Middle Eastern Recipes",
            "Dairy Recipes",
            "Nut Recipes",
            "Apricot",
            "Low Sodium"
        ],
        "recipe_details_formatted":{
            "Prep":"35 min\n        \n        \n        \n          Cook:\n           45 min",
            "Cook":"None",
            "Total":"1 hr 20 min",
            "Servings":"None",
            "Yield":"12 pieces"
        },
        "recipe_ingredients_formatted":[
            "1\/2 cup unsalted butter, melted and cooled, plus more for greasing the pan",
            "1 cup walnut pieces, toasted",
            "3\/4 cup pistachios",
            "1 cup dried apricots",
            "1\/4 cup honey",
            "4 phyllo pastry sheets",
            "5 teaspoons sugar"
        ],
        "recipe_directions_formatted":[
            "Preheat the oven to 350 degrees F.",
            "Brush a sheet pan with melted butter.",
            "In a food processor, pulse the walnuts and pistachios until coarsely chopped. Transfer the nuts to a large bowl. Put the apricots in the processor and pulse them until coarsely chopped, add to the nut mixture and mix well with your hands to combine. Add 2 tablespoons of the honey and 1\/4 cup of the melted butter; toss.",
            "Unroll the phyllo dough and lay the sheets flat on a work surface. Keep the pastry covered with a damp, not wet, towel as you work to prevent drying out. Place 1 sheet of phyllo on the buttered pan and brush it with more melted butter and sprinkle with about 1 teaspoon of sugar. Repeat with the 3 remaining sheets of phyllo, stacking each on top of each other and sprinkling each with sugar.",
            "Spread the nut filling in a thin layer on top of the pastry, leaving a 1-inch border on all sides. Fold in the long sides and roll up the pastry like a cigar. Brush the entire top with even more melted butter and sprinkle the pastry log with the remaining teaspoon of sugar. Bake for 45 minutes, or until golden brown and crispy.",
            "Slice the borek into 1-inch pinwheels. Drizzle with the remaining 2 tablespoons of honey before serving."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"250",
            "Total Fat":"18 g",
            "Carbohydrates":"21 g",
            "Protein":"4 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/gourmet-gorp-recipe-1908501",
        "recipe_name":"Gourmet Gorp",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Nut Recipes",
            "Cranberry",
            "Fruit",
            "Apricot",
            "Fall",
            "High Fiber"
        ],
        "recipe_details_formatted":{
            "Prep":"5 min\n        \n        \n        \n          Cook:\n           25 min",
            "Cook":"None",
            "Total":"30 min",
            "Servings":"None",
            "Yield":"about 1 3\/4 pounds gorp."
        },
        "recipe_ingredients_formatted":[
            "3 tablespoons butter",
            "1 pound whole almonds",
            "2 tablespoons finely chopped fresh rosemary",
            "2 tablespoons Worcestershire sauce",
            "1 tablespoon kosher salt",
            "1\/2 pound dried Turkish apricots, cut into thirds",
            "1 cup dried cranberries"
        ],
        "recipe_directions_formatted":[
            "Preheat an oven to 400 degrees. Place butter on a large baking sheet with sides and melt in oven for 3 to 4 minutes. Remove baking sheet and add almonds, rosemary, Worcestershire sauce, and salt. Stir until almonds are coated with seasonings, then spread almonds in a single layer. Return baking sheet to oven and turn oven down to 325 degrees. Bake for 20 minutes, stirring almonds once or twice to toast evenly. Remove and let cool in pan.",
            "When cool, transfer seasoned almonds to a large resealable plastic bag; add dried apricot pieces and dried cranberries. Seal bag and shake to toss contents. Store at room temperature up to 3 days."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"287",
            "Total Fat":"22 g",
            "Carbohydrates":"19 g",
            "Protein":"8 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/tyler-florence\/stuffed-baby-eggplant-recipe-1941754",
        "recipe_name":"Stuffed Baby Eggplant",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Lamb Recipes",
            "Eggplant Recipes",
            "Tomato",
            "Shallot Recipes",
            "Main Dish",
            "Summer",
            "Sauteing Recipes",
            "Gluten Free",
            "High Fiber"
        ],
        "recipe_details_formatted":{
            "Prep":"30 min\n        \n        \n        \n          Cook:\n           50 min",
            "Cook":"None",
            "Total":"1 hr 20 min",
            "Servings":"None",
            "Yield":"4 to 6 servings"
        },
        "recipe_ingredients_formatted":[
            "8 baby eggplants, about the size of a lemon",
            "1\/4 cup extra-virgin olive oil",
            "6 shallots, minced",
            "4 garlic cloves",
            "2 pounds ground lamb",
            "3 large vine-ripe tomatoes, peeled and finely chopped",
            "Sea salt and freshly ground black pepper",
            "1 small bunch fresh flat-leaf parsley, finely chopped, reserve some for garnish",
            "1 tablespoon finely chopped fresh mint leaves",
            "1 lemon, juiced",
            "3\/4 cup chicken stock",
            "1 lemon, sliced paper-thin"
        ],
        "recipe_directions_formatted":[
            "Preheat the oven to 350 degrees F.",
            "Using a paring knife, cut a wedge out of each eggplant, from stem to base, just large enough to stick a spoon inside and scoop out the flesh inside. Discard the flesh you scoop out.",
            "Coat a large saute pan with the oil and place over medium flame. Lightly fry the eggplants on all sides, until slightly charred and blistered; remove to a platter and set aside.",
            "Return the pan to the heat and add the shallots and garlic, saute for 5 minutes, until soft and golden brown. Add the ground lamb to the pan and brown the meat well, breaking it up with a wooden spoon. Stir in the tomatoes, combine well, and let simmer for 5 minutes; season with salt and pepper. Toss in a couple of handfuls of the parsley, the mint, and lemon juice; continue to cook for 2 to 3 minutes. Remove the pan from the heat and let the stuffing cool slightly. Using a spoon, stuff the lamb filling into the eggplants until they feel full, but not overly packed.",
            "Arrange the eggplants in a single layer in a large saucepan, pour the chicken stock over them and lay the lemon slices on top of each eggplant, drizzle with some more olive oil. Bake for 20 to 30 minutes, or until fork tender. Garnish with fresh parsley before serving."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"611",
            "Total Fat":"45 g",
            "Carbohydrates":"25 g",
            "Protein":"30 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/fall-figs-stuffed-stilton-cheese-wrapped-prosciutto-chateau-elan-port-wine-syrup-recipe-1913146",
        "recipe_name":"Fall Figs Stuffed with Stilton Cheese, Wrapped in Prosciutto and Chateau Elan Port Wine Syrup",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2004\/2\/20\/0\/fw1b04_stuffed_fall_figs.jpg.rend.hgtvcom.826.620.suffix\/1386251380015.jpeg",
        "recipe_tags_formatted":[
            "American",
            "Southern Recipes",
            "Bread",
            "Stuffing",
            "Thanksgiving",
            "Pork",
            "Fig Recipes",
            "Fruit",
            "Wine Recipes",
            "Appetizer"
        ],
        "recipe_details_formatted":{
            "Prep":"15 min\n        \n        \n        \n          Cook:\n           20 min",
            "Cook":"None",
            "Total":"35 min",
            "Servings":"None",
            "Yield":"4 servings, appetizers"
        },
        "recipe_ingredients_formatted":[
            "4 brown Turkish figs, ripe",
            "2 ounces thinly sliced prosciutto",
            "2 ounces Stilton cheese",
            "3\/4 cup Chateau Elan port wine"
        ],
        "recipe_directions_formatted":[
            "Cut figs into quarters and place them in a saucepot with the port wine and bring to boil, simmer and reduce by 2\/3. You should have a little less than a 1\/4 cup of port at a syrup consistency. Allow the port syrup to cool.",
            "On a cutting board, tear thin slices of prosciutto lengthwise in half and place 16 pieces on the board. Take a piece of fig and place it at 1 end of the prosciutto and place a small piece of Stilton cheese on top of the fig and roll the fig with the prosciutto. Continue this process with the remaining figs, Stilton cheese, and prosciutto.",
            "To serve, arrange the figs on a platter and drizzle with the port wine syrup."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"147",
            "Total Fat":"5 g",
            "Carbohydrates":"13 g",
            "Protein":"7 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/claire-robinson\/toasted-israeli-couscous-recipe-1920949",
        "recipe_name":"Toasted Israeli Couscous",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2010\/8\/5\/0\/VF0407_toasted-israeli-couscous_s4x3.jpg.rend.hgtvcom.826.620.suffix\/1371593129365.jpeg",
        "recipe_tags_formatted":[
            "Easy Side Dish Recipes",
            "Side Dish",
            "Nut Recipes",
            "Couscous",
            "Apricot",
            "Fruit",
            "High Fiber",
            "Vegan"
        ],
        "recipe_details_formatted":{
            "Prep":"10 min\n        \n        \n        \n          Cook:\n           20 min",
            "Cook":"None",
            "Total":"30 min",
            "Servings":"None",
            "Yield":"4 servings"
        },
        "recipe_ingredients_formatted":[
            "2 tablespoons lemon-flavored olive oil, plus more as needed",
            "2 cups Israeli couscous",
            "1\/4 cup shelled unsalted roasted pistachios, coarsely chopped",
            "2 1\/4 cups hot water",
            "Kosher salt and freshly cracked black pepper",
            "6 dried Turkish apricots, chopped",
            "2 scallions, sliced"
        ],
        "recipe_directions_formatted":[
            "Heat the oil in a saucepan over medium heat. Add the couscous and pistachios and cook, stirring, until toasted and light golden brown, about 7 minutes. Add the water, season with salt and pepper, to taste, and bring to a boil. Reduce the heat to a simmer, cover, and cook until the liquid is absorbed, about 10 minutes.",
            "Remove the lid, stir in the apricots and scallions, taste, and adjust the seasoning. Transfer the couscous to a serving bowl and serve warm with a little more lemon oil drizzled over the top, if desired."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"458",
            "Total Fat":"11 g",
            "Carbohydrates":"76 g",
            "Protein":"14 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/turkish-braised-lamb-shanks-with-roasted-plums-1927284",
        "recipe_name":"Turkish Braised Lamb Shanks with Roasted Plums",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Gluten Free"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"None",
            "Servings":"None",
            "Yield":"4 to 6 portions"
        },
        "recipe_ingredients_formatted":[
            "2 tablespoons paprika",
            "2 tablespoons ground, toasted cumin seed",
            "2 teaspoons ground cardamom",
            "2 teaspoons ground cinnamon",
            "1 teaspoon allspice",
            "1\/2 teaspoon ground cloves",
            "1 teaspoon salt",
            "1 teaspoon ground black pepper",
            "4 lamb shanks, about 1 to 1 1\/2 pounds each",
            "1\/4 cup olive oil",
            "2 large onions, chopped, about 2 cups",
            "1\/2 pound plums, cut in half and stones removed (damsons or Italian prune plums are a good choice)",
            "1\/4 cup sugar",
            "1 cup white wine",
            "2 cups hot chicken stock",
            "Salt and pepper to taste"
        ],
        "recipe_directions_formatted":[
            "Mix the paprika, cumin, cardamom, cinnamon, all spice, cloves, salt and pepper in a bowl. Rub the spice mix into the lamb shanks creating a spice covering that coats the lamb completely. Heat the oil over medium heat in a large dutch oven. Add the onions and begin to brown them stirring occasionally. Add the plums that you have pitted along with the sugar and cook for a few minutes with the onions. Remove the onions and plums with a slotted spoon and add the seasoned lamb to the hot dutch oven and brown the lamb well on all sides. Add the white wine and cook down by half. Add the hot stock and return the onions and plums to the pot. Adjust the seasoning, set at a simmer, cover and cook for 1 1\/2 to 2 hours or until the lamb is fork tender. Serve with almond and saffron rice."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"1039",
            "Total Fat":"64 g",
            "Carbohydrates":"31 g",
            "Protein":"75 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/michael-symon\/apple-baklava-recipe-1938159",
        "recipe_name":"Apple Baklava",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2009\/8\/7\/0\/0131755_baklava_s4x3.jpg.rend.hgtvcom.1280.720.suffix\/1371590962642.jpeg",
        "recipe_tags_formatted":[
            "Easy Dessert Recipes",
            "Dessert",
            "Easy Baking",
            "Apple Dessert",
            "Fruit Dessert Recipes",
            "Apple Recipes",
            "Fruit",
            "Baking",
            "Turkish",
            "European Recipes"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"None",
            "Servings":"None",
            "Yield":"24 servings"
        },
        "recipe_ingredients_formatted":[
            "1 pound thawed filo dough",
            "1 cup melted butter",
            "2 lemons juiced and zested",
            "4 tablespoons honey",
            "2 teaspoons cinnamon",
            "3 cups diced Granny Smith apples",
            "2 cups chopped toasted walnuts",
            "2 cups chopped toasted pistachios",
            "1 1\/2 cups sugar",
            "1\/2 cup honey",
            "1 pint water",
            "1 lemon rind"
        ],
        "recipe_directions_formatted":[
            "On a sheetpan lined with parchment paper, lay down 1 sheet of filo and brush with butter. Repeat process with 3 more sheets. Cover remaining sheets with damp towel and set aside. To make filling place the lemon juice and zest, honey, cinnamon, apples, and chopped nuts and gently heat for 3 minutes set aside to cool. Spread 1\/3 of mixture onto buttered filo stack. Top apple mixture with another stack of buttered filo. Repeat process until mixture and filo is gone (there should be 3 layers). Bake in a preheated 350 degree oven for 1 hour. Mix sugar, honey, water and lemon and bring to simmer. Remove lemon rind and pour over baklava. Let soak overnight, cut into squares and serve."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"336",
            "Total Fat":"20 g",
            "Carbohydrates":"38 g",
            "Protein":"5 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/stuffed-grape-leaves-13469279",
        "recipe_name":"Stuffed Grape Leaves",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2023\/1\/11\/FNK_stuffed_grape_leaves_4x3_v1_H.jpg.rend.hgtvcom.826.620.suffix\/1673476291902.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Side Dish",
            "Lunch",
            "Gluten Free",
            "High Fiber"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"2 hr 50 min\n          \n        \n        \n          Active:\n           1 hr",
            "Servings":"None",
            "Yield":"10 to 12 servings"
        },
        "recipe_ingredients_formatted":[
            "1\/2 cup olive oil",
            "2 medium onions, finely diced",
            "2 tablespoons tomato paste",
            "2 cups short-grain rice, rinsed",
            "1\/2 cup fresh parsley, chopped",
            "3 tablespoons dried mint",
            "1 teaspoon ground allspice",
            "2 medium tomatoes, finely chopped",
            "1 lemon, juiced",
            "Kosher salt and freshly ground black pepper",
            "1 jar grape leaves (at least 1 pound)",
            "2 medium tomatoes, sliced",
            "2 russet potatoes, peeled and sliced vertically",
            "1 large onion, sliced into rounds",
            "1\/3 cup olive oil",
            "1 tablespoon tomato paste",
            "2 lemons, juiced",
            "Kosher salt",
            "Yogurt, for serving"
        ],
        "recipe_directions_formatted":[
            "For the grape leaves and filling: Heat 1 tablespoon of the olive oil in a medium saucepan over medium heat. Cook the onions until translucent, about 5 minutes. Add the tomato paste and cook until the paste turns brick red, about 5 minutes. Set aside.",
            "Mix the rice, parsley, dried mint, allspice, tomatoes, lemon juice, 2 1\/2 teaspoons salt, 1\/2 teaspoon pepper, remaining 7 tablespoons olive oil and the reserved onion mixture in a medium bowl.",
            "Transfer the grape leaves to a colander and rinse with cold water to remove excess salt. Place a grape leaf on a work surface shiny-side down and remove the small stem. Place about 1\/2 tablespoon of the filling in the middle of the leaf. Fold up the middle, then fold in the left and right sides and roll it up into a thin log. Repeat with the remaining grape leaves and filling. You should have between 80 and 100 stuffed grape leaves.",
            "For the vegetables: Layer the bottom of a large pot with the tomatoes, half of the potatoes and half of the onions. Arrange the stuffed grape leaves in layers packed tightly next to each other so they don’t open up when cooked. Top with the rest of the potatoes and onions.",
            "For the sauce: Mix the olive oil, tomato paste, lemon juice, 1 teaspoon salt and 3 cups water in a large measuring cup. Pour over the stuffed grape leaves and vegetables and gently shake the pot so the sauce reaches the bottom. Add more cold water until it reaches the top layer and slightly covers it. Place a plate upside down on top and gently press down (to make sure the grape leaves on the top layer don’t open up). Cook on medium until most of the liquid is absorbed, a knife inserted into one of the grape leaves slides in easily and the rice is tender, about 1 hour 40 minutes.",
            "Transfer the grape leaves and vegetables to a serving platter. Enjoy the grape leaves warm, cold or at room temperature with yogurt."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"355",
            "Total Fat":"17 g",
            "Carbohydrates":"48 g",
            "Protein":"7 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/fnk\/recipes\/cheese-brek-7151612",
        "recipe_name":"Cheese Börek",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2019\/7\/16\/1\/cheese-brek-7126406.jpg.rend.hgtvcom.826.620.suffix\/1563298350158.jpeg",
        "recipe_tags_formatted":[
            "Middle Eastern Recipes",
            "Turkish",
            "Pastry Recipes",
            "Side Dish"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"1 hr 30 min\n          \n        \n        \n          Active:\n           20 min",
            "Servings":"None",
            "Yield":"8 servings"
        },
        "recipe_ingredients_formatted":[
            "1 stick unsalted butter, melted, divided",
            "3 store-bought yufka sheets (Turkish flatbread) or phyllo dough, available at Middle Eastern specialty stores or online",
            "2 large eggs",
            "2 large egg yolks",
            "1 1\/2 cups whole milk",
            "3\/4 cup whole-milk Greek yogurt",
            "1 1\/2 teaspoon Kosher salt, divided",
            "1 pound buffalo mozzarella",
            "1 teaspoon all-purpose flour",
            "2 tablespoons nigella seeds, available at Middle Eastern specialty stores or online; also known as kalonji or black onion seed",
            "1 medium tomato, halved crosswise",
            "1\/2 teaspoon marash red pepper flakes, available at Middle Eastern specialty stores or online",
            "1 tablespoon extra-virgin olive oil"
        ],
        "recipe_directions_formatted":[
            "Preheat the oven to 425 degrees F. Butter a 9-inch square baking dish with 1 teaspoon of the melted butter. Lay a yufka sheet into the baking dish, tucking it into the corners with the edges hanging over the sides. (Don't worry if it's not perfect—yufka is very forgiving.) Whisk eggs and egg yolks in a mixing bowl; then whisk in milk, yogurt, salt, and remaining melted butter. Pour ¼ cup of this custard over the prepared yufka. Repeat with a second layer of yufka and custard. Note: Yufka will dry out if it's not used right away. Cover with a clean towel if you're going to finish the dish later.",
            "Break up the mozzarella into bite-size pieces. Reserve ½ cup custard. Distribute ⅓ of the mozzarella over the bottom of the yufka. Fold edges of one of the yufka sheets into the middle, creating a new layer. Add half of the custard and mozzarella, then lay on another sheet of yufka dough. Add the remaining custard and mozzarella, then fold over the edges of the current yufka, followed by the edges of the very first one. Press down with your hand to soak the yufka. Whisk flour into reserved custard and pour over the börek. Using a small knife, score the pastry into squares, like a tic-tac-toe board. Sprinkle with nigella seeds and let rest, 15–20 minutes.",
            "Place börek in the oven and increase heat to 350 degrees F. Bake until börek is set, golden brown, and puffed on top, 50 minutes. Cool 15 minutes.",
            "When cool, cut into 3\" x 3\" squares. Place a box grater over a bowl and grate the cut sides of a tomato on the largest holes. Discard the skin. Add pepper, olive oil, and 1 teaspoon salt. Stir and set aside. Heat a skillet over low heat. Place the börek slices, cheese side down, into the heated skillet and lightly brown the cheese, 1 minute. Flip and brown the other side, 1 more minute. Serve with tomato purée on the side."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"266",
            "Total Fat":"21 g",
            "Carbohydrates":"7 g",
            "Protein":"13 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/lahmacun-12513701",
        "recipe_name":"Lahmacun",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Main Dish",
            "Lunch"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"3 hr 10 min\n          \n            (includes resting time)\n          \n        \n        \n          Active:\n           45 min",
            "Servings":"None",
            "Yield":"12 servings"
        },
        "recipe_ingredients_formatted":[
            "5 cups all-purpose flour, plus more for dusting",
            "Kosher salt",
            "1 pound ground beef (90% lean)",
            "2 cups fresh parsley, finely chopped",
            "2 tablespoons olive oil",
            "2 tablespoons tomato paste",
            "1 teaspoon ground cumin",
            "1 teaspoon Aleppo pepper",
            "1 teaspoon sumac",
            "1\/2 teaspoon freshly ground black pepper",
            "4 cloves garlic, minced",
            "2 onions, finely chopped",
            "2 Anaheim peppers, finely chopped",
            "2 large tomatoes, finely diced",
            "1 red bell pepper, finely chopped",
            "Kosher salt",
            "3 cups fresh parsley leaves",
            "1 onion, sliced",
            "2 lemons, cut into wedges"
        ],
        "recipe_directions_formatted":[
            "For the dough: Put the flour in a large bowl, add 1\/2 teaspoon salt and mix to combine. Gradually add 2 cups of warm water to the flour mixture and mix to bring the dough together. Transfer the dough to a lightly floured surface and knead until it’s soft but not sticky, about 10 minutes. Divide the dough into 12 pieces, about 3.5 ounces each, and shape into balls. Put the balls on a baking sheet lined with parchment and cover with a damp kitchen towel. Let rest for 30 to 45 minutes.",
            "For the topping: Put the ground beef, parsley, olive oil, tomato paste, cumin, Aleppo pepper, sumac, black pepper, garlic, onion, Anaheim peppers, tomatoes, bell peppers and 1 tablespoon salt in a bowl. Mix with a spoon until the ingredients are well combined. Let the mixture sit until the dough is ready.",
            "Place a baking sheet upside down on the middle rack of the oven (or use a pizza stone) and preheat the oven to 450 degrees F.",
            "Place one of the dough balls on a lightly floured surface (keep the rest under the kitchen towel) and roll it out into a thin circle about 10 inches in diameter. Place the dough on a piece of parchment and top it with a thin layer of the topping (5 to 6 tablespoons), making sure all of the dough is well coated. Transfer the dough on the parchment to the hot baking sheet. Bake until the topping is fully cooked and the edges of the dough start browning a bit, 8 to 10 minutes. Repeat with the remaining dough and topping. To keep the cooked lahmacun soft, stack them and cover with a light kitchen towel.",
            "For serving: Top the lahmacun with some parsley, sliced onion and lemon juice, then roll into a wrap."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"346",
            "Total Fat":"11 g",
            "Carbohydrates":"49 g",
            "Protein":"14 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/karniyarik-12470198",
        "recipe_name":"Karniyarik",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2022\/03\/31\/2203109_FN_Karniyarik-4x3_v1_H.jpg.rend.hgtvcom.826.620.suffix\/1648820591485.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Eggplant Recipes",
            "Main Dish",
            "Lunch",
            "Gluten Free",
            "High Fiber"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"1 hr 55 min\n          \n            (includes soaking time)\n          \n        \n        \n          Active:\n           40 min",
            "Servings":"None",
            "Yield":"6 servings"
        },
        "recipe_ingredients_formatted":[
            "6 Italian eggplants (about 8 ounces each\/3 pounds total)",
            "Kosher salt",
            "Nonstick cooking spray, for the foil",
            "3 tablespoons olive oil",
            "2 onions, finely diced",
            "4 cloves garlic, minced",
            "8 ounces ground beef",
            "2 Anaheim peppers or 1 large bell pepper, chopped",
            "1 large tomato, seeded and diced",
            "1\/2 teaspoon Aleppo pepper",
            "1\/4 teaspoon ground black pepper",
            "3 tablespoons tomato paste",
            "Chopped fresh parsley, for serving"
        ],
        "recipe_directions_formatted":[
            "Peel the eggplant skins in stripes, then cut a lengthwise slit down the middle of each eggplant without going all the way through, 1 to 1 1\/2 inches deep. Fill a 9-by-13-inch casserole dish with water and mix in 1 tablespoon salt. Add the eggplants to the water and let soak, rotating them occasionally, for 30 minutes.",
            "Preheat the oven to 400 degrees F; line a baking sheet with aluminum foil and coat it with cooking spray.",
            "Remove the eggplants from the water, gently squeeze to get rid of excess water and pat them dry. Rinse and dry the casserole dish; reserve for later.",
            "Place the eggplants on the prepared baking sheet and brush with 1 tablespoon of the olive oil. Bake until they are cooked and tender but not falling apart, 35 to 45 minutes. Remove the eggplants and lower the oven temperature to 350 degrees F.",
            "Meanwhile, to make the filling, heat the remaining 2 tablespoons olive oil in a large pan over medium-high heat. Add the onions and cook until golden, about 8 minutes. Add the garlic and cook until fragrant, 1 to 2 minutes more. Add the ground beef, breaking it up with a spatula, and cook until browned, about 10 minutes. Add the Anaheim peppers and tomato and toss to combine. Mix in the Aleppo pepper, black pepper, 1 tablespoon of the tomato paste and 1 teaspoon salt. Continue to cook, stirring occasionally, until the tomatoes have broken down and the mixture is saucy, about another 10 minutes. Remove from the heat.",
            "Transfer the eggplants to the reserved casserole dish. Open up each slit by pushing against the sides of it with a spoon, making sure the eggplant is still intact on the bottom. Spoon the filling into each eggplant.",
            "Mix the remaining 2 tablespoons tomato paste with 1 1\/2 cups hot water and 1 teaspoon salt in a measuring cup or bowl. Spoon the sauce over the eggplants and into the casserole dish. Bake until heated through and lightly browned on top, about 30 minutes. Top with parsley right before serving."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"405",
            "Total Fat":"23 g",
            "Carbohydrates":"43 g",
            "Protein":"13 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/ramazan-pidesi-10064352",
        "recipe_name":"Ramazan Pidesi",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2021\/04\/15\/0\/FNK_Ramazan-Pidesi_s4x3.jpg.rend.hgtvcom.826.620.suffix\/1618535169751.jpeg",
        "recipe_tags_formatted":[
            "Turkish"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"1 hr 30 min\n          \n        \n        \n          Active:\n           20 min",
            "Servings":"None",
            "Yield":"2 loaves"
        },
        "recipe_ingredients_formatted":[
            "1 cup milk, warmed to about 110 degrees F",
            "1\/4 cup olive oil",
            "1 tablespoon granulated sugar",
            "1 tablespoon instant dry yeast",
            "1 teaspoon kosher salt",
            "1 large egg, white and yolk separated",
            "4 1\/4 cups all-purpose flour, plus more for dusting (see Cook's Note)",
            "1 tablespoon yogurt",
            "2 tablespoons white sesame seeds, preferably toasted",
            "2 tablespoon nigella seeds"
        ],
        "recipe_directions_formatted":[
            "Line two baking sheets with parchment paper and set aside.",
            "Stir together the warm milk, 1 cup warm water (about 110 degrees F) and olive oil in a large bowl. Add the sugar, yeast, salt and egg white and stir to combine. Using a wooden spoon, stir in the flour 1 cup at a time, ending with 1\/4 cup. The dough will be sticky.",
            "Cover the bowl with plastic wrap and a kitchen towel. Place it in a draft-free spot, such as an oven (it should be at room temperature), to rise until almost doubled in size, about 30 minutes.",
            "Uncover the bowl and transfer the dough to a well-floured surface. Sprinkle the top of the dough with about 1 tablespoon flour. Bring the edges together using a bench scraper. Flip the dough using the bench scraper so the sealed part is on the bottom, then dust the dough all over with just a little flour and shape it into a ball.",
            "Cut the dough in half using the bench scraper and shape each half into a small ball. Place each ball on a prepared baking sheet, cover with a clean kitchen towel and let rise for 20 minutes.",
            "Preheat the oven to 400 degrees F.",
            "Meanwhile, make the glaze. Mix the egg yolk, yogurt and 1 tablespoon water in a small bowl.",
            "After 20 minutes, uncover the dough and gently press one half down a bit with your fingers. Pour half the glaze onto the center of the dough and, using your fingers, spread the dough into an oval shape 1\/2-inch thick. Using your fingers again, make indentations in a full circle 1 inch from the edge of the dough. Then make indentations inside the circle across the dough in lines 1 inch apart; repeat the process in the opposite direction to create a diamond pattern. Top with half the sesame seeds and nigella seeds. Repeat with the second ball of the dough.",
            "Bake until golden on top and cooked through, about 18 minutes. Remove from the oven and cover loosely with a kitchen towel for 10 minutes before serving."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"293",
            "Total Fat":"9 g",
            "Carbohydrates":"44 g",
            "Protein":"8 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/fnk\/recipes\/baked-feta-with-carrot-jam-7151664",
        "recipe_name":"Baked Feta with Carrot Jam",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2019\/7\/16\/1\/baked-feta-with-carrot-jam-7126404.jpg.rend.hgtvcom.826.620.suffix\/1563298357904.jpeg",
        "recipe_tags_formatted":[
            "Middle Eastern Recipes",
            "Turkish",
            "Feta",
            "Carrot Recipes",
            "Appetizer"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"1 hr 15 min\n          \n        \n        \n          Active:\n           30 min",
            "Servings":"None",
            "Yield":"6 servings"
        },
        "recipe_ingredients_formatted":[
            "3 cups Water",
            "1\/3 cup honey",
            "1 bay leaf",
            "2 cups grated carrots",
            "1 1\/2 teaspoons ground coriander",
            "2 teaspoons lemon juice",
            "1 tablespoon extra-virgin olive oil",
            "1 cup walnuts, toasted and finely ground",
            "1\/4 cup toasted sesame seeds",
            "1 tablespoon za?atar",
            "2 teaspoons sumac",
            "1 pinch kosher salt, plus more to taste",
            "1 teaspoon extra-virgin olive oil",
            "1 pound sheep?s-milk feta",
            "6 teaspoons extra-virgin olive oil",
            "3 scallions, sliced on a bias",
            "Pita bread for serving"
        ],
        "recipe_directions_formatted":[
            "Carrot jam, part 1: In a small saucepan, bring water to a boil with honey and bay leaf. Reduce heat and simmer until the mixture thickens slightly, about 6–8 minutes. Add grated carrots and coriander, and simmer until the carrots become thick and jam-like, about 40 minutes.",
            "Walnut crumb: In a small bowl, mix ground walnuts, sesame seeds, za’atar, sumac, and a pinch of salt. Stir in olive oil to make the mixture slightly sticky. Set aside.",
            "Feta: Preheat oven to 400 F. Slice feta into 6 equal pieces (don’t worry about breakage). Place each slice of feta on a piece of parchment paper, roughly in the middle of the paper. Spoon a heaping tablespoon of the walnut crumb over the feta and pack it down lightly. Drizzle 1 teaspoon of olive oil. Fold the parchment over the feta and seal each packet by folding or rolling the edges over twice. Transfer the packs to a baking sheet and bake for about 12 minutes.",
            "Carrot jam, part 2: When the carrots have reduced and most of the liquid has cooked down, stir in lemon juice and olive oil. Set aside.",
            "Assembly: When feta is piping hot and ready to serve, cut an X in the top of each paper packet with scissors—carefully, so the steam doesn’t burn you. Pull the tips of the triangles away from the center to open up each packet. Spoon a little carrot jam on each feta chunk, sprinkle with scallions, and serve immediately with pita bread."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"248",
            "Total Fat":"17 g",
            "Carbohydrates":"19 g",
            "Protein":"8 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/menemen-12078168",
        "recipe_name":"Menemen",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2021\/12\/16\/0\/2108115_FN_Turkish-scrambled-eggs-and-tomatoes_4x3_v1_H.JPG.rend.hgtvcom.826.620.suffix\/1639674220787.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Omelet Recipes",
            "Egg Recipes",
            "Breakfast"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"20 min\n          \n        \n        \n          Active:\n           20 min",
            "Servings":"None",
            "Yield":"4 servings"
        },
        "recipe_ingredients_formatted":[
            "2 tablespoons olive oil",
            "1 Italian sweet pepper, such as cubanelle, diced",
            "4 large tomatoes (about 1 1\/2 pounds), diced (see Cook's Note)",
            "3 large eggs",
            "Kosher salt and freshly ground black pepper",
            "1\/4 cup fresh parsley, chopped, optional",
            "Warm bread, for serving"
        ],
        "recipe_directions_formatted":[
            "Heat the olive oil in a large pan over medium heat. Saute the sweet pepper, stirring frequently, until it softens, about 5 minutes. Add the tomatoes and cook, stirring occasionally, until they start breaking down and releasing their juices, 5 to 8 minutes.",
            "Break the eggs into a small bowl and beat lightly using a fork. Add the eggs to the tomatoes and stir to combine. Add 1\/2 teaspoon salt and about 1\/3 teaspoon black pepper. Cook, gently stirring, until the eggs are just set, about 3 minutes, making sure not to overcook the eggs. Garnish with parsley if using and serve with warm bread."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"193",
            "Total Fat":"11 g",
            "Carbohydrates":"16 g",
            "Protein":"8 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/zucchini-fritters-recipe-2047828",
        "recipe_name":"Zucchini Fritters",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Easy Appetizer",
            "Appetizer",
            "Vegetarian",
            "Middle Eastern Recipes",
            "Zucchini Recipes",
            "Feta",
            "Summer",
            "Deep-Frying"
        ],
        "recipe_details_formatted":{
            "Prep":"2 hr\n        \n        \n        \n          Cook:\n           20 min",
            "Cook":"None",
            "Total":"2 hr 20 min",
            "Servings":"None",
            "Yield":"4 to 6 servings"
        },
        "recipe_ingredients_formatted":[
            "6 small zucchini, grated",
            "Salt",
            "1\/2 pound white Turkish cheese or feta, crumbled",
            "1\/4 cup finely chopped fresh dill",
            "1\/4 cup finely chopped fresh parsley",
            "4 green onions, finely chopped",
            "3 eggs, beaten",
            "1\/2 cup flour",
            "Freshly ground black pepper",
            "Oil for frying",
            "Tomato Relish, recipe follows",
            "4 tomatoes, peeled, seeded and finely chopped",
            "1 red bell pepper, seeded and finely chopped",
            "1 small onion, finely chopped",
            "1 tablespoon olive oil",
            "2 tablespoons red wine vinegar",
            "1 teaspoon dried mint",
            "1 teaspoon paprika",
            "Salt and freshly ground black pepper"
        ],
        "recipe_directions_formatted":[
            "Place grated zucchini in a colander, sprinkle with salt and let stand at least 20 minutes, or until it loses its juice. Squeeze dry and place in a large bowl. Add the cheese, dill, parsley, onions, eggs, flour, and pepper and mix well. Adjust the seasonings. If batter is too runny, add a little more flour.",
            "Heat oil in a heavy saucepan. Drop batter by tablespoons into oil and fry until golden brown on all sides but still moist inside, about 2 to 3 minutes. Drain on paper towels and serve warm with Tomato Relish.",
            "Combine all the ingredients in a bowl and mix well. Taste for seasoning. Set aside at room temperature for a few hours, or cover and chill for several days."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"729",
            "Total Fat":"67 g",
            "Carbohydrates":"20 g",
            "Protein":"16 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/lahmacun-recipe-1969779",
        "recipe_name":"Lahmacun",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Easy Main Dish",
            "Main Dish",
            "Easy Lunch Recipes",
            "Lunch",
            "Turkish",
            "Pizza Restaurants",
            "Feta",
            "Lamb Recipes",
            "Tomato",
            "Fruit"
        ],
        "recipe_details_formatted":{
            "Prep":"2 hr\n        \n        \n        \n          Cook:\n           30 min",
            "Cook":"None",
            "Total":"2 hr 30 min",
            "Servings":"None",
            "Yield":"2 to 3 large lahmacuns"
        },
        "recipe_ingredients_formatted":[
            "3\/4 teaspoon dried yeast",
            "1\/2 teaspoon sugar",
            "1 1\/2 cups lukewarm water",
            "2 1\/4 cups flour",
            "1\/2 teaspoon salt",
            "Olive oil for bowl and brushing dough",
            "1 tablespoon butter",
            "1 onion, finely chopped",
            "3 cloves garlic, minced",
            "8 ounces ground lamb or chuck",
            "1 tomato, peeled, seeded and chopped",
            "1 jalapeno, seeded and finely chopped",
            "1\/2 teaspoon kirmizi biber, or combination sweet paprika and cayenne pepper",
            "1\/4 cup finely chopped fresh mint",
            "1\/4 cup finely chopped fresh parsley",
            "Salt and freshly ground black pepper",
            "Juice of 1 lemon",
            "2 1\/2 cups white Turkish cheese or feta cheese, crumbled",
            "2 eggs, lightly beaten",
            "1\/4 cup unsalted butter, softened",
            "1\/2 cup finely chopped fresh parsley"
        ],
        "recipe_directions_formatted":[
            "Combine the yeast and sugar with a little of the warm water, and set aside until mixture is frothy. Sift the flour and salt into a large bowl, and make a well in the center. Add the yeast mixture, along with the remaining warm water. Using your hands, work the mixture into a dough, adding more water if necessary. Transfer dough to a lightly floured surface and knead until pliable and springy, about 5 minutes. Place dough in an oiled bowl, turning to coat, cover with a damp cloth and let rise in a warm place until dough doubles in size, about 1 hour.",
            "Punch down risen dough and knead on a lightly floured surface. Roll into a log and cut into 2 to 3 equal pieces. Roll each piece into a ball, place on floured surface and let rest 30 minutes under a towel.",
            "Preheat oven to 450 degrees F, and preheat baking sheets, tiles, or a baking stone.",
            "Prepare the filling: Melt the butter in a skillet, add the onion and saute until softened, 5 to 7 minutes. Add the garlic and saute another minute. Transfer onion mixture to a large bowl, add remaining ingredients, and mix thoroughly with your fingertips. If mixture seems too dry, add a teaspoon of water.",
            "Place a ball of dough on a floured surface and roll into a round, flat circle, about 1\/8-inch thick. Place the round on the oiled, preheated baking sheets or tiles. Brush the top with olive oil and spread with a thin, even layer of the meat filling, leaving a 1\/2-inch border around the edge. Repeat with remaining dough and filling.",
            "Bake for 12 to 15 minutes. The dough should still be soft enough to roll up.",
            "Squeeze a little lemon juice over each of the hot lahmacuns, and serve immediately either flat or rolled up into cones.",
            "For the alternative filling: Mix all the filling ingredients in a bowl and blend thoroughly. Spread a thin layer on each circle of dough. Proceed with recipe, but bake for only 6 to 8 minutes."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"1223",
            "Total Fat":"76 g",
            "Carbohydrates":"90 g",
            "Protein":"46 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/cold-baklava-with-milk-14039899",
        "recipe_name":"Cold Baklava with Milk",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2023\/3\/16\/2304106_FN_cold_baklava-4x3_v1_H.jpg.rend.hgtvcom.826.620.suffix\/1679069388761.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Dessert",
            "Summer",
            "Low Sodium"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"3 hr 45 min\n          \n            (includes cooling and soaking times)\n          \n        \n        \n          Active:\n           35 min",
            "Servings":"None",
            "Yield":"24 servings"
        },
        "recipe_ingredients_formatted":[
            "1 1\/2 cups granulated sugar",
            "3 cups whole or 2% milk",
            "1 1\/2 cups walnuts",
            "1 tablespoon granulated sugar",
            "1 package frozen phyllo dough (about 1 pound), thawed according to package directions",
            "3 sticks (1 1\/2 cups) unsalted butter, melted",
            "4 1\/2 teaspoons cocoa powder",
            "1 tablespoon confectioners' sugar",
            "2 tablespoons ground pistachios",
            "Chocolate shavings, for serving, optional"
        ],
        "recipe_directions_formatted":[
            "For the simple syrup: Put the granulated sugar and 1 cup water in a medium saucepan over medium-high heat and bring to a simmer. Lower the heat to medium and simmer until the syrup has thickened a bit, about 15 minutes. Set the syrup aside to cool completely.",
            "For the baklava: Meanwhile, preheat the oven to 350 degrees F.",
            "Put the walnuts and granulated sugar in the bowl of a food processor and pulse, stopping every few pulses to scrape down the sides, until finely chopped. Be careful not to overprocess into walnut butter.",
            "To assemble the baklava: Unroll the phyllo sheets and cover them with a kitchen towel to prevent them from drying out. Brush the bottom of a 9-by-13-inch pan with the butter and add 1 phyllo sheet. If your phyllo sheets are larger than the pan, simply fold them; there is no need to cut them. Brush with butter and top with another phyllo sheet. Repeat until you've layered half of the phyllo sheets and each sheet is brushed with butter. Sprinkle with the walnut mixture and top with the remaining phyllo sheets, brushing each sheet with butter, including the top sheet. Cut the pastry into 24 squares. Pour the remaining butter evenly over the baklava.",
            "Bake until the top is crispy and golden, about 1 hour. Let sit for 10 minutes.",
            "Mix the simple syrup with the milk and pour it evenly over the baklava. Let sit at room temperature until cooled completely and the syrup has soaked in, about 2 hours.",
            "For the topping: Mix the cocoa powder with the confectioners' sugar and sift it over the baklava. Top with the ground pistachios and chocolate shavings, if using, before serving."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"281",
            "Total Fat":"19 g",
            "Carbohydrates":"27 g",
            "Protein":"4 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/steamed-mussels-with-white-wine-and-parsley-recipe0-1908851",
        "recipe_name":"Steamed Mussels with White Wine and Parsley",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Steamer",
            "French Recipes",
            "American",
            "European Recipes",
            "Shellfish Recipes",
            "Mussel",
            "Shallot Recipes",
            "Main Dish",
            "Appetizer",
            "Low-Fat"
        ],
        "recipe_details_formatted":{
            "Prep":"15 min\n        \n        \n        \n          Cook:\n           15 min",
            "Cook":"None",
            "Total":"30 min",
            "Servings":"None",
            "Yield":"8 servings"
        },
        "recipe_ingredients_formatted":[
            "6 pounds mussels, preferably small cultivated",
            "2 cups dry white wine",
            "3 shallots, finely chopped",
            "1 Turkish bay leaf",
            "2 fresh thyme sprigs or 1\/2 teaspoon dried",
            "3 tablespoons finely chopped parsley",
            "1\/4 pound unsalted butter (optional) pepper"
        ],
        "recipe_directions_formatted":[
            "Wash and sort the mussels, pulling off any pieces of protruding beard. Combine the wine, shallots, bay leaf, and thyme in a 10-quart pot and bring to a simmer over medium heat. Simmer for about 5 minutes, then add the mussels, cover the pot, and turn the heat up to high. When steam starts to shoot out from under the lid, turn the heat back down to medium. Leave the pot on the heat for 5 minutes more. Leave the lid on the pot and holding down the lid with a kitchen towel- shake pot to redistribute the mussels. Put the pot back on the heat for 2 minutes more. Take off the lid and check to see if all the mussels have opened. If not, replace the lid and cook for 2 minutes more. Remove the lid, wait a minute for the steam to dissipate, scoop the mussels out of the pot with a large spoon or skimmer, and place them in hot bowls, discarding any unopened mussels. If the liquid in the bottom of the pan is sandy, carefully pour it into a clean saucepan, leaving any sand or grit behind. Add the chopped parsley to the hot broth, whisk in the butter if desired, and season with pepper. Heat the broth for a 1 or 2 minutes and ladle it over the hot mussels. Serve slices of crusty bread at the table."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"361",
            "Total Fat":"8 g",
            "Carbohydrates":"19 g",
            "Protein":"41 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/turkish-coffee-pots-de-creme-recipe-1972952",
        "recipe_name":"Turkish Coffee Pots de Creme",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2009\/12\/13\/0\/FNM_020110-Challenge-Winner-005_s4x3.jpg.rend.hgtvcom.826.620.suffix\/1371591056049.jpeg",
        "recipe_tags_formatted":[
            "Easy Dessert Recipes",
            "Dessert",
            "Easy Lunch Recipes",
            "Lunch",
            "Turkish",
            "Nut Recipes",
            "Egg Recipes",
            "Sugar",
            "Gluten Free",
            "Low Sodium"
        ],
        "recipe_details_formatted":{
            "Prep":"30 min\n        \n        \n          Inactive:\n           40 min\n        \n        \n          Cook:\n           45 min",
            "Cook":"None",
            "Total":"1 hr 55 min",
            "Servings":"None",
            "Yield":"8 servings"
        },
        "recipe_ingredients_formatted":[
            "1 2\/3 cups plus 1\/2 cup heavy cream",
            "1\/3 cup cardamom pods, cracked",
            "4 extra-large egg yolks, at room temperature",
            "Pinch of kosher salt",
            "1\/2 cup granulated sugar",
            "1 1\/2 tablespoons instant espresso",
            "1\/2 teaspoon vanilla extract",
            "1 tablespoon confectioners' sugar",
            "1\/3 cup ground pistachios"
        ],
        "recipe_directions_formatted":[
            "Bring 1 2\/3 cups cream to a boil in a saucepan over medium heat. Remove from the heat, add the cardamom, cover and let steep 30 minutes.",
            "Preheat the oven to 325 degrees F. Bring a small pot or kettle of water to a boil. Place a folded damp kitchen towel in a 2-quart baking dish; arrange 8 espresso cups in the dish (the towel will keep the cups from moving).",
            "Whisk the egg yolks and salt in a bowl. Return the cream to medium heat, add the sugar and bring to a boil, stirring to dissolve the sugar. Strain the cream into the egg yolks, whisking constantly. Stir in the espresso and vanilla until combined. Transfer to a liquid measuring cup, then divide among the espresso cups.",
            "Place the baking dish in the oven and pour boiling water into the dish until it reaches halfway up the outside of the espresso cups. Cover the dish tightly with foil and bake until the custard sets around the edges but still jiggles in the center, 35 to 45 minutes.",
            "Let the custards cool in the water bath, about 10 minutes, then transfer to a rack to cool completely, about 30 minutes. Cover each cup with parchment paper (to absorb condensation), and then plastic wrap. Refrigerate until set, at least 2 hours.",
            "Whip the remaining 1\/2 cup cream and the confectioners' sugar with a mixer until soft peaks form. Top each pot de creme with a dollop of whipped cream and sprinkle with pistachios."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"349",
            "Total Fat":"29 g",
            "Carbohydrates":"20 g",
            "Protein":"4 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/bourbon-minted-fruit-kabobs-recipe2-1947456",
        "recipe_name":"Bourbon Minted Fruit Kabobs",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Easy Dessert Recipes",
            "Dessert",
            "Fruit Dessert Recipes",
            "Fruit",
            "Turkish",
            "American",
            "European Recipes",
            "Grape Recipes",
            "Bourbon",
            "Sugar"
        ],
        "recipe_details_formatted":{
            "Prep":"15 min\n        \n        \n          Inactive:\n           2 hr\n        \n        \n          Cook:\n           5 min",
            "Cook":"None",
            "Total":"2 hr 20 min",
            "Servings":"None",
            "Yield":"8 servings"
        },
        "recipe_ingredients_formatted":[
            "1 cup bourbon",
            "1 cup water",
            "1 handful mint leaves, chopped, plus more for garnish",
            "1 cup sugar",
            "1 cantaloupe cut into 32 wedges",
            "1 honeydew cut into 32 wedges",
            "1 pineapple cut into 32 wedges",
            "32 strawberries",
            "32 grapes"
        ],
        "recipe_directions_formatted":[
            "In a saucepan over high heat, bring the bourbon and water to a boil. Add the sugar and stir until it is dissolved. Add the mint, cover, and let stand for 1 hour. Chill.",
            "While that is cooling, skewer the fruit onto metal or bamboo skewers, alternating the fruit for color and texture. Place the kabobs on a platter. Drizzle them with the cold mint bourbon sauce. Garnish with fresh mint."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"325",
            "Total Fat":"1 g",
            "Carbohydrates":"65 g",
            "Protein":"2 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/bourbon-minted-fruit-kabobs-recipe-2014401",
        "recipe_name":"Bourbon Minted Fruit Kabobs",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Easy Dessert Recipes",
            "Dessert",
            "Fruit Dessert Recipes",
            "Fruit",
            "American",
            "European Recipes",
            "Turkish",
            "Cantaloupe",
            "Liquor Recipes",
            "Whiskey Recipes"
        ],
        "recipe_details_formatted":{
            "Prep":"25 min\n        \n        \n          Inactive:\n           2 hr\n        \n        \n          Cook:\n           5 min",
            "Cook":"None",
            "Total":"2 hr 30 min",
            "Servings":"None",
            "Yield":"8 servings"
        },
        "recipe_ingredients_formatted":[
            "1 cup bourbon",
            "1 cup water",
            "1 handful mint leaves, chopped, plus more for garnish",
            "1 cup sugar",
            "1 cantaloupe cut into 32 wedges",
            "1 honeydew cut into 32 wedges",
            "1 pineapple cut into 32 wedges",
            "32 strawberries",
            "32 grapes"
        ],
        "recipe_directions_formatted":[
            "Skewers",
            "In a saucepan over high heat, bring the bourbon and water to a boil. Add the sugar and stir until it is dissolved. Add the mint, cover, and let stand for 1 hour. Chill.",
            "While that is cooling, skewer the fruit onto metal or bamboo skewers, alternating the fruit for color and texture. Place the kabobs on a platter. Drizzle them with the cold mint bourbon sauce. Garnish with fresh mint."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"325",
            "Total Fat":"1 g",
            "Carbohydrates":"65 g",
            "Protein":"2 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/tyler-florence\/roasted-leg-of-lamb-with-spices-roasted-fennel-and-sweet-red-pepper-mayonnaise-recipe-1943058",
        "recipe_name":"Roasted Leg of Lamb with Spices, Roasted Fennel, and Sweet Red Pepper Mayonnaise",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Roast Recipes",
            "Lamb Recipes",
            "Nut Recipes",
            "Leg of Lamb",
            "Main Dish",
            "Pureeing Recipes",
            "Roasting",
            "Gluten Free",
            "High Fiber"
        ],
        "recipe_details_formatted":{
            "Prep":"30 min\n        \n        \n          Inactive:\n           10 min\n        \n        \n          Cook:\n           1 hr 30 min",
            "Cook":"None",
            "Total":"2 hr 10 min",
            "Servings":"None",
            "Yield":"8 servings"
        },
        "recipe_ingredients_formatted":[
            "5 garlic cloves",
            "1\/2 bunch fresh flat-leaf parsley, chopped",
            "1 tablespoon extra-virgin olive oil",
            "Salt and freshly ground black pepper",
            "1 leg of lamb (about 7 pounds), thighbone removed (see note)",
            "Turkish Spice Mix, recipe follows",
            "3 fennel bulbs, trimmed and quartered",
            "Salt and freshly ground black pepper",
            "1 lemon, juiced",
            "Extra-virgin olive oil",
            "1\/2 cup walnut pieces",
            "2 cups mayonnaise",
            "2 garlic cloves, chopped",
            "1 roasted red pepper, torn into narrow strips by hand",
            "1 fresh hot red chile, stemmed",
            "Pinch sugar",
            "1\/2 lemon, juiced",
            "Salt and freshly ground black pepper",
            "3 tablespoons allspice berries",
            "2 teaspoons whole black peppercorns",
            "2 teaspoons fennel seeds",
            "2 teaspoons cumin seeds",
            "2 teaspoons coriander seeds",
            "1-inch piece cinnamon stick",
            "1 teaspoon cloves"
        ],
        "recipe_directions_formatted":[
            "Preheat the oven to 375 degrees F.",
            "Stir together the garlic, parsley, olive oil, salt and pepper to make a paste. Spread that over the inside of the leg of lamb. Tie the leg crosswise with several lengths of butchers twine. Coat the outside of the leg of lamb with the Turkish Spice Mix and set it on a rack in a roasting pan.",
            "Put the fennel in a small, deep baking dish (or souffle dish) and sprinkle with salt and pepper. Add the lemon juice and enough oil to entirely cover the fennel (2 1\/2 to 3 cups, maybe more depending on the size of the dish). Cover with aluminum foil. Put the lamb and the fennel in the oven and cook until the fennel is very soft and the lamb is medium (140 degrees F), about 1 hour for the fennel, and about 1 1\/2 hours for the lamb. Let the lamb rest 10 minutes before slicing.",
            "While the lamb is roasting, make the mayonnaise: Grind the walnuts to a coarse powder in a food processor. Add all of the remaining ingredients and puree; set aside.",
            "Slice the lamb against the grain and serve it with the roasted fennel and sweet red pepper mayonnaise.",
            "Combine the spices in a spice mill or clean coffee grinder and grind to a powder. Store in an air-tight container."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"1250",
            "Total Fat":"105 g",
            "Carbohydrates":"17 g",
            "Protein":"61 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/fnk\/recipes\/cucumber-yogurt-dip-7151633",
        "recipe_name":"Cucumber-Yogurt Dip",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2019\/7\/16\/1\/cucumber-yogurt-dip-7126407.jpg.rend.hgtvcom.826.620.suffix\/1563298352753.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Dip",
            "Dairy Recipes",
            "Cucumber",
            "Gluten Free"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"15 min\n          \n        \n        \n          Active:\n           15 min",
            "Servings":"None",
            "Yield":"6 servings"
        },
        "recipe_ingredients_formatted":[
            "1 clove garlic",
            "1 tablespoon lemon juice",
            "kosher salt",
            "3\/4 cup English cucumber",
            "2 scallions",
            "2 tablespoons chopped parsley",
            "1 cup whole milk Greek yogurt",
            "1\/2 teaspoon dried mint",
            "1 tablespoon extra-virgin olive oil"
        ],
        "recipe_directions_formatted":[
            "Cut the garlic clove in half and place the halves at the edge of the cutting board. Use the dull side of your chef's knife to cut the garlic almost to a mash, then use the sharp side to mince it. Put the garlic and lemon juice in a small bowl along with a pinch of salt to remove the raw taste from the garlic and lightly pickle it.",
            "Chop the cucumber, scallions, and parsley and add them to the garlic.",
            "Finish by mixing in the yogurt, dried mint, and olive oil. Season with salt and serve with crudités, pita, or latkes."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"101",
            "Total Fat":"7 g",
            "Carbohydrates":"4 g",
            "Protein":"6 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/fnk\/recipes\/red-lentil-wraps-7151673",
        "recipe_name":"Red Lentil Wraps",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2019\/7\/16\/1\/red-lentil-wraps-7126409.jpg.rend.hgtvcom.826.620.suffix\/1563298360374.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Grain Recipes",
            "Beans and Legumes",
            "Lentil Recipes",
            "Onion Recipes",
            "Main Dish",
            "Vegetarian"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"1 hr 30 min\n          \n        \n        \n          Active:\n           1 hr",
            "Servings":"None",
            "Yield":"6 servings"
        },
        "recipe_ingredients_formatted":[
            "1 medium onion, chopped",
            "1 tablespoon unsalted butter",
            "3 tablespoons extra-virgin olive oil, divided",
            "1 1\/2 carrots, grated",
            "2 teaspoons tomato paste",
            "1 teaspoon ground cumin",
            "3\/4 teaspoon Maras pepper, plus more to taste, dried red chili flakes",
            "1\/2 cup red lentils, rinsed",
            "2 cups water",
            "1\/2 teaspoon kosher salt",
            "1\/2 cup fine-ground bulgur wheat",
            "1 14.5-ounce can crushed tomatoes",
            "1 clove garlic, minced",
            "1 tablespoon brown butter, Simmer ½ stick butter in a small saucepan over low heat until brown and nutty, 6?10 minutes, then strain and cool.",
            "1\/2 tsp kosher salt",
            "1 3\/4 cups all-purpose flour, plus more as needed and for rolling dough",
            "1 teaspoon kosher salt",
            "3\/4 cup warm water",
            "2 tablespoons extra-virgin olive oil, plus more for the bowl",
            "3 Romaine leaves, chopped in ribbons",
            "3 peperoncini, stemmed and chopped"
        ],
        "recipe_directions_formatted":[
            "Lentil filling, part 1: In a medium pot over medium heat, add the butter and 1 tablespoon olive oil. Add the onion and carrots, stir, and “sweat” until soft and translucent, 5 minutes. Stir in the tomato paste, cumin, and Maras pepper and continue cooking another 1–2 minutes. Add the lentils, stir to coat, then add 1 tablespoon oil and 2 cups water—the mixture will look like lentil soup. Lower the heat to medium-low and simmer until the lentils are tender and have absorbed about three-quarters of the liquid, 10 minutes.",
            "Tomato brown butter: In a small saucepan over medium heat, add the tomatoes, garlic, 1 tablespoon brown butter, and salt. Stir and cook until thickened and shiny, 3–5 minutes. Blend in the saucepan using an immersion blender until smooth, with the consistency of pizza sauce.",
            "Lentil filling, part 2: When the lentils are soft and the mixture has thickened, add the salt and bulgur. Stir vigorously for 30 seconds, then add 1 tablespoon olive oil. Stir again, turn off the heat, then set aside to rest 10 minutes (covered or uncovered).",
            "Flatbread, part 1: In a mixing bowl, add flour and salt. Using your hand, make a well in the center and pour in water and olive oil. Mix until dough forms, adding more flour if necessary, about 3 minutes. Transfer to a bowl, drizzle with a little bit of oil, and turn to coat. Cover with plastic wrap and let rest at room temperature at least 20 minutes, or up to 4 hours (or overnight in the refrigerator).",
            "Flatbread, part 2: When the dough has rested, it will look smooth and be very soft. Divide the dough in half, then divide each half into three equal pieces. Roll out each ball into a very thin 8-to-9-inch round, using more flour to keep the dough from sticking to the rolling pin. Heat a cast-iron skillet or nonstick pan over low heat and cook the dough on one side until it starts to bubble up and lightly brown on the bottom, about 2 minutes. Flip and cook the other side about 30 seconds, so the bread stays soft and pliable.",
            "Assembly: Put 3 tablespoons of the tomato brown butter on each flatbread and smooth it to the edges in a very thin layer. Spread a heaping scoop (about ¼ cup) of the lentil mixture on one side of the flatbread. Spread a small handful of romaine and pepperoncini (about ¼ cup) on the other side. Fold both sides over toward the middle so that you have a rectangle with the round ends of the flatbread in the middle. Press down gently to seal everything and distribute it in an even layer. Then fold the flatbread in half lengthwise so that you have a long, thin, flat wrap.",
            "Cook: When the wraps are assembled, heat a cast-iron skillet over medium-low heat. Place two wraps at a time, seam side down, in the pan. Cook until the filling is hot and the bread is lightly toasted on one side but still soft on the other, about 4 minutes. Flip to the other side and cook 1 minute more to heat through. Cut into halves or strips and serve immediately with additional tomato brown butter."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"270",
            "Total Fat":"11 g",
            "Carbohydrates":"37 g",
            "Protein":"8 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/giada-de-laurentiis\/noodle-paella-recipe-2102459",
        "recipe_name":"Noodle Paella",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/video\/0\/02\/020\/0200\/0200299.jpg.rend.hgtvcom.1280.720.suffix\/1660153347490.jpeg",
        "recipe_tags_formatted":[
            "European Recipes",
            "Spanish",
            "Sausage Recipes",
            "Chicken Recipes",
            "Poultry",
            "Main Dish"
        ],
        "recipe_details_formatted":{
            "Prep":"30 min\n        \n        \n        \n          Cook:\n           30 min",
            "Cook":"None",
            "Total":"1 hr",
            "Servings":"None",
            "Yield":"6 servings"
        },
        "recipe_ingredients_formatted":[
            "3 tablespoons extra-virgin olive oil",
            "3 sweet Italian sausages, casing removed (about 12 ounces)",
            "1 skinless boneless chicken breast (about 6 ounces), cut into 3\/4-inch cubes",
            "3\/4 teaspoon kosher salt, plus extra for seasoning",
            "3\/4 teaspoon freshly ground black pepper, plus extra for seasoning",
            "6 large cloves garlic, thinly sliced",
            "1 medium fennel bulb, chopped",
            "1 small onion, chopped",
            "1 medium red bell pepper, stemmed, seeded, diced",
            "Three 8-ounce bottles clam juice",
            "One 15-ounce can diced tomatoes in juice",
            "1 teaspoon smoked paprika",
            "1\/4 teaspoon finely crumbled stem saffron",
            "1\/8 teaspoon cayenne pepper",
            "3 Turkish bay leaves",
            "8 ounces spaghetti, broken into 1-inch lengths",
            "8 ounces halibut fillet, cut into eight 1-inch cubes",
            "12 small littleneck clams, scrubbed",
            "12 large shrimp, peeled and deveined",
            "1\/3 cup roughly chopped fresh Italian parsley"
        ],
        "recipe_directions_formatted":[
            "Heat the oil over medium-high heat in a 6-quart Dutch oven. Add the sausages and stir, breaking up the sausages into small pieces with a wooden spoon, until cooked through, about 4 minutes. Add the chicken, 1\/4 teaspoon salt and pepper. Cook until the chicken is no longer pink on the outside, 1 to 2 minutes. Transfer the chicken and sausage to a medium bowl, using a slotted spoon.",
            "Add the garlic, fennel, onion, bell pepper and 1\/2 teaspoon salt and pepper to the pan. Cook until almost tender, about 5 minutes. Add the clam juice, tomatoes with juices, paprika, saffron, cayenne and bay leaves. Add the spaghetti and cook, uncovered, until almost tender, stirring occasionally, about 9 minutes. Return the chicken and sausage to the pan. Bring the sauce to a simmer. Add 1\/4 teaspoon salt and pepper. Add the halibut, clams and shrimp. Cover and cook until the clams open, 4 to 5 minutes. Discard any unopened clams. Remove the cover, reduce heat to medium-low, and simmer gently until fish, shrimp and chicken are just tender, 4 to 5 minutes. Remove the bay leaves and discard. Season with salt and pepper. Mix in the parsley and serve."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"566",
            "Total Fat":"27 g",
            "Carbohydrates":"39 g",
            "Protein":"40 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/turkish-coffee-brownies-7550003",
        "recipe_name":"Turkish Coffee Brownies",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2019\/10\/10\/MW406_turkish-coffee-brownies-s4x3.jpg.rend.hgtvcom.1280.720.suffix\/1570722287763.jpeg",
        "recipe_tags_formatted":[
            "Brownie",
            "Coffee Recipes",
            "Dessert",
            "Low Sodium"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"1 hr 25 min\n          \n            (includes cooling time)\n          \n        \n        \n          Active:\n           20 min",
            "Servings":"None",
            "Yield":"16 brownies"
        },
        "recipe_ingredients_formatted":[
            "Nonstick cooking spray, for the pan",
            "1 cup granulated sugar",
            "1\/2 cup all-purpose flour",
            "1\/3 cup unsweetened cocoa powder",
            "2 teaspoons instant espresso powder",
            "1\/2 teaspoon ground cardamom",
            "1\/4 teaspoon baking powder",
            "1\/4 teaspoon cinnamon",
            "1\/4 teaspoon kosher salt",
            "1 stick (8 tablespoons) unsalted butter, melted but not hot",
            "1 teaspoon vanilla extract",
            "2 large eggs",
            "3\/4 cup chopped toasted walnuts, plus more for topping",
            "1 cup powdered sugar",
            "3 tablespoons cocoa powder",
            "3 tablespoons unsalted butter, melted",
            "1 tablespoon brewed coffee or 1\/4 teaspoon espresso powder plus 1 tablespoon water",
            "1 tablespoon honey",
            "1 teaspoon vanilla extract",
            "1\/4 teaspoon ground cardamom",
            "Pinch kosher salt",
            "Sprinkles, for topping"
        ],
        "recipe_directions_formatted":[
            "For the brownies: Preheat the oven to 350 degrees F. Grease an 8-inch square pan with cooking spray and line with parchment paper, allowing 1-inch wings to hang over the edges.",
            "Whisk together the granulated sugar, flour, cocoa powder, espresso powder, cardamom, baking powder, cinnamon and salt in a large bowl. Whisk together the butter, vanilla and eggs in a medium bowl. Pour the wet mixture into the dry mixture and stir to combine. Fold in the walnuts.",
            "Pour the batter into the prepared pan and spread it out evenly (it will be quite a thin layer). Bake until a toothpick inserted in the center comes out clean, about 25 minutes. Cool in the pan on a rack for 10 minutes, then lift out of the pan and place on the rack to cool completely.",
            "For the glaze: Whisk together the powdered sugar, cocoa powder, butter, coffee, honey, vanilla, cardamom and salt in a medium bowl until smooth.",
            "Pour the glaze on the cooled brownie, spread it around and top with walnuts and sprinkles. Let dry, then cut into squares."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"227",
            "Total Fat":"13 g",
            "Carbohydrates":"27 g",
            "Protein":"3 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/turkish-style-mocha-recipe-2118314",
        "recipe_name":"Turkish-Style Mocha",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Coffee Drinks",
            "Gluten Free",
            "Low-Fat",
            "Low Sodium"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"None",
            "Servings":"None",
            "Yield":"4 servings"
        },
        "recipe_ingredients_formatted":[
            "3\/4 cup ground dark roast coffee",
            "1 Tbs. ground cardamom",
            "6 cups water",
            "2 cups whole milk or half-and-half",
            "1\/2 cup sugar",
            "1\/2 cup chocolate syrup"
        ],
        "recipe_directions_formatted":[
            "Combine the coffee and cardamom in a coffee filter. Brew the coffee in a coffeemaker with the water. Meanwhile, heat the milk, sugar and chocolate syrup in a medium-size saucepan over medium heat. Stir the brewed coffee into the saucepan, pour the mixture into four cups and serve immediately."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"281",
            "Total Fat":"4 g",
            "Carbohydrates":"56 g",
            "Protein":"5 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/tyler-florence\/turkish-spice-mix-recipe-1915811",
        "recipe_name":"Turkish Spice Mix",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Easy Main Dish",
            "Main Dish",
            "Turkish",
            "Gluten Free",
            "High Fiber",
            "Low Sodium",
            "Vegan",
            "Vegetarian"
        ],
        "recipe_details_formatted":{
            "Prep":"5 min",
            "Cook":"None",
            "Total":"5 min",
            "Servings":"None",
            "Yield":"1\/4 cup"
        },
        "recipe_ingredients_formatted":[
            "3 tablespoons allspice berries",
            "2 teaspoons whole black peppercorns",
            "2 teaspoons fennel seeds",
            "2 teaspoons cumin seeds",
            "2 teaspoons coriander seeds",
            "1-inch piece of cinnamon stick",
            "1 teaspoon cloves"
        ],
        "recipe_directions_formatted":[
            "Combine the spices in a spice mill or clean coffee grinder and grind to a powder. Store in an air-tight container."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"57",
            "Total Fat":"2 g",
            "Carbohydrates":"13 g",
            "Protein":"2 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/fnk\/recipes\/turkish-flatbread-yufka-7151317",
        "recipe_name":"Turkish Flatbread (Yufka)",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2019\/7\/16\/1\/turkish-flatbread-yufka-7128748.jpg.rend.hgtvcom.826.620.suffix\/1563298347455.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Side Dish",
            "Fall",
            "Vegan"
        ],
        "recipe_details_formatted":{
            "Prep":"None",
            "Cook":"None",
            "Total":"45 min\n          \n        \n        \n          Active:\n           25 min",
            "Servings":"None",
            "Yield":"6 servings"
        },
        "recipe_ingredients_formatted":[
            "1 3\/4 cups all-purpose flour, plus more as needed",
            "1 teaspoon kosher salt",
            "3\/4 cup warm water",
            "2 tablespoons extra-virgin olive oil, plus more for the mixing bowl"
        ],
        "recipe_directions_formatted":[
            "In a mixing bowl, add flour and salt. Use your hand to make a well in the center; pour in water and olive oil. Mix until dough forms, adding more flour if necessary, about 3 minutes. The dough will be extremely sticky and shaggy. Transfer to a clean bowl, drizzle with a little bit of oil, and turn to coat. Cover with plastic wrap and let rest at room temperature at least 20 minutes, or up to 4 hours (or overnight in the refrigerator).",
            "When the dough has rested, it will look smooth and be very soft. Divide the dough in half, then divide each half into three equal pieces. Roll the first ball into a very thin 8- or 9-inch round, using more flour to keep the dough from sticking to the rolling pin. Heat a cast-iron skillet or nonstick pan over low heat until hot. Cook the first flatbread on one side until it starts to bubble up and lightly brown on the bottom, about 2 minutes. Flip and cook the other side, about 30 seconds; the bread should stay soft and pliable. Set finished flatbread aside.",
            "Wiping out excess flour in the pan as you go, continue rolling and cooking until you have a stack of warm yufka. Serve immediately with hummus, baba ghanoush, or another dip. (Alternatively, use flatbreads for Chef Sortun's Red Lentil Wraps.) (Note: After completely cooling, flatbread can be stored in a zip-top plastic bag in the refrigerator for up to 5 days. To reheat, wrap in aluminum foil and place in a 250 degrees F oven for 8–10 minutes, or wrap in a damp towel and microwave for 15–30 seconds.)"
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"259",
            "Total Fat":"7 g",
            "Carbohydrates":"42 g",
            "Protein":"6 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/nigella-lawson\/turkish-delight-syllabub-recipe-2203660",
        "recipe_name":"Turkish Delight Syllabub",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/fullset\/2007\/4\/26\/0\/ne0112_syllabub.jpg.rend.hgtvcom.826.620.suffix\/1384817720180.jpeg",
        "recipe_tags_formatted":[
            "Easy Dessert Recipes",
            "Dessert",
            "Fruit Dessert Recipes",
            "Fruit",
            "Mixer Recipes",
            "Turkish",
            "Orange Recipes",
            "Dairy Recipes",
            "Sugar",
            "Liqueur Recipes"
        ],
        "recipe_details_formatted":{
            "Prep":"10 min",
            "Cook":"None",
            "Total":"10 min",
            "Servings":"None",
            "Yield":"6 to 8 servings"
        },
        "recipe_ingredients_formatted":[
            "3\/4 cup orange-flavored liqueur (recommended: Cointreau)",
            "2 lemons, juiced",
            "8 tablespoons sugar",
            "Just under 2 1\/2 cups heavy cream",
            "2 tablespoons rose water",
            "2 tablespoons orange-flower water",
            "2 tablespoons finely chopped shelled pistachios"
        ],
        "recipe_directions_formatted":[
            "Combine the orange-flavored liqueur, lemon juice and sugar in a large bowl (I use the bowl of my freestanding mixer) and stir to dissolve the sugar, or as good as. Slowly stir in the cream then get whisking. As I said, I use my freestanding mixer to this, but if you haven't got one, don't worry - but I would then advise a handheld electric mixer. This takes ages to thicken and doing it by hand will drive you demented with tedium and impatience. Or it would me.",
            "When the cream's fairly thick, but still not thick enough to hold its shape, dribble with the flower waters and then keep whisking until you have a cream mixture that's light and airy but able to form soft peaks. I always think of syllabub as occupying some notional territory between solid and liquid; you're aiming, as you whisk, for what Jane Grigson called \"bulky whiteness.\" Whatever: better slightly too runny than slightly too thick, so proceed carefully, but don't get anxious about it.",
            "Spoon the syllabub in airy dollops into small glasses, letting the mixture billow up above the rim of the glass, and scatter finely chopped pistachios on top. In my How to Eat cookbook, there's a recipe for pistachio crescents that would be fabulous dunked into and eaten with this. But only if you feel like it: the cool, fool-like smoothness of this is perfect as it is."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"408",
            "Total Fat":"29 g",
            "Carbohydrates":"29 g",
            "Protein":"2 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/turkish-coffee-recipe-1969668",
        "recipe_name":"Turkish Coffee",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Middle Eastern Recipes",
            "Coffee Drinks",
            "Gluten Free",
            "Low-Carb",
            "Low-Fat",
            "Low Sodium",
            "Vegan"
        ],
        "recipe_details_formatted":{
            "Prep":"2 min\n        \n        \n        \n          Cook:\n           10 min",
            "Cook":"None",
            "Total":"12 min",
            "Servings":"None",
            "Yield":"2 servings"
        },
        "recipe_ingredients_formatted":[
            "3\/4 cup cold water",
            "1 1\/2 teaspoons sugar (more or less depending on sweetness desired)",
            "3 tablespoons freshly ground medium roast coffee"
        ],
        "recipe_directions_formatted":[
            "Combine all ingredients in the cezve and mix with a spoon. Put the cezve over very low heat and do not stir. After about 3 minutes, a thick foam rises to the surface. Just as the coffee is about to bubble up and overflow, immediately remove the cezve from the heat. Gently divide the foam between 2 demitasse cups, then place the cezve back on the heat for a few seconds. Pour the coffee into the cups, carefully pouring it down the sides of the cups in order not to disturb the foam. The coffee grains will settle at the bottom of the cup."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"12",
            "Total Fat":"0 g",
            "Carbohydrates":"3 g",
            "Protein":"0 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/turkish-eggs-1916039",
        "recipe_name":"Turkish Eggs",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/editorial\/homepage\/fn-feature.jpg.rend.hgtvcom.826.620.suffix\/1474463768097.jpeg",
        "recipe_tags_formatted":[
            "Easy Main Dish",
            "Main Dish",
            "Easy Side Dish Recipes",
            "Side Dish",
            "Easy Breakfast Recipes",
            "Breakfast",
            "Easy Brunch Recipes",
            "Brunch",
            "Middle Eastern Recipes",
            "Turkish"
        ],
        "recipe_details_formatted":{
            "Prep":"10 min\n        \n        \n        \n          Cook:\n           15 min",
            "Cook":"None",
            "Total":"25 min",
            "Servings":"None",
            "Yield":"4 servings"
        },
        "recipe_ingredients_formatted":[
            "1 cup plain yogurt",
            "1 garlic clove, crushed, optional",
            "Pinch sea salt",
            "Freshly ground black pepper",
            "4 eggs",
            "1 tablespoon extra-virgin olive oil",
            "1 teaspoon paprika",
            "1 handful baby English spinach leaves"
        ],
        "recipe_directions_formatted":[
            "Preheat the oven to 350 degrees F. Place the yogurt and garlic in a small bowl and stir to combine. Season with salt and pepper. Divide between 4 small ovenproof dishes and place in the oven for 10 minutes. While the yogurt is warming, put 2 inches of water in a deep frying plan and bring to a boil. Turn off the heat and immediately break the eggs into the pan. To stop the egg whites spreading too much, break the eggs directly into the water, carefully opening the shells at the water surface so that the eggs slide into the water. Cover the pan with a tight-fitting lid. Leave to cook undisturbed in the water for about 3 minutes. The eggs are cooked when the whites are opaque. Remove from the pan with a slotted spoon and drain on a clean tea towel. Mix the olive oil and paprika together in a small bowl. Season with salt and pepper. Remove the yogurt from the oven and top with the spinach leaves and poached egg. Drizzle over the olive oil mixture and serve at once."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"132",
            "Total Fat":"10 g",
            "Carbohydrates":"4 g",
            "Protein":"8 g"
        }
    },
    {
        "recipe_card-href":"https:\/\/www.foodnetwork.com\/recipes\/scott-conant\/turkish-borek-recipe-2120993",
        "recipe_name":"Turkish Borek",
        "recipe_img_url-src":"\/\/food.fnr.sndimg.com\/content\/dam\/images\/food\/video\/0\/01\/019\/0198\/0198555.jpg.rend.hgtvcom.1280.720.suffix\/1660150436362.jpeg",
        "recipe_tags_formatted":[
            "Turkish",
            "Pie Recipes",
            "Beef",
            "Main Dish"
        ],
        "recipe_details_formatted":{
            "Prep":"40 min\n        \n        \n          Inactive:\n           20 min\n        \n        \n          Cook:\n           1 hr 20 min",
            "Cook":"None",
            "Total":"2 hr 20 min",
            "Servings":"None",
            "Yield":"10 servings"
        },
        "recipe_ingredients_formatted":[
            "6 tablespoons extra-virgin olive oil",
            "1 pound mild green peppers, such as cubanelles or Anaheims, stemmed, seeded and coarsely chopped",
            "1 tablespoon pul biber pepper (Aleppo pepper)",
            "1 large onion, coarsely chopped",
            "Salt and freshly ground black pepper",
            "2 pounds ground beef",
            "3\/4 cup canola oil, plus more for brushing",
            "5 large eggs",
            "1 cup milk",
            "One 16-ounce package yufka dough",
            "2 tablespoons nigella sativa (black cumin seeds)"
        ],
        "recipe_directions_formatted":[
            "In a large, deep skillet, heat the olive oil over moderate heat. Add the peppers, pul biber and onions, season with salt and pepper and cook, stirring frequently, until softened, about 10 minutes. Add the beef and cook until the liquid has evaporated, about 10 minutes. Season with salt and pepper. Continue cooking over moderate heat, stirring occasionally, until the vegetables are softened, about 15 minutes. Transfer the vegetables and meat to a bowl and let cool slightly.",
            "Preheat the oven to 400 degrees F and lightly oil a 9- by 13-inch glass baking dish.",
            "In a medium bowl, whisk the eggs with the milk and 1\/2 cup of the canola oil. Lay a sheet of yufka on a work surface and brush with the egg mixture; repeat until you have a stack of 2 sheets. Transfer the stack to the baking dish and spread one-third of the beef mixture on top. Repeat the layering twice more with the brushed yufka sheets and beef filling, then end with a stack of brushed yufka.",
            "Trim the overhanging yufka slightly and tuck it under itself. Brush any remaining egg mixture on top of the borek, top with the nigella sativa seeds and bake until deeply golden on top and sizzling, about 45 minutes. Let the borek rest for 20 minutes before cutting into squares and serving."
        ],
        "recipe_nutrition_details_formatted":{
            "Calories":"643",
            "Total Fat":"48 g",
            "Carbohydrates":"29 g",
            "Protein":"24 g"
        }
    }
]