[
    {
        "recipe_tags_formatted": [
            "European",
            "Italian",
            "Main Dishes",
            "Beef"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "30 mins",
            "Cook": "9 hrs 25 mins",
            "Total": "9 hrs 55 mins",
            "Servings": "8",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "891",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "39g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/246866/rigatoni-alla-genovese/",
        "recipe_name": "Rigatoni alla Genovese",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/SfzDOuZ3bYNfMghYYwFYOtAxtCs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/3489951-rigatoni-alla-genovese-Chef-John-4x3-1-c90d61cedc9c4c3c841ef503a2ac2b9a.jpg",
        "recipe_ingredients_formatted": [
            "1 tablespoon olive oil",
            "6 ounces pancetta or salt pork, diced",
            "2 ½ pounds beef chuck",
            "3 teaspoons kosher salt, divided",
            "½ cup diced celery",
            "½ cup diced carrots",
            "1 teaspoon freshly ground black pepper",
            "⅔ cup white wine",
            "1 heaping tablespoon tomato paste",
            "1  bay leaf",
            "4 pounds yellow onions, sliced",
            "2 pounds red onions, sliced",
            "2 (16 ounce) boxes uncooked rigatoni",
            "2 tablespoons freshly grated Parmigiano-Reggiano cheese",
            "1 tablespoon chopped fresh marjoram leaves",
            "1 pinch cayenne pepper"
        ],
        "recipe_directions_formatted": [
            "Heat oil in a large pot over medium heat. Add pancetta and cook until most of the fat is rendered, about 6 minutes. Transfer to a plate with a slotted spoon.",
            "Add beef chuck and 2 teaspoons salt to the pot. Increase the heat to high; cook and stir until browned and any liquid released begins to evaporate, 10 to 15 minutes.",
            "Reduce the heat to medium-high. Add cooked pancetta, celery, carrots, remaining 1 teaspoon salt, and pepper; cook and stir for 5 minutes. Add white wine, tomato paste, and bay leaf; cook and stir for 2 to 3 minutes, scraping up the drippings from the bottom of the pan.",
            "Add yellow and red onions. Reduce the heat to medium, cover, and cook for 30 minutes without stirring. After 30 minutes, stir onions and meat until well mixed. Cover again and cook for 30 more minutes.",
            "Stir, then reduce the heat to low. Keep uncovered and cook, occasionally stirring and skimming off any fat, until beef and onions seem to melt into each other, 8 to 10 hours. If the sauce is reducing too much, add water or broth as needed to maintain a sauce-like consistency.",
            "When the sauce is almost finished, bring a large pot of lightly salted water to a boil. Cook rigatoni in the boiling water, stirring occasionally until just barely al dente, 10 to 12 minutes. Drain.",
            "Add rigatoni to the sauce and cook until heated through. Garnish with Parmigiano-Reggiano cheese, marjoram, and cayenne.",
            "This recipe makes enough sauce for 2 pounds of dry rigatoni. But you can use just the amount you need and refrigerate or freeze the rest. To serve, heat as much sauce as you need in a skillet. Then continue with Step 6, above."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "35 mins",
            "Total": "50 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "356",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "29g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/71555/italian-pork-tenderloin/",
        "recipe_name": "Italian Pork Tenderloin",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/SClnZ_vCOqZsolF0GDUZ_Rku4Ws=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/6230745-italian-pork-tenderloin-chefdaddy-4x3-1-545e5eaa68334b798e15f75efc9a3e29.jpg",
        "recipe_ingredients_formatted": [
            "2 tablespoons olive oil",
            "¼ cup chopped prosciutto",
            "2 tablespoons chopped fresh sage",
            "2 tablespoons chopped fresh parsley",
            "2 tablespoons chopped oil-packed sun-dried tomatoes",
            "¼ cup chopped onion",
            "1 ½ pounds pork tenderloin, cut into 1/2 inch strips",
            "½ cup chicken broth",
            "½ cup heavy cream",
            "¼ teaspoon salt",
            "½ teaspoon ground black pepper"
        ],
        "recipe_directions_formatted": [
            "Heat the oil in a skillet over medium-high heat. Saute the prosciutto, sage, parsley, sun-dried tomatoes, and onion 5 minutes, until onion is tender. Mix the pork strips into the skillet, and brown about 10 minutes, turning once.",
            "Stir the broth and heavy cream into the skillet, and season with salt and pepper. Bring to a boil. Reduce heat to low, and simmer 20 minutes, stirring occasionally, until pork reaches a minimum temperature of 145 degrees F (63 degrees C) and sauce is thickened."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Side Dish",
            "Sauces and Condiments",
            "Sauces",
            "Pasta Sauces"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "None",
            "Total": "20 mins",
            "Servings": "6",
            "Yield": "6 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "225",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "4g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/258762/pesto-genovese-authentic-italian-basil-pesto/",
        "recipe_name": "Pesto Genovese (Authentic Italian Basil Pesto)",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/T1QcBV0XXGIXjHJtZi7Ud4NbLss=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1813x0:1815x2):format(webp)/4557058-f3b9bbca2c2e45c2a3afa789dfdd847d.jpg",
        "recipe_ingredients_formatted": [
            "2 cloves garlic, or more to taste",
            "2 tablespoons pine nuts",
            "1 bunch fresh basil leaves",
            "½ cup grated Parmigiano-Reggiano cheese",
            "1 ½ tablespoons grated pecorino Romano cheese",
            "½ cup extra-virgin olive oil"
        ],
        "recipe_directions_formatted": [
            "Crush garlic using a mortar and pestle. Add pine nuts; crush with the garlic. Add basil leaves gradually, making circular movements with the pestle, until a smooth paste forms.",
            "Mix Parmigiano-Reggiano cheese and pecorino Romano cheese using a wooden spoon. Stir in olive oil until pesto is blended."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Main Dishes",
            "Pasta",
            "Spaghetti"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "5 mins",
            "Cook": "1 hr 55 mins",
            "Total": "2 hrs",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "1336",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "58g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/283148/italian-sausage-spaghetti/",
        "recipe_name": "Italian Sausage Spaghetti",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/_EPuum0EU_iMmwstbkw9xlxqbUk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(639x0:641x2):format(webp)/image-185-f4c8155da88c4ed09ae2566629325900.jpg",
        "recipe_ingredients_formatted": [
            "1 tablespoon olive oil",
            "4 (6 ounce) sweet Italian sausage links",
            "¼ cup white wine",
            "1 (32 ounce) jar marinara sauce",
            "1 ½ cups water",
            "1 (16 ounce) package spaghetti",
            "½ cup freshly grated Parmigiano-Reggiano cheese",
            "2 tablespoons chopped flat-leaf (Italian) parsley, or to taste"
        ],
        "recipe_directions_formatted": [
            "There are basically three ways you can do Italian sausage and spaghetti. Two of those ways are very popular and perfectly acceptable. This recipe features the much lesser known third method, which I feel is vastly superior in both taste and texture (although it requires doing something I've been training you for years not to do, and that's overcooking meat).",
            "The secret to this simple method is simmering the pieces of sausage way longer than necessary to cook them. A two-inch section of Italian sausage only needs to braise in tomato sauce for about ten minutes to be \"cooked through,\" so it might seem a little crazy to simmer it for 90 minutes, but if you can get past that seemingly insane instruction, you'll be treated to one of the best pasta sauces of your life.",
            "Thanks to the long, slow braising, the flavors in the sausage permeate the sauce. This will turn even the most unremarkable ragu into something memorable. In addition, the texture of the sausage transforms into something completely different and, in my opinion, completely wonderful. The only catch (yes, there's always a catch) is that you have to wait an hour and a half to eat. Hey, you can spend the time making a nice salad, and maybe some garlic bread. But no matter what you serve with this Italian sausage spaghetti, I really hope you make it soon. Enjoy!",
            "For more Chef John, be sure to subscribe to Food Wishes on YouTube! Click the \"Join\" button there to get Chef John's bonus video footage and behind-the-scenes pictures, live chats, and other Food Wishes member exclusives.",
            "Heat olive oil in a saucepan over medium heat. Transfer sausage links into the hot pot. Cover with a lid and cook until beautifully browned and just barely cooked through, about 5 minutes per side. You can increase the heat a little if you like, but make sure the oil does not smoke. Turn off the heat and remove sausages to a plate to cool completely.",
            "While the sausages are cooling, add wine to the same pot over medium-high heat. As it comes up to a simmer, stir the caramelized bits on the bottom of a pan with a spoon or spatula. Simmer until it reduces by about half, 1 to 2 minutes.",
            "Add marinara sauce. Pour water into the jar of pasta sauce, seal, and shake to rinse out the jar. Pour that liquid into the pot and return to a simmer. Reduce heat to low.",
            "Slice each fully cooled sausage into 4 pieces. Transfer sausage and any accumulated juices into the simmering sauce. Stir and increase heat to just between low and medium-low. Cook at a gentle, steady simmer, stirring occasionally, for 1 hour. Taste and adjust seasonings. Skim about 1/2 of the fat from the surface, and continue to cook until reduced and thick, about 30 minutes longer.",
            "Meanwhile, bring a large pot of generously salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally, until almost tender yet firm to the bite, 10 to 11 minutes. Drain spaghetti and transfer it directly into the pot of hot sauce. Mix until thoroughly combined. Cover with the lid and let sit for 1 minute so the pasta can absorb some of the sauce.",
            "Evenly divide pasta onto 4 plates and top each serving with 4 pieces sausage. Sprinkle with Parmigiano-Reggiano and parsley.",
            "You can use spicy or mild sausage links. Just make sure the sausage you use has enough fat that you can see it through the casings.",
            "You can use 3 tablespoons water mixed with 1 tablespoon white wine vinegar, in place of the wine, but the wine really adds better flavor to the sauce.",
            "If the sauce is too thick, toss another splash of water in.",
            "I use a thick, #12 spaghetti, but any spaghetti or pasta will work, as long as you cook it in generously salted water."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Sauces and Condiments",
            "Sauces",
            "Pasta Sauces",
            "Vegetarian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "None",
            "Total": "20 mins",
            "Servings": "8",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "181",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "4g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/258213/proper-pesto/",
        "recipe_name": "Proper Pesto",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/9xqq51KvDl2xVvldj-imix5N_z8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(2591x0:2593x2):format(webp)/4517170-cd64b5b696f046edbabb0a47f6148132.jpg",
        "recipe_ingredients_formatted": [
            "4 cloves garlic, peeled",
            "¼ teaspoon kosher salt",
            "1 large bunch fresh basil",
            "3 tablespoons pine nuts",
            "2 ounces finely grated Parmigiano-Reggiano cheese",
            "½ cup mild extra-virgin olive oil"
        ],
        "recipe_directions_formatted": [
            "Crush garlic and pinch of kosher salt in a mortar with the pestle until garlic is mashed and paste-like, 1 or 2 minutes. Add basil in 3 or 4 additions, crushing and pounding down the leaves until they form a fairly fine paste, about 8 minutes or more depending on size of leaves and thickness of stems. Add and pound in pine nuts.",
            "Transfer a handful of grated cheese to mortar and pound into the sauce. Add another handful of cheese and incorporate into the mixture. Continue adding cheese a handful at a time until completely incorporated, about 5 minutes.",
            "Drizzle in olive oil 1 tablespoon at a time, pounding it into the sauce. When all the olive oil has been added and emulsified into the mixture, transfer pesto to a bowl and drizzle the surface with olive oil.",
            "The bunch of basil should weigh about 4 or 5 ounces.",
            "Use a microplane to finely grate the Parmigiano-Reggiano cheese. Two ounces should yield about 1 1/2 cups unpacked grated cheese.",
            "Of course, you can play around with the ratios of the five ingredients, and easily adjust this to your tastes, but no matter how they're combined, taking the time to crush them by hand is well worth the effort."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "10 mins",
            "Total": "20 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "335",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "16g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/23048/manicotti-shells/",
        "recipe_name": "Manicotti Shells",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/SnLHvvusF6Jn2AuDxtRd0jSaYvw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/1755362-d673e18a4d5348b0b70e0b900f8f9e19.jpg",
        "recipe_ingredients_formatted": [
            "2 cups all-purpose flour",
            "2 cups water",
            "6  eggs",
            "¼ teaspoon salt",
            "cooking spray"
        ],
        "recipe_directions_formatted": [
            "Mix flour, water, eggs, and salt together in a bowl until a thin, smooth batter forms.",
            "Lightly spray a griddle with cooking spray and heat over medium-low heat. Spoon about 1/4 cup batter into the warm skillet and cook until a film forms on top. Carefully remove to a plate and repeat to make remaining shells."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Side Dish"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "5 mins",
            "Cook": "15 mins",
            "Total": "20 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "807",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "32g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/246628/spaghetti-cacio-e-pepe/",
        "recipe_name": "Spaghetti Cacio e Pepe",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/Wwt1ZVjXDBzII_C_ABATPyg9AmA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/3478412-b7369926f0be49e3a71808c446c18f1d.jpg",
        "recipe_ingredients_formatted": [
            "1 pound spaghetti",
            "6 tablespoons olive oil",
            "2 cloves garlic, minced",
            "2 teaspoons ground black pepper",
            "1 ¾ cups grated Pecorino Romano cheese"
        ],
        "recipe_directions_formatted": [
            "Bring a large pot of lightly salted water to a boil. Cook spaghetti in boiling water, stirring occasionally, until tender yet firm to the bite, about 12 minutes. Reserve 1 cup cooking water, then drain spaghetti.",
            "Heat olive oil in a large skillet over medium heat. Cook and stir garlic and pepper in hot oil until fragrant, 1 to 2 minutes. Add cooked spaghetti and Pecorino Romano cheese. Ladle in 1/2 cup reserved cooking water; stir until cheese is melted, about 1 minute. Stir in more cooking water as needed, 1 tablespoon at a time, until sauce coats spaghetti, about 1 minute more.",
            "You can substitute butter for olive oil.",
            "Adjust the amount of cooking water added in step 2 for a thicker or thinner sauce. If you add too much water, add some more cheese.",
            "I add flavor-enhancing ingredients — like pancetta — to this recipe depending on my main dish; I always experiment when creating food."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Soups, Stews and Chili Recipes",
            "Chili Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "1 hr 30 mins",
            "Total": "1 hr 50 mins",
            "Servings": "6",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "599",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "32g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/236599/chef-johns-italian-sausage-chili/",
        "recipe_name": "Chef John's Italian Sausage Chili",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/1xWs2qJZ97Wwkg3off-NKFMS4pE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/1105025-7114f920dc0a4a57936a71e6c46ccbfb.jpg",
        "recipe_ingredients_formatted": [
            "1 tablespoon olive oil",
            "1 ¼ pounds hot Italian sausage, casings removed",
            "1 ¼ pounds mild Italian sausage, casings removed",
            "1  onion, chopped",
            "salt to taste",
            "2 tablespoons ancho chile powder",
            "1 teaspoon paprika",
            "1 teaspoon ground cumin",
            "1 teaspoon ground black pepper",
            "½ teaspoon chipotle chile powder",
            "½ teaspoon dried oregano",
            "2 ½ cups water, or as needed",
            "1 cup tomato puree",
            "2 (15 ounce) cans cannellini beans, drained and rinsed",
            "1  red bell pepper, diced",
            "1  green bell pepper, diced"
        ],
        "recipe_directions_formatted": [
            "Heat olive oil in a large pot over medium-high heat. Cook and stir hot and mild Italian sausage, onion, and a pinch of salt in hot oil until sausage is browned and crumbly, and most of the liquid is evaporated, about 10 minutes.",
            "Stir in ancho chile powder, paprika, cumin, black pepper, chipotle chile powder, and oregano; sauté until fragrant, about 2 minutes.",
            "Pour in water and tomato purée; bring to a simmer. Reduce heat to medium-low and cook at a steady simmer until sausage is tender, about 45 minutes. Add more water as needed and skim any fat that floats to the top.",
            "Stir in beans and bell peppers. Simmer until vegetables are tender, about 30 minutes. Season with salt."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "55 mins",
            "Total": "1 hr 10 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "596",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "18g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/260014/rigatoni-al-segreto-rigatoni-with-secret-sauce/",
        "recipe_name": "Rigatoni al Segreto (Rigatoni with Secret Sauce)",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/t36dapiANU5xvXhZgy0Z8XXmUfY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(799x0:801x2):format(webp)/4552997-rigatoni-al-segreto-rigatoni-with-secret-sauce-Chef-John-1x1-1-1f8521b0c5124cdb89e4d927dae101b7.jpg",
        "recipe_ingredients_formatted": [
            "4 tablespoons olive oil",
            "1 cup diced onion",
            "1 teaspoon salt, plus more to taste",
            "2 cloves garlic, crushed (or more to taste)",
            "1 pinch red pepper flakes",
            "1 (28 ounce) can San Marzano (Italian) tomatoes, blended smooth",
            "½ cup water (to rinse out can of tomatoes)",
            "1 (8 ounce) package uncooked rigatoni pasta",
            "½ cup fresh basil leaves, thinly sliced",
            "4 tablespoons cold butter, cubed",
            "1 cup grated Parmigiano-Reggiano cheese, plus more for serving"
        ],
        "recipe_directions_formatted": [
            "Heat olive oil in a saucepan over medium-high heat. Add onion and salt. Cook until no longer white and starting to turn translucent, about 5 minutes. Stir in garlic; cook about 1 minute. Add red pepper flakes, then blended tomatoes with water. Bring to a simmer; adjust heat to medium or medium-low. Simmer gently, stirring occasionally, for 45 to 60 minutes. Reduce heat to low.",
            "Bring a large pot of lightly salted water to a boil. Cook rigatoni in the boiling water, stirring occasionally until tender yet firm to the bite, about 8 minutes (5 minutes from doneness).",
            "Add about 2/3 of the basil to the sauce. Stir in butter. When butter melts, add cheese in 3 increments.",
            "Drain pasta; transfer to sauce. Stir until rigatoni are evenly coated with sauce. Serve sprinkled with the remaining basil and a dusting of grated cheese.",
            "This recipe probably makes enough sauce to coat 12 ounces of pasta, but I like lots of sauce."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Holidays and Events Recipes",
            "Christmas"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/gallery/italian-christmas-dinner-recipes/",
        "recipe_name": "15 Traditional Italian Christmas Dinner Recipes",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/JrPRZIfRFZoNYwr8IT-rWT8fpOc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/Chef-Johns-Baby-Porchetta-8f87f66630da418b9b1c8343ad6d3be3.jpg",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "Christmas dinner traditions vary throughout the different regions of Italy, but are guaranteed to involve a feast, including fish and seafood dishes on Christmas Eve and an abundance of rich and comforting pasta and roast meat dishes on the big day. We've compiled this collection of authentic recipes — from calamari in red wine and tomato sauce to homemade pear and gorgonzola ravioli — so you can celebrate Christmas dinner in true Italian style. Guaranteed no one will leave hungry! Buon Appetito!",
            "A rich, sweet tomato, onion, raisin, pine nut, and olive sauce is spooned on top of swordfish steaks and baked for a very elegant fish dish that's perfect for a special occasion like Christmas dinner. \"This is the best baked swordfish, or any fish, I've eaten!\" says home cook JBALESTER. \"It is truly an authentic Italian recipe, even better than what I've enjoyed there over the years!\"",
            "Traditionally, saltimbocca is made with veal at Christmas but this version uses boneless chicken breasts. They are stuffed with fresh sage leaves and wrapped in slices of prosciutto, then pan fried in a delicious butter and white wine sauce. Serve this simple, yet elegant dish as part of your Italian Christmas feast and you'll hear no complaints!",
            "Italians love to serve a warming seafood soup for dinner on Christmas eve. Use your favorite selection of fish and seafood in this recipe, and add cognac instead of white wine for a Christmas treat! Serve with toasted garlic bread and top with parsley. You can use any remaining fish stock for a seafood risotto on Christmas day.",
            "Italian savory crepes, known as crespelle, are filled and baked in a béchamel sauce and traditionally served as a main dish on special occasions, including Christmas. In this version, the homemade crepes are filled with a vegetarian spinach and ricotta mixture, but you can easily vary the filling.",
            "This pasta dish with fresh squid cooked in a red wine and tomato sauce is very popular in Italy over the festive period. You'll need to use a thicker pasta like linguine or tagliatelle to scoop up the delicious sauce. \"Our family always has this on Christmas Eve as one of the seven fish dishes typically served,\" says recipe contributor ELEANOR1052.",
            "\"This is a traditional salad from Naples, known as Insalata di Rinforzo, which is typically served at Christmas time,\" explains recipe submitter linacavezza. \"It's lovely and colorful as it uses cauliflower, lime green Romanesco, and dark green broccoli and is jazzed up with olives and red pickled peppers. It is served with a lemon-based vinaigrette and sometimes anchovies and capers.\" Add bell peppers instead of the pickled peppers if you prefer.",
            "Seared tuna steaks are served with caramelized onions with a light sweet-sour sauce in this incredibly simple but sophisticated fish dish with minimal ingredients to boot. \"My grandmother made this recipe every Christmas Eve as part of the Feast of the Seven Fishes,\" says recipe contributor JoAnna. \"We still make it today and it is my all time favorite!\"",
            "Chef John shows you how to make a simpler version of the classic Italian pork roast called 'porchetta' for a mouth-watering and incredibly tasty Christmas dinner. A pork shoulder is generously seasoned with herbs, orange zest, and garlic before it's roasted and served with an anchovy, vinegar, and parsley sauce. Serve with roasted apples and potatoes. \"Amazing!!!\" says Allrecipes Allstar tcasa. \"I made this for Christmas dinner. I looked like a cooking super star!\"",
            "Lots of Sicilian families celebrate Christmas with their own version of this national dish 'pasta con le sarde', so if you love anchovies and pasta, this recipe is perfect as part of your Italian Christmas menu! This recipe brought back happy memories for reviewer Jacqueline Brown: \"My mom is Italian and makes this same recipe every Christmas Eve! This dish should be pleasantly oily with a light, anchovy flavor mixed with the buttery, garlicky bread crumbs.\"",
            "This authentic risotto is made with shrimp and scallops but you can use other types of shellfish, such as calamari, clams, or mussels. As long as you use the freshest seafood you can get your hands on and good quality fish stock, your Christmas guests will be in for a treat with this sensational Italian risotto!",
            "Quails are marinated in a sweet pomegranate, orange, Marsala wine, and fresh mint mixture, then wrapped in pancetta and roasted. Serve the quail with reserved sauce, orange segments, and a sprinkling of pomegranate seeds for a delectable Christmas dinner, Sicilian style!",
            "Every family in Naples has there own version of this iconic Italian dish that encompasses layers of baked anchovies that are arranged in a circular pattern with a mix of bread crumbs, capers, garlic, and parsley. \"You can add tomatoes to the mix, as well as olives or different herbs,\" suggests recipe contributor Gabriella.",
            "This hearty Italian dish, also known as Chicken Marbella, is made by roasting chicken with garlic, prunes, olives, capers, and white wine for an incredibly tasty meal when served with pasta or a pilaf. It's a great choice for Christmas dinner, plus leftovers reheat well.",
            "Winter pears and blue cheese make a winning combination in this homemade ravioli recipe that's perfect for a stunning pasta dish at Christmas. You can get ahead by making both the pasta and the filling in advance. Serve the ravioli with a simple butter and sage sauce so you don't lose the delicate flavors in the filling.",
            "An abundance of cooked seafood, including scallops, shrimp, mussels, and calamari are marinated in a lemon-herb dressing, then spooned on top of salad greens for a colorful Christmas dish. Garnish with slices of lemon and red onion, and serve with fresh Italian bread."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Side Dish",
            "Potato",
            "Mashed Potato Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "1 hr",
            "Total": "1 hr 20 mins",
            "Servings": "8",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "172",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "3g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/24775/roasted-garlic-mashed-potatoes/",
        "recipe_name": "Roasted Garlic Mashed Potatoes",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/WJkEBVPxzABrCzYZ9lHnxcLcW10=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/662862-a99298bc4d7f4a888d12c7aa76cf5b93.jpg",
        "recipe_ingredients_formatted": [
            "1 medium head garlic, top of bulbs trimmed off so tops of cloves are exposed",
            "1 tablespoon olive oil",
            "2 pounds russet potatoes, peeled and quartered",
            "4 tablespoons butter, softened",
            "½ cup milk",
            "salt and pepper to taste"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 350 degrees F (175 degrees C).",
            "Drizzle oil over garlic head, then wrap in aluminum foil.",
            "Bake in the preheated oven for 1 hour.",
            "When the garlic has baked for about 35 minutes, bring a large pot of salted water to a boil. Add potatoes and cook until tender, about 15 minutes. Drain and let cool for a few minutes.",
            "Chop potatoes and place into a mixing bowl. Add milk, butter, salt, and pepper.",
            "Remove garlic from the oven. Cut garlic head in half and squeeze softened cloves into the mixing bowl. Mix with an electric mixer until ingredients are well combined and desired consistency is achieved."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Desserts",
            "Cookies",
            "International Cookie Recipes",
            "Italy"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "25 mins",
            "Cook": "10 mins",
            "Total": "35 mins",
            "Servings": "36",
            "Yield": "3 dozen"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "78",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "2g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/9826/italian-cookies-i/",
        "recipe_name": "Italian Cookies",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/ay59-O9B6kh3bUQPJApC_lCzQ_I=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1511x0:1513x2):format(webp)/6179214-6a855ff497d5446f8f5a914f4e0aafdb.jpg",
        "recipe_ingredients_formatted": [
            "3 cups all-purpose flour",
            "3 teaspoons baking powder",
            "½ cup unsalted butter, softened",
            "½ cup white sugar",
            "3 large eggs",
            "2 teaspoons vanilla extract"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 350 degrees F (175 degrees C). Grease two baking sheets.",
            "Combine flour and baking powder in a bowl.",
            "Beat butter and sugar in a mixing bowl with an electric mixer until smooth and creamy. Mix in eggs, one at a time, beating well after each addition. Mix in vanilla. Gradually stir in flour mixture until well blended.",
            "Roll walnut-sized portions of dough into small ropes. Shape each rope into a loop and press the ends to seal. Place 2 inches apart onto the prepared baking sheets.",
            "Bake in the preheated oven until firm and golden at the edges, 8 to 10 minutes. Remove from the oven and cool on a wire rack."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Chicken Soup Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "15 mins",
            "Total": "25 mins",
            "Servings": "2",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "313",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "19g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/246528/stracciatella-soup/",
        "recipe_name": "Stracciatella Soup",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/kkfKxkUYjRDYC15tjYe-aWeechs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(546x603:548x605):format(webp)/3406306-stracciatella-soup-Chef-John-1x1-1-c08995031c664272bc2559eb9125e2bd.jpg",
        "recipe_ingredients_formatted": [
            "6 cups chicken broth",
            "salt and freshly ground black pepper to taste",
            "3  large eggs",
            "½ ounce grated Parmigiano-Reggiano cheese",
            "½ ounce grated pecorino Romano cheese",
            "2 tablespoons chopped fresh parsley",
            "2 tablespoons semolina flour",
            "1 pinch cayenne pepper",
            "1 pinch freshly grated nutmeg",
            "1 tablespoon olive oil",
            "1 pinch red pepper flakes"
        ],
        "recipe_directions_formatted": [
            "Bring broth to a simmer in a pot over high heat. Taste broth and adjust salt and pepper as needed.",
            "Whisk eggs, grated Parmigiano Reggiano and Pecorino Romano cheeses, parsley, semolina flour, salt, pepper, cayenne, and nutmeg together in a bowl until well blended.",
            "While stirring the simmering broth, slowly pour egg mixture into the broth. Bring mixture back up to a simmer. The liquid will be slightly cloudy initially and clear as broth heats.",
            "Serve in bowls; garnish with a drizzle of olive oil and a pinch of red pepper flakes.",
            "Makes 2 large or 4 appetizer-sized portions.",
            "A nice, rich homemade chicken broth is best for this recipe. But if there's none available, use good quality prepared broth."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Everyday Cooking",
            "Vegetarian",
            "Side Dishes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "25 mins",
            "Total": "35 mins",
            "Servings": "12",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "317",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "10g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/11695/cavatelli-and-broccoli/",
        "recipe_name": "Cavatelli and Broccoli",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/N77YA9wThgTVocqIPwvDc0bJeyM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/6494196-cavatelli-and-broccoli-Melissa-Scheider-1x1-1-764c082fa2d54a9a90d180a76941be16.jpg",
        "recipe_ingredients_formatted": [
            "3 heads fresh broccoli, cut into florets",
            "1 ½ pounds cavatelli pasta",
            "½ cup olive oil",
            "3 cloves garlic, minced",
            "1 teaspoon salt, or more to taste",
            "1 teaspoon crushed red pepper flakes",
            "2 tablespoons grated Parmesan cheese"
        ],
        "recipe_directions_formatted": [
            "Bring a large pot of water to a boil. Cook broccoli in boiling water for about 5 minutes. Use a slotted spoon to remove broccoli to a large bowl and set aside.",
            "Season boiling water in the same pot with salt. Cook cavatelli in boiling water until tender yet firm to the bite, 8 to 10 minutes. Drain and set aside.",
            "Heat olive oil in a large skillet over medium heat. Sauté garlic in hot oil until lightly golden, being careful not to burn it. Add broccoli; cook, stirring occasionally, until tender yet crisp to the bite, about 10 minutes.",
            "Add cooked cavatelli to the skillet; toss well with broccoli mixture until warmed through. Season with salt and hot pepper flakes. Serve with Parmesan cheese."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Main Dishes",
            "Chicken",
            "Chicken Piccata Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "45 mins",
            "Total": "1 hr 5 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "543",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "31g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/100690/chicken-piccata-with-angel-hair-pasta/",
        "recipe_name": "Chicken Piccata with Angel Hair Pasta",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/pb2Kg0IV_1i42i4M1oRgoPq_1CA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/8958941-10533d5caf184f7197d4aff202bd74d9.jpg",
        "recipe_ingredients_formatted": [
            "⅓ cup all-purpose flour",
            "¼ teaspoon fresh ground black pepper",
            "¼ teaspoon paprika",
            "1 pound skinless, boneless chicken breast halves, pounded thin and cut into 2-inch pieces",
            "2 tablespoons olive oil",
            "1 clove garlic, minced",
            "4 tablespoons butter, divided",
            "1 cup dry white wine",
            "⅓ cup chicken broth",
            "¼ cup fresh lemon juice",
            "2 tablespoons capers",
            "2 tablespoons chopped fresh parsley",
            "1 (8 ounce) package angel hair pasta, cooked and drained"
        ],
        "recipe_directions_formatted": [
            "Whisk flour, pepper, and paprika together in a shallow dish. Dredge chicken in flour mixture until evenly coated.",
            "Heat oil in a large skillet over medium-high heat. Add garlic; cook and stir until golden and fragrant, about 1 minute; transfer to a plate.",
            "Melt 2 tablespoons butter in the same skillet. Add chicken and cook until browned, about 5 minutes per side; transfer to a plate.",
            "Pour wine into the hot skillet and bring to a boil over high heat, scraping the browned bits from the bottom and sides of the pan with a wooden spoon. Boil until wine is reduced by half, about 5 minutes. Whisk in chicken broth, reserved garlic, lemon juice, and capers; cook for 5 minutes. Stir in parsley and remaining 2 tablespoons butter. Reduce the heat to medium, return chicken to the skillet, and continue cooking until sauce thickens, about 15 minutes.",
            "Bring a large pot of lightly salted water to a boil. Cook angel hair pasta in the boiling water, stirring occasionally, until tender yet firm to the bite, 4 to 5 minutes. Drain well.",
            "Transfer chicken pieces to a serving dish and drizzle with a few tablespoons sauce. Add cooked pasta to the skillet and toss to coat with remaining sauce.",
            "Portion noodles onto serving plates and top with chicken."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "5 mins",
            "Prep": "15 mins",
            "Cook": "15 mins",
            "Total": "35 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "350",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "15g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/70726/pasta-de-sardine/",
        "recipe_name": "Pasta de Sardine",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/p7VZr9GvjOX1WcBDYqDprjUAY1o=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/8550976-b7eb5d1186b44c88b1d7da59bce65d0d.jpg",
        "recipe_ingredients_formatted": [
            "8 ounces dry fettuccine pasta",
            "2 tablespoons olive oil",
            "1 medium yellow onion, chopped",
            "3 cloves garlic, crushed",
            "1 medium lemon, juiced",
            "1 (3.75 ounce) can sardines in tomato sauce",
            "¼ cup freshly grated Parmesan cheese",
            "1 pinch red pepper flakes, or to taste"
        ],
        "recipe_directions_formatted": [
            "Fill a large pot with lightly salted water and bring to a rolling boil. Cook fettuccine at a boil until almost tender, about 8 minutes.",
            "While the pasta is cooking, heat oil in a skillet over medium heat. Add onion and cook until starting to soften, about 3 minutes. Add garlic and cook until fragrant, about 1 minute. Pour in sardines and tomato sauce, stir to combine, and cook until heated through, about 3 minutes. Reduce the heat to low and keep at a simmer.",
            "Drain pasta, add to sauce, and stir to combine. Cover, turn off the heat, and let stand for 3 minutes. Squeeze lemon over top and divide onto four serving plates. Garnish with Parmesan and red pepper flakes."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Bread",
            "Yeast Bread Recipes",
            "White Bread Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "2 hrs 30 mins",
            "Prep": "20 mins",
            "Cook": "25 mins",
            "Total": "3 hrs 15 mins",
            "Servings": "36",
            "Yield": "3 loaves"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "90",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "3g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/6955/mama-ds-italian-bread/",
        "recipe_name": "Mama D's Italian Bread",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/muacCyniKoemxjBuyqwfZLP2wkI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(431x474:433x476):format(webp)/1288195-mama-ds-italian-bread-Deb-C-4x3-1-e8d38e8d01624ab589e95b95ff5ded5a.jpg",
        "recipe_ingredients_formatted": [
            "1 teaspoon white sugar",
            "1 tablespoon active dry yeast",
            "3 cups warm water (110 degrees F/45 degrees C)",
            "7 cups all-purpose flour, divided, or as needed",
            "1 tablespoon salt",
            "cooking spray"
        ],
        "recipe_directions_formatted": [
            "Add sugar and yeast to the warm water and let proof.",
            "Stir in 4 cups flour and beat until smooth. Cover and let rest for 15 minutes.",
            "Beat in salt and then add enough remaining flour to make a stiff dough. Knead until soft and smooth. Turn in a greased bowl, cover, and let rise until doubled in size.",
            "Once doubled, punch down and divide into three. Place back in the bowl, cover, and let rise again.",
            "Once doubled, punch down and form into three fat \"footballs.\" Grease heavy cookie sheets and sprinkle with cornmeal. Place the bread on the sheets, cover with a towel, and let rise.",
            "Preheat the oven to 450 degrees F (230 degrees C).",
            "Mist loaves with water and place in the preheated oven. Bake until loaves are golden brown and sound hollow when tapped on the bottom, 25 to 30 minutes. Mist loaves with water and turn occasionally while they bake.",
            "When it comes time to let the dough rise, I put it in the oven with the light on for a perfect rising temperature.",
            "Based on review feedback, we have edited this recipe to include a bake time of 25 to 30 minutes."
        ]
    },
    {
        "recipe_tags_formatted": [
            "European",
            "Italian",
            "Main Dishes",
            "Beef"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "1 hr 20 mins",
            "Total": "1 hr 30 mins",
            "Servings": "9",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "472",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "23g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/18443/bolognese-sauce/",
        "recipe_name": "Bolognese Sauce",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/mYFqeqZm3YbsfjrvwM-xLq9H28k=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/2433171-bolognese-sauce-Allrecipes-Magazine-1x1-1-91e4bb43a13b42b6b2eddff2c82e59ec.jpg",
        "recipe_ingredients_formatted": [
            "2 tablespoons olive oil",
            "1 large onion, minced",
            "4 slices bacon, cut into 1/2 inch pieces",
            "1 clove garlic, minced",
            "1 pound lean ground beef",
            "½ pound ground pork",
            "1 (28 ounce) can Italian plum tomatoes",
            "½ pound fresh mushrooms, sliced",
            "6 ounces tomato sauce",
            "2  carrots, shredded",
            "1 stalk celery, chopped",
            "½ cup dry white wine",
            "½ cup chicken stock",
            "½ teaspoon dried basil",
            "½ teaspoon dried oregano",
            "salt and pepper to taste",
            "1 pound pasta"
        ],
        "recipe_directions_formatted": [
            "Warm oil in a large skillet over medium heat. Sauté onion, bacon, and garlic in hot oil until bacon is browned and crisp, about 10 minutes. Use a slotted spoon to transfer bacon mixture to a paper towel-lined plate to drain; set aside.",
            "Place the same large skillet over medium-high heat. Cook and stir ground beef and pork in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain and discard grease.",
            "Stir bacon mixture, tomatoes, mushrooms, tomato sauce, carrots, celery, wine, stock, basil, oregano, salt, and pepper into meat mixture. Bring to a boil. Cover, reduce heat, and simmer sauce for 1 hour, stirring occasionally.",
            "Meanwhile, bring a large pot of lightly salted water to a boil. Add pasta and cook in boiling water until al dente, 8 to 10 minutes; drain.",
            "Serve sauce over hot pasta."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "20 mins",
            "Total": "35 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "247",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "21g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/238843/chef-johns-shrimp-fra-diavolo/",
        "recipe_name": "Chef John's Shrimp Fra Diavolo",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/-P0eCNNXumqB1hC9paK0Zjy3Dos=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(996x713:998x715):format(webp)/238843-chef-johns-shrimp-fra-diavolo-ddmfs-3X4-0260-f3d31febe95843518ccf8af586a63f95.jpg",
        "recipe_ingredients_formatted": [
            "1 pound extra large shrimp (16-20), peeled and deveined, tail left on",
            "2 tablespoons olive oil, or more as needed",
            "1 teaspoon red pepper flakes, or to taste",
            "1 teaspoon salt, or to taste",
            "1 pinch Aleppo pepper flakes, or to taste",
            "½  yellow onion, sliced",
            "3 cloves garlic, minced",
            "½ teaspoon dried oregano",
            "1 cup white wine",
            "1 ½ cups canned crushed tomatoes (such as San Marzano)",
            "2 tablespoons chopped fresh flat-leaf parsley",
            "2 tablespoons thinly sliced fresh basil leaves"
        ],
        "recipe_directions_formatted": [
            "Combine shrimp, olive oil, red pepper flakes, salt, and Aleppo pepper flakes in a bowl; toss to coat shrimp completely in oil and spices.",
            "Heat a large skillet over high heat until very hot. Cook shrimp in a single layer in the hot skillet until the bottoms are browned, about 2 minutes. Turn shrimp and cook until browned on the other side, about 1 minute more. Transfer shrimp to a clean bowl.",
            "Heat the same skillet over medium heat. Cook and stir onion with a pinch of salt in the hot skillet until onions are slightly golden and translucent, 2 to 4 minutes. Add garlic and oregano; cook and stir until fragrant, 15 to 30 seconds. Pour white wine into onions; bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon.",
            "Add crushed tomatoes and lower heat to medium-low. Cook and stir until tomato mixture thickens and flavors blend, 10 to 15 minutes.",
            "Return shrimp to the skillet along with any accumulated juices in the bowl. Cook until shrimp are reheated, 2 to 4 minutes. Stir parsley and basil into sauce; season with salt, red pepper flakes, and Aleppo pepper flakes.",
            "You can substitute 2 teaspoons chopped fresh oregano for 1/2 teaspoon dried oregano."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "1 day",
            "Prep": "30 mins",
            "Cook": "None",
            "Total": "1 day 30 mins",
            "Servings": "80",
            "Yield": "20 pounds sausage"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "326",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "19g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/35989/hot-italian-sausage/",
        "recipe_name": "Hot Italian Sausage",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/dgDMiXIa5N8tWb-2tiDvaHcgRCA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1151x0:1153x2):format(webp)/5353281-7de95bab3b2245e5a41be5a32aaa6334.jpg",
        "recipe_ingredients_formatted": [
            "20 pounds ground pork",
            "½ cup ground paprika",
            "¼ cup garlic salt",
            "2 tablespoons salt",
            "1 tablespoon ground black pepper",
            "1 cup vegetable oil",
            "1 tablespoon anise seed",
            "1 tablespoon fennel seed",
            "⅛ cup red pepper flakes"
        ],
        "recipe_directions_formatted": [
            "Combine pork, paprika, garlic salt, salt, and black pepper in a large bowl; set aside.",
            "Place oil, anise seed, fennel seed, and red pepper flakes into a blender or food processor; blend well. Pour over pork mixture and mix until well combined.",
            "Cover and refrigerate until flavors blend, about 24 hours. Freeze sausage in resealable plastic bags in desired portions."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Kitchen Tips",
            "How To",
            "Global Kitchen"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/article/what-is-burrata/",
        "recipe_name": "What Is Burrata and How Is It Made?",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/LspfKVDRFxqjYG0wea91TuRYxTs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/GettyImages-489762056-2000-faa56984032c4880a87f47c7d66d6738.jpg",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "Italians know their cheese. But dare I say no Italian cheese has better proven this than burrata. This relatively young cheese was developed in the 20th century. The exterior resembles fresh mozzarella, but break into it with a fork, and you'll find a surprise inside: an ooey, gooey mixture of cream and small cheese curds. It's just begging to be scooped up with a slice of crunchy, Italian bread!",
            "Get to know this Italian cheese, and get top-rated recipes for putting it on display. Here's everything you need to know about burrata.",
            "Burrata is a soft, fresh Italian cheese made from cow's milk. Based on the outer appearance alone, this cheese could easily be mistaken for fresh mozzarella—and that's because the outer shell is made of soft mozzarella.",
            "But break into it, and you'll be pleasantly surprised to find an oozing, soft interior made of small cheese curds and cream. In fact, the Italian word burro, translates to butter, giving you an idea of just how rich and creamy it is.",
            "This decadent cheese originated in southern Italy and dates back to the early 1900s (at least four centuries after the development of mozzarella). Ever since, burrata has been a key ingredient in Italian dishes such as pizza, pasta, and Caprese salads. But, in my opinion, there's no better way to eat burrata than on its own with a little olive oil and Italian bread.",
            "Burrata is essentially a shell of mozzarella wrapped around a lush mixture of cheese curds and cream all formed into one supple, malleable ball. But how does it go from mozzarella and cream to the ball of cheesy goodness we know it as today? It's a meticulous process perfected by Italian artisans, but here we'll break it down into layman's terms as best we can.",
            "Burrata starts like any cheese, with cultures and rennet, which are added to warm, fresh cow's milk. As the milk starts curdling, the whey separates and is drained off. Next, boiling water is poured over the curds, which are then stretched, essentially making mozzarella.",
            "But here's where burrata distinguishes itself from mozzarella: The stretched curd is used to create a pouch, that is then filled with a mixture of cream and fresh curds. The pouch is then sealed off to create burrata's signature, dumpling-like shape.",
            "We've established that burrata is rich, so it should come as no surprise that it is often described as \"buttery.\" Truthfully, the thing that's so beautiful about this fresh cheese is the supreme balance it achieves in both flavor and texture. Burrata has similar flavor notes as fresh mozzarella cheese, but with a more decadent, concentrated milky taste and a sweetness that's reminiscent of rich cream.",
            "Based on appearance alone, it's easy to confuse burrata with fresh mozzarella. But as we know, looks aren't everything. Mozzarella is an essential ingredient in burrata—it is used to make the outer wrapping or \"shell.\" But unlike mozzarella, which is made from stretched curds all the way through, burrata's center is made from a mixture of fresh cream and curds.",
            "The two kinds of cheese are similar in flavor, but burrata has a looser, more rich texture, thanks to the cream. Burrata is also higher in fat than mozzarella, again, thanks to the cream. Both types of cheese are typically packaged in some type of liquid to retain moisture. While both kinds of cheese are rich in flavor and texture, burrata's creamy center makes it ideal for the occasional indulgence.",
            "Although both are soft, fresh Italian cheeses with similar sounding names, ricotta and burrata are not the same, nor are they commonly substituted for one another. Ricotta is made using the whey leftover from producing other cheeses and has a very mild, delicately sweet, and creamy flavor. It does not have the mozzarella-like pouch that is a signature of burrata, and because of its high moisture content, is easily spreadable. Fluffy ricotta cheese is typically sold in a lidded, plastic container—often shelved next to cottage cheese in supermarkets—and is a staple ingredient in a wide variety of dishes, such as lasagna and other types of pastas, cakes, and even cookies.",
            "The next best thing to burrata is, you guessed it, fresh mozzarella. Because the two cheeses bear a resemblance in both flavor and ingredients, they are going to make the best substitutes for one another in recipes. However, you won't get that same creamy, loose texture with mozzarella that you get with burrata.",
            "But if you're planning to melt the cheese, fresh mozzarella is the better (and more affordable) choice anyway. The appeal of burrata is its creamy center, which is lost when it is melted.",
            "To make the most of burrata, use it in dishes that can really show off its texture contrast. And always serve it at room temperature for best results. As we've already established, drizzling it with a little olive oil and scooping it up with crunchy, Italian bread is my favorite way to indulge in it.",
            "But you can also serve burrata overtop a salad, paired with fruit, or as a pizza topping (just be sure to place it on the pizza after baking, so you don't lose the texture). And of course, this Italian cheese is the perfect pairing for fresh tomatoes and basil.",
            "The decadent, creamy texture of burrata makes it a little difficult to preserve. Once cut into, burrata is best enjoyed immediately. This cheese isn't going to freeze well, because of its high moisture content. Refrigerate in its original packaging or in an airtight container filled with water for up to five days."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "5 mins",
            "Total": "20 mins",
            "Servings": "10",
            "Yield": "10 appetizer servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "642",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "8g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/12856/calamari/",
        "recipe_name": "Calamari",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/q3Y5e_RXqaGjlaxYAxF80Wkl_tE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/1117634-eaf11aef98de4d1b8b182bc3c5a43dc3.jpg",
        "recipe_ingredients_formatted": [
            "3 cups vegetable oil",
            "¼ cup all-purpose flour",
            "1 teaspoon salt",
            "1 teaspoon dried oregano",
            "½ teaspoon ground black pepper",
            "12  squid, cleaned and sliced into rings",
            "1  lemon - cut into wedges, for garnish"
        ],
        "recipe_directions_formatted": [
            "Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).",
            "Mix together flour, salt, oregano, and pepper in a medium bowl. Dredge squid in flour mixture.",
            "Fry squid in hot oil until light brown, 2 to 3 minutes. Do not overcook, or squid will be tough. Drain squid on a paper towel-lined plate. Serve with lemon wedges."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "30 mins",
            "Total": "40 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "338",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "13g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/23842/easy-pasta-fagioli/",
        "recipe_name": "Easy Pasta Fagioli",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/DLaSze59umiGmHmusCsHK9IdoP4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/23842-easy-pasta-fagioli-Beauty-3x4-1-59be7d781ce742ff800ec384a6b4df9e.jpg",
        "recipe_ingredients_formatted": [
            "1 tablespoon olive oil",
            "1  carrot, diced",
            "1 stalk celery, diced",
            "1 thin slice onion, diced",
            "½ teaspoon chopped garlic",
            "4 (8 ounce) cans tomato sauce",
            "1 (14 ounce) can chicken broth",
            "1 tablespoon dried parsley",
            "½ tablespoon dried basil leaves",
            "freshly ground black pepper to taste",
            "1 ½ cups ditalini pasta",
            "1 (15 ounce) can cannellini beans, drained and rinsed"
        ],
        "recipe_directions_formatted": [
            "Heat olive oil in a saucepan over medium heat. Add carrot, celery, and onion; cook and stir until soft. Add garlic and sauté briefly. Stir in tomato sauce, chicken broth, parsley, basil, and pepper; simmer for 20 minutes.",
            "Bring a large pot of lightly salted water to a boil. Add ditalini pasta and cook for 8 minutes or until al dente; drain.",
            "Add beans and cooked pasta to soup; simmer until heated through, 1 or 2 minutes."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "1 hr",
            "Prep": "15 mins",
            "Cook": "1 hr 15 mins",
            "Total": "2 hrs 30 mins",
            "Servings": "40",
            "Yield": "80 (1-inch) square pieces"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "137",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "3g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/246463/torrone-italian-nut-and-nougat-confection/",
        "recipe_name": "Torrone (Italian Nut and Nougat Confection)",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/0CifYypXHrOnPp50e3EMdXoZyio=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(477x0:479x2):format(webp)/3345442_torrone-italian-nut-and-nougat-confection_chef-john-f0eda314f78d472cae4ca04003ced3c3.jpg",
        "recipe_ingredients_formatted": [
            "2  (8x10-inch) sheets wafer paper",
            "3 cups roasted almonds",
            "1 cup roasted pistachios",
            "1 ⅓ cups honey",
            "1 cup white sugar",
            "3 tablespoons white sugar",
            "2 large egg whites, at room temperature",
            "1 pinch salt",
            "1 tablespoon lemon zest",
            "¼ teaspoon vanilla extract"
        ],
        "recipe_directions_formatted": [
            "Line an 8x11-inch baking dish with plastic wrap, allowing ends to hang over the sides. Place 1 sheet wafer paper in the bottom of the lined dish. Place almonds and pistachios in a warm place to make them easier to mix in at the end.",
            "Pour honey into a heavy-bottomed pot. Add 1 cup plus 3 tablespoons sugar; cook over low heat with a spatula, stirring constantly, until mixture turns from grainy to silky and smooth, about 30 minutes. Remove the pot from heat.",
            "Place egg whites and salt in a mixing bowl. Whisk until whites form soft peaks, 3 to 4 minutes. Place the pot with honey mixture back on low heat. Gradually whisk 1/4 of the whipped egg whites into honey mixture; whisk in remaining egg whites in 3 more batches.",
            "Continue cooking over low heat, stirring constantly with a spatula, until mixture turns a brighter white and a ribbon of mixture on the surface does not immediately incorporate, about 40 minutes. You can add a few drops of mixture to a small bowl of ice cold water to test the consistency; ideally it should feel like soft clay.",
            "Whisk in lemon zest and vanilla. Add warm almonds and pistachios; stir to incorporate evenly. Transfer nougat mixture to the prepared baking dish; smooth the top with a clean, oiled spatula. Top nougat with remaining sheet wafer paper, shiny-side up. Lay plastic wrap over the top and press down evenly, tamping mixture down gently but firmly. Remove top plastic wrap.",
            "Allow nougat to sit at room temperature until cool, firm, and ready to cut, 1 or 2 hours.",
            "Lift the edges of overhanging plastic wrap to release nougat from the baking dish. Invert and remove plastic wrap from the bottom. Trim off the edges if plastic wrap is hard to remove. Cut torrone into 1-inch squares using a sharp serrated knife.",
            "If you don't have wafer paper (edible rice paper), you can spray the plastic wrap with vegetable oil. Some people use cornstarch, but I'm not a fan."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "1 hr",
            "Prep": "40 mins",
            "Cook": "None",
            "Total": "1 hr 40 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "297",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "13g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/266023/homemade-lasagna-sheets/",
        "recipe_name": "Homemade Lasagna Sheets",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/XJ5F53brHDUOmOsL1y-XRSNXadQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1725x1495:1727x1497):format(webp)/JF_266023_HomemadeLasagnaSheets_4x3_12693-7d3b6c0f6499449797a4d43f9e18de8a.jpg",
        "recipe_ingredients_formatted": [
            "2 ¼ cups Italian-style tipo 00 flour, plus additional for dusting",
            "3 large eggs",
            "1 pinch salt",
            "1 tablespoon water as needed"
        ],
        "recipe_directions_formatted": [
            "Gather all ingredients.",
            "Place flour on a marble or wooden work surface. Make a well in the center and crack in eggs; add salt.",
            "Gently beat eggs using a fork, incorporating surrounding flour, until mixture is runny. Bring remaining flour into the mixture using a bench scraper until dough forms a ball. Mix in water, 1 tablespoon at a time, if dough feels too stiff.",
            "Knead dough with your hands by flattening, stretching it, and folding the top towards the center. Turn 45 degrees and repeat until dough is soft and smooth, about 10 minutes.",
            "Shape dough into a ball. Place in a bowl and cover with plastic wrap. Refrigerate until firm, 30 minutes to 1 hour.",
            "Divide dough into 3 equal portions. Take one piece and flatten it a bit with your hands. Dust a work surface with flour and roll dough out using a rolling pin 5 to 6 times. Turn dough 45 degrees and roll out again, 5 to 6 times. Keep rolling and turning in the same way until dough is evenly very thin. When you hold up the dough, you should be able to see your fingers through it.",
            "Cut pasta dough into rectangular sheets to fit your baking dish using a pastry wheel or a knife. Transfer lasagna sheets to a floured kitchen towel and let air-dry for about 30 minutes before assembling.",
            "If you want to pre-make the pasta, air-dry it overnight, dusting with more flour if it's still too wet. Once completely dry, it will become stiff. Store in a paper bag, and use within a couple of days.",
            "Divide dough into 3 equal portions. Flatten 1 portion and pass through the thickest setting of the machine. Dust with flour, fold in half like a book, and repeat 3 to 4 times — always flouring, folding, and passing through the thickest setting — until dough is smooth in texture, even in size, and no longer sticky. Set the machine to a middle setting and pass each sheet through once more. Move to the next-to-last setting and pass through again. Cut 1 long strip in half. Pass the first half through the thinnest setting. Place this very long and thin sheet on a floured cloth. Repeat with remaining dough to make 6 long sheets. Trim sheets to fit your baking dish. Air-dry for 30 minutes, assemble, and bake."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Soups, Stews and Chili Recipes",
            "Soup Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "35 mins",
            "Total": "50 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "225",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "11g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/13009/pasta-fagioli/",
        "recipe_name": "Pasta e Fagioli (Pasta and Beans)",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/t6J8VfWgGntV6J-mDOvyQmJbptY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/13009pasta-fagiolimyhotsouthernmess4x3-78c598e1a27a4123a2b9a6f73c8f4a20.jpg",
        "recipe_ingredients_formatted": [
            "1 tablespoon olive oil",
            "1 medium onion, chopped",
            "2 stalks celery, chopped",
            "3 cloves garlic, minced",
            "2 teaspoons dried parsley",
            "1 teaspoon Italian seasoning",
            "¼ teaspoon crushed red pepper flakes",
            "salt to taste",
            "1 (14.5 ounce) can chicken broth",
            "2 medium tomatoes, peeled and chopped",
            "1 (8 ounce) can tomato sauce",
            "½ cup ditalini or other small pasta",
            "1 (15 ounce) can cannellini beans, with liquid"
        ],
        "recipe_directions_formatted": [
            "This restaurant-worthy pasta fagioli recipe is surprisingly easy (and cheap) to make at home.",
            "Pasta fagioli (or pasta e fagioli), which means \"pasta and beans,\" is a traditional Italian soup. It consists of small noodles (such as ditalini or macaroni) and cannellini beans in a seasoned tomato broth.",
            "You'll find a detailed ingredient list and step-by-step instructions in the recipe below, but let's go over the basics:",
            "These are the ingredients you'll need to make pasta e fagioli at home:",
            "· Oil: This pasta fagioli recipe starts with cooking an onion in olive oil.\n· Vegetables: You'll need an onion, celery, and a can of cannellini beans.\n· Seasonings and herbs: The flavorful soup is seasoned with fresh garlic, parsley, Italian seasoning, crushed red pepper flakes, and salt.\n· Broth: Use store-bought or homemade chicken broth.\n· Tomatoes: You'll need fresh chopped tomatoes and a can of tomato sauce.\n· Pasta: Make this traditional pasta fagioli with ditalini noodles (or any noodle you like).",
            "\"This entire recipe is cheaper than one bowl at Olive Garden,\" culinary producer Nicole McLaughlin (a.k.a. NicoleMcMom) says of this pasta fagioli recipe. Here are a few of her best tips and tricks for making a perfect pot of Italian soup every time:",
            "· Though the recipe calls for one can of chicken broth, Nicole uses more because she prefers her pasta fagioli a little more soupy.\n· Many pasta fagioli recipes call for Italian sausage. You can add the meat if you like, but this top-rated recipe is pretty hearty as-is.\n· To serve, Nicole likes to ladle the soup into bowls and top with freshly grated Parmesan, cracked black pepper, and fresh parsley.",
            "Since this is a hearty pasta soup, there's really no need to pair pasta fagioli with any side dishes. However, a complementary side salad or a slice of crusty garlic bread will take this impressive dish over the top.",
            "Store your (completely cooled) leftover pasta e fagioli in an airtight container in the fridge for up to five days. We don't recommend freezing this soup, as the pasta will likely become unpleasantly mushy during the thawing process.",
            "\"Easy recipe and so very delicious,\" says jonna. \"I doubled the recipe and there was hardly a scrap left. I substituted a can of diced tomatoes for the fresh tomatoes.\"",
            "\"This is the best pasta fagioli that I have ever tasted and I was raised on this stuff,\" raves calead910. \"What I love most is that it is affordable, easy, and delicious.\"",
            "\"Great recipe, my family really enjoyed the soup,\" according to Charles Pickett. \"I added Parmesan and smoked Gouda cheese to mine and it was absolutely amazing.\"",
            "Editorial contributions by Corey Williams",
            "Heat olive oil in a large saucepan over medium heat. Add onion, celery, garlic, parsley, Italian seasoning, pepper flakes, and salt; cook and stir until onion is translucent, about 5 minutes. Stir in chicken broth, tomato sauce, and tomatoes. Reduce the heat to low and simmer for 15 to 20 minutes.",
            "Add pasta and cook until tender, about 10 minutes.",
            "Stir in undrained beans and cook until heated through, 3 to 4 minutes."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Side Dish",
            "Sauces and Condiments",
            "Sauces",
            "Pesto"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "5 mins",
            "Cook": "None",
            "Total": "5 mins",
            "Servings": "16",
            "Yield": "2 cups"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "92",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "2g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/13937/pesto/",
        "recipe_name": "Pesto",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/5mYUSKevSPhwYCNfKl8Q_FY2-dI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(899x0:901x2):format(webp)/8085943-pesto-carmen-1x1-1-b14ae3e0dcf24d618ddb6688a3537f0c.jpg",
        "recipe_ingredients_formatted": [
            "3 cups packed fresh basil leaves",
            "¾ cup grated Parmesan cheese",
            "½ cup olive oil",
            "¼ cup pine nuts",
            "4 cloves garlic, or to taste",
            "2 teaspoons lemon juice, or more to taste (optional)"
        ],
        "recipe_directions_formatted": [
            "This basic pesto recipe proves that sometimes the best things in life are the simplest.",
            "You'll find a detailed ingredient list and step-by-step instructions in the pesto recipe below, but let's go over the basics:",
            "Pesto is a vibrant green, fresh-tasting sauce that originated in Genoa, Italy. It’s traditionally made with a combination of fresh basil, Parmesan cheese, olive oil, garlic, and pine nuts.",
            "The name “pesto” comes from the Italian word “pestare,” which means “to crush.” Though modern recipes (such as this one) rely on blenders or food processors, the ingredients for pesto are traditionally crushed together using a mortar and pestle.",
            "These are the simple, fresh ingredients you’ll need to make this homemade pesto recipe:",
            "Simply combine the ingredients in a food processor or blender, then process or blend until smooth. It truly couldn’t be easier! Find the full, step-by-step pesto recipe with detailed instructions below.",
            "Here are some tips and tricks from culinary producer Nicole McLaughlin (a.k.a. NicoleMcMom):",
            "It’s hard to describe pesto’s flavor to someone who hasn’t tasted it, but we’ll try: Pesto is generally bright, earthy, herby, salty, and rich.",
            "Toss your favorite pasta in this homemade pesto for a classic Italian meal. It also works well as a sandwich spread, pizza topping, lasagna filling, and so much more. Of course, you can’t go wrong pairing it with chicken.",
            "Really, you can use this pesto wherever you want a bright burst of earthy flavor. Explore our collection of 47 Delicious Ways to Use Pesto for delicious inspiration. Here are some of the ideas you’ll find:",
            "Store homemade pesto in an airtight container in the refrigerator for up to three days or freeze it for up to three months.",
            "“It’s easy, fresh, and full of flavor,” raves G-girl. “It was my first time making it and I had so much fun. This will be my go-to recipe!”",
            "“This is always my go-to recipe for pesto,” says cbsweete. “My family and friends love it. I use this recipe to make small and large batches. For my large batches, I freeze it in ice cube trays, then use the \"pesto cubes\" throughout the winter for however many servings I need.”",
            "“In addition to putting this on pasta, I use it as a spread on my sliced tomato sandwiches instead of mayonnaise,” according to Joan Bone.",
            "Editorial contributions by Corey Williams",
            "Combine basil, Parmesan cheese, olive oil, pine nuts, and garlic in the bowl of a food processor or blender. Blend to a smooth paste. Add lemon juice, if desired, and quickly pulse to combine.",
            ""
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "25 mins",
            "Prep": "30 mins",
            "Cook": "30 mins",
            "Total": "1 hr 25 mins",
            "Servings": "12",
            "Yield": "1 3-layer, 9-inch cake"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "767",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "8g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/7871/incredibly-delicious-italian-cream-cake/",
        "recipe_name": "Incredibly Delicious Italian Cream Cake",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/5gCaAp5yCTZ0nkHzepfcOVEWtS0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/2556678-incredibly-delicious-italian-cream-cake-Yoly-1x1-2-51735f4035424c1491bb635b26d6d1b1.jpg",
        "recipe_ingredients_formatted": [
            "1 cup buttermilk",
            "1 teaspoon baking soda",
            "½ cup butter",
            "½ cup shortening",
            "2 cups white sugar",
            "5 large eggs",
            "1 teaspoon vanilla extract",
            "1 cup flaked coconut",
            "1 teaspoon baking powder",
            "2 cups all-purpose flour"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 350 degrees F (175 degrees C). Grease three 9-inch round cake pans.",
            "Make the cake: Combine buttermilk and baking soda together in a small bowl; set aside.",
            "Beat butter, shortening, and sugar together in a large bowl with an electric mixer until light and fluffy. Mix in eggs, buttermilk mixture, vanilla, coconut, baking powder, and flour; stir until just combined. Pour batter into the prepared pans.",
            "Bake in the preheated oven until a toothpick inserted into the center of the cake comes out clean, 30 to 35 minutes. Cool in the pans for 5 minutes; transfer to a wire rack and let cool completely, 20 to 25 minutes.",
            "Make the frosting (while cakes are cooling): Beat cream cheese, butter, vanilla, and confectioners' sugar in a medium bowl with an electric mixer until light and fluffy. Beat in cream, a little at a time, to attain the desired consistency. Stir in walnuts and coconut. Spread frosting between the cake layers and on the top and sides of cooled cake."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "30 mins",
            "Prep": "45 mins",
            "Cook": "45 mins",
            "Total": "2 hrs",
            "Servings": "24",
            "Yield": "2 9-inch deep-dish pies"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "352",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "13g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/9328/ricotta-pie-old-italian-recipe/",
        "recipe_name": "Ricotta Pie (Old Italian Recipe)",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/9vTXY4ZwDxfeQDJgGD4gm-_yW6g=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(511x0:513x2):format(webp)/7674026-b5b9aa67f31f429bb00c45d472d9b689.jpg",
        "recipe_ingredients_formatted": [
            "12 large eggs",
            "2 cups white sugar",
            "2 teaspoons vanilla extract",
            "3 pounds ricotta cheese",
            "¼ cup miniature semisweet chocolate chips, or to taste"
        ],
        "recipe_directions_formatted": [
            "This old-fashioned ricotta pie recipe is rich, creamy, and tastes just like it came from an Italian bakery.",
            "These are the ingredients you'll need to make this absolutely irresistible ricotta pie recipe:",
            "· Eggs: This Italian ricotta pie calls for a whopping 16 eggs (12 for the filling and four for the crust).\n· Sugar: You'll need three cups of white sugar (two for the filling and one for the crust).\n· Vanilla: Vanilla extract enhances the overall flavor of the ricotta filling and the sweet crust.\n· Ricotta: The dense, creamy filling calls for three pounds of ricotta cheese.\n· Chocolate: Semisweet chocolate chips take the decadent filling up a notch, but you can leave them out if you like.\n· Flour: The sweet crust starts with four cups of all-purpose flour.\n· Baking powder: Baking powder guarantees a tender and flaky pie crust.\n· Shortening: Shortening (instead of butter) makes the pie crust easy to roll out and it holds its shape well.\n· Milk: Brush the pie crust with milk to give it a matte finish.",
            "You'll find the full, step-by-step recipe below — but here's a brief overview of what you can expect when you make ricotta pie at home:",
            "1. Make the filling: Beat the eggs, then add sugar and vanilla. Beat in the ricotta and the chocolate chips.\n2. Make the crust: Combine the dry ingredients, cut in the shortening, then beat in the egg mixture. Divide the dough into balls, wrap in plastic, and chill.\n3. Roll and cut the crust: Roll out the dough balls and use them to line two prepared pie plates. Roll out the remaining two balls and cut into strips.\n4. Assemble the pies: Fill each of the pies then top each pie with a lattice pattern. Brush the crust with milk.\n5. Bake the pies: Bake the pies in the preheated oven until a knife inserted into the center comes out clean. Cool on wire racks, then refrigerate.",
            "Tips from recipe creator Misty:",
            "· Instead of chocolate chips, you can use 1 tablespoon of fresh lemon zest.\n· Instead of a lattice top, you can use cookie cutters and place the cutouts on the top of the pies.",
            "Allow the pie to cool completely before storing. Cover the leftovers tightly with storage wrap or foil, then store for up to three days in the refrigerator.",
            "Freezing may change the texture of the ricotta pie, but it will preserve it for up to three months. Wrap the pie tightly in storage wrap, then wrap it again in a layer of aluminum foil. Thaw the pie in the refrigerator.",
            "\"This pie was delicious and exactly what I remember from my childhood,\" according to Elaine Lienhart. \"The family loved it and requested that I make one for Thanksgiving. Next time I will cut the recipe in half and only make one pie.\"",
            "\"This recipe is almost perfect,\" says Cookin' With Lukie. \"My grandmother used to make this at Easter time. It's a delicious treat, but a very small piece goes a long way. Would I make it again? Of course I would...my Grandmother's recipe is lost to us, so this one will make up for that loss and bring smiles to my family as they enjoy this springtime treat!\"",
            "\"Amazing, delicious, easy to make,\" raves bldrdgirl. \"I'd give it 10 stars if I could! The tip to getting the crust to stay in one piece is to FOLLOW THE DIRECTIONS. You must let it chill in the fridge.\"",
            "Editorial contributions by Corey Williams",
            "Make the filling: Beat eggs, sugar, and vanilla together in a large bowl. Stir in ricotta cheese and chocolate chips; set aside.",
            "Make the crust: Combine flour, sugar, and baking powder together in a large bowl; cut in shortening until mixture resembles coarse crumbs. Mix in beaten eggs and vanilla. Divide dough into 4 balls, wrap in plastic, and chill for at least 30 minutes.",
            "Preheat the oven to 325 degrees F (165 degrees C). Grease two 9-inch, deep-dish pie plates.",
            "Roll out two dough balls and line the bottom and sides of each prepared pie plate. Try not to make the crust too thick, as it will expand during cooking. Roll the remaining two dough balls out into 10-inch circles. Cut into 1/2-inch strips with a sharp paring knife or pastry wheel.",
            "Pour ricotta filling evenly into pie crusts. Start with the longest strips of dough and lay the first 2 in an X in the center of the pie. Alternate horizontal and vertical strips, weaving them in an over-and-under pattern. Use the shortest strips for the edges of the lattice. Fold the ends of the lattice strips under the edge of the bottom crust and flute the crust; brush lattice top with milk. Arrange foil on edges of crust.",
            "Bake in the preheated oven for 20 to 30 minutes; remove foil. Rotate pies on the rack so they will bake evenly. Continue to bake until a knife inserted in the center of each pie comes out clean, 25 to 30 minutes more. Cool completely on wire racks. Refrigerate until serving."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Desserts",
            "Cookies",
            "International Cookie Recipes",
            "Italy"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "30 mins",
            "Cook": "15 mins",
            "Total": "45 mins",
            "Servings": "36",
            "Yield": "3 dozen"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "101",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "3g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/10022/pignoli-cookies-i/",
        "recipe_name": "Pignoli Cookies",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/nT72T6vILKgaE0k9YGt6n8nip1k=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/8760190-8894c6acd8664f7f852cb7521ccd3f77.jpg",
        "recipe_ingredients_formatted": [
            "cooking spray",
            "12 ounces almond paste",
            "½ cup white sugar",
            "1 cup confectioners' sugar",
            "4  egg whites, divided",
            "1 ½ cups pine nuts",
            "all-purpose flour for rolling"
        ],
        "recipe_directions_formatted": [
            "Pignoli cookies are soft, chewy, perfectly nutty, and absolutely irresistible. Reviewers say this pignoli cookie recipe creates Italian bakery-worthy results!",
            "A pignolo (\"pignoli\" when it's plural) is a traditional Italian cookie. The pine nut-studded cookies are made with egg whites and almond paste, which gives them a nutty flavor and airy texture.",
            "These are the ingredients you'll need to make this top-rated pignoli cookie recipe:",
            "· Almond paste: You can buy almond paste at the store or make your own at home.\n· Sugars: You'll need both white and confectioners' sugars.\n· Egg whites: Egg whites give the pignoli cookies a light and airy texture.\n· Pine nuts: Pine nuts are the main ingredient in pignolis! A more budget-friendly option is sliced almonds.\n· Flour: Lightly flour your hands before rolling the dough to prevent sticking.",
            "You'll find the full, step-by-step recipe below — but here's a brief overview of what you can expect when you make these pignoli cookies:",
            "1. Blend the almond paste and white sugar in a food processor.\n2. Add the confectioners' sugar and two egg whites. Blend.\n3. Roll the dough into balls.\n4. Coat each ball in egg whites, then roll in pine nuts.\n5. Arrange the dough balls on a prepared baking sheet and bake until lightly browned.",
            "Allow the pignoli cookies to cool completely. Store them in an airtight container at room temperature for up to a week. If you have to stack the cookies, make sure to place wax paper between each layer to prevent sticking.",
            "\"Absolutely wonderful,\" raves CMKONTHEGO. \"Moist and chewy with a crispy bottom — great flavor too. Just like the ones from the New York bakeries. I will make them again and again!\"",
            "\"These cookies are fantastic,\" says one Allrecipes community member. \"I've always made this recipe exactly as-is here. I've found that making everything in the food processor is the easiest way to go. Thanks so much for the recipe — it's always a hit!\"",
            "\"These came out absolutely delicious,\" according to Always Cooking Up Something. \"I had to chill the dough for about 15 minutes before it was firm enough to form the cookies, but other than that everything turned out perfect!\"",
            "Editorial contributions by Corey Williams",
            "Preheat the oven to 325 degrees F (165 degrees C). Line 2 cookie sheets with foil; lightly grease the foil with cooking spray.",
            "Place almond paste and white sugar in a food processor; blend until combined. Add confectioners' sugar and 2 egg whites; blend until smooth.",
            "Whisk remaining 2 egg whites in a small bowl. Place pine nuts on a shallow plate.",
            "With lightly floured hands, roll dough into 1-inch balls. Coat balls in egg whites, shaking off excess, then roll in pine nuts, pressing lightly to stick. Arrange balls on cookie sheets, and flatten slightly to form a 1 1/2-inch round.",
            "Bake in the preheated oven until lightly browned, 15 to 18 minutes. Let stand on cookie sheets briefly, then transfer to a wire rack to cool.",
            "If you need to keep these cookies gluten-free, use gluten-free flour when shaping the cookies."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Main Dishes",
            "Pasta",
            "Pasta Carbonara Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "5 mins",
            "Cook": "15 mins",
            "Total": "20 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "764",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "39g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/245775/spaghetti-alla-carbonara-the-traditional-italian-recipe/",
        "recipe_name": "Spaghetti alla Carbonara",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/E-R9OLKaaDUcuT4fEzv_Iuxr6tg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/245775-spaghetti-alla-carbonara-the-traditional-italian-recipe-DDMFS-4x3-879c32ee3cfb463582e3e6230e311029.jpg",
        "recipe_ingredients_formatted": [
            "2 teaspoons olive oil",
            "1 pound guanciale (cured pork cheek), diced",
            "1 (16 ounce) package spaghetti",
            "3 large eggs",
            "10 tablespoons grated Pecorino Romano cheese, divided",
            "salt and freshly ground black pepper to taste"
        ],
        "recipe_directions_formatted": [
            "This classic spaghetti alla carbonara recipe is smooth, creamy, and full of rich Italian flavor.",
            "Carbonara is a Roman dish made with eggs, hard cheese, and cured pork. Its signature rich and silky sauce comes from beaten eggs tossed with hot pasta. The trick to making carbonara is making sure the pasta is hot enough to cook the eggs, but not so hot that they curdle.",
            "These are the simple ingredients you’ll need to make homemade spaghetti alla carbonara recipe:",
            "You’ll find the full, step-by-step recipe below (with photos) — but here’s a brief overview of what you can expect when you make traditional spaghetti alla carbonara:",
            "Notes and tips from the chef:",
            "In need of serving inspiration for spaghetti alla carbonara? Explore our collection of 16 of the Best Side Dishes to Pair With Your Spaghetti Dinner. Here are few of the mouthwatering recipes you’ll find:",
            "Store your leftover spaghetti alla carbonara in an airtight container in the refrigerator for up to three days. Reheat gently in the microwave or on the stove.",
            "“One of our family favorites,” says one Allrecipes community member. “Great and simple recipe! I use pancetta from Trader Joe's instead of guanciale.”",
            "“So easy and so yummy,” raves Vicki. “Be sure to save the pasta water.”",
            "“Added sun-dried tomatoes and chili flakes for a kick,” according to Timothy Blake Schritter. “My wife and four kids all agree, this is our favorite pasta.”",
            "Editorial contributions by Corey Williams",
            "Heat olive oil in a large skillet over medium heat; add guanciale (see Cook's Note). Cook, turning occasionally, until evenly browned and crispy, 5 to 10 minutes. Remove from heat and drain on paper towels.",
            "Bring a large pot of salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until tender yet firm to the bite, about 9 minutes. Drain and return to the pot. Let cool, stirring occasionally, about 5 minutes.",
            "Whisk eggs, 1/2 of the Pecorino Romano cheese, and some black pepper in a bowl until smooth and creamy.",
            "Pour egg mixture over pasta, stirring quickly, until creamy and slightly cooled. Stir in guanciale.",
            "Top with remaining Pecorino Romano cheese and more black pepper.",
            "Please note the addition of reserved pasta water when using the magazine version of this recipe."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Bread",
            "Yeast Bread Recipes",
            "White Bread Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "1 day 20 mins",
            "Prep": "20 mins",
            "Cook": "20 mins",
            "Total": "1 day 1 hr",
            "Servings": "15",
            "Yield": "2 loaves"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "96",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "3g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/6749/ciabatta/",
        "recipe_name": "Ciabatta",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/lgFskxK8q3RQZQckEroG3dy6JJc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/6749-ciabatta-ddmfs-1X1-5759-fe73a028a6c54404a1c6918b7c88dd12.jpg",
        "recipe_ingredients_formatted": [
            "2 tablespoons warm water (110 degrees F/45 degrees C)",
            "⅛ teaspoon active dry yeast",
            "1 cup bread flour",
            "⅓ cup warm water"
        ],
        "recipe_directions_formatted": [
            "Make the sponge: Stir warm water and yeast together in a small bowl. Let stand for 5 minutes, or until creamy.",
            "Combine bread flour and warm water in a large bowl; stir in yeast mixture for 4 minutes. Cover with plastic wrap and let sponge stand at room temperature for at least 12 hours and up to 1 day.",
            "Make the bread: Combine warm milk and yeast together in a small bowl. Let stand for 5 minutes, or until creamy.",
            "Transfer milk-yeast mixture to the bowl of a stand mixer fitted with a dough hook. Add sponge, bread flour, warm water, and oil; blend until flour is just moistened. Add salt and mix until dough is smooth and elastic, about 8 minutes.",
            "Scrape dough into an oiled bowl and cover with plastic wrap. Let dough rise at room temperature until doubled in bulk, about 1 1/2 hours. The dough will be sticky and full of air bubbles.",
            "Turn dough out onto a well-floured work surface and cut in half. Transfer each half to a parchment sheet and form into an irregular oval about 9 inches long. Dimple loaves with floured fingers and dust tops with flour.",
            "Cover loaves with a dampened kitchen towel. Let loaves rise at room temperature until almost doubled in bulk, 1 1/2 to 2 hours.",
            "At least 45 minutes before baking ciabatta, place a baking stone on the oven rack in the lowest position in the oven; preheat the oven to 425 F (220 degrees C).",
            "Transfer 1 loaf on its parchment to a rimless baking sheet with a long side of the loaf parallel to the far edge of the baking sheet. Line up the far edge of the baking sheet with the far edge of the baking stone in the preheated oven and tilt to slide the loaf with parchment onto the back half of the stone. Transfer the remaining loaf to the front half of the stone in a similar manner. Bake ciabatta loaves until just golden, about 20 minutes. Cool loaves on a wire rack."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "None",
            "Cook": "3 hrs",
            "Total": "3 hrs",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "416",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "8g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/55609/gelato/",
        "recipe_name": "Gelato",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/hAaJwiWmoVmk2nm6BSzIZrUG0E8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(799x0:801x2):format(webp)/4517634-gelato-Buckwheat-Queen-4x3-1-f5f732166ec64620b2a438391cbd0583.jpg",
        "recipe_ingredients_formatted": [
            "2 cups milk",
            "1 cup heavy cream",
            "4  egg yolks",
            "½ cup sugar"
        ],
        "recipe_directions_formatted": [
            "Mix milk and cream in a medium saucepan. Warm until foam forms around the edges. Remove from heat.",
            "Beat egg yolks and sugar until frothy in a large bowl. Gradually pour the warm milk into egg yolks and sugar, whisking constantly. Return mixture to saucepan; cook over medium heat, stirring with a wooden spoon until the mixture gels slightly and coats the back of the spoon. If small egg lumps begin to show, remove from heat immediately.",
            "Pour the mixture through a sieve or fine strainer into a bowl. Cover, and chill for several hours or overnight.",
            "Pour the mixture into an ice cream maker, and freeze according to the manufacturer's instructions. Transfer to a sealed container, and freeze until firm. If the gelato is too firm, place it in the refrigerator until it reaches the desired consistency."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Side Dish",
            "Sauces and Condiments",
            "Relish Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "2 days 8 hrs",
            "Prep": "45 mins",
            "Cook": "None",
            "Total": "2 days 8 hrs 45 mins",
            "Servings": "10",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "233",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "1g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/81581/hot-italian-giardiniera/",
        "recipe_name": "Hot Italian Giardiniera",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/SucksSvF8ou8zRP0Bo6WP8iuYlk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/5636903-hot-italian-giardiniera-D3monic-1x1-1-d82c317a1866471fa16e2b5d2278a1c5.jpg",
        "recipe_ingredients_formatted": [
            "2  green bell peppers, diced",
            "2  red bell peppers, diced",
            "8 fresh jalapeño peppers, sliced",
            "1  celery stalk, diced",
            "1 medium carrot, diced",
            "1 small onion, chopped",
            "½ cup fresh cauliflower florets",
            "½ cup salt",
            "1 (5 ounce) jar pimento-stuffed green olives, chopped",
            "2 cloves garlic, finely chopped",
            "1 tablespoon dried oregano",
            "1 teaspoon red pepper flakes",
            "½ teaspoon black pepper",
            "1 cup white vinegar",
            "1 cup olive oil"
        ],
        "recipe_directions_formatted": [
            "This giardiniera recipe is the perfect way to add flavor and color to any dish.",
            "Giardiniera is Italian pickled vegetables that’s usually served as a relish. Ingredients can vary, but it usually includes peppers, celery, carrots, and cauliflower in vinegar and/or olive oil.",
            "These are the ingredients you’ll need to make this homemade giardiniera recipe:",
            "You’ll find the full, step-by-step recipe below — but here’s a brief overview of what you can expect when you make homemade giardiniera:",
            "The classic way to serve giardiniera is on Italian beef sandwiches, but the crisp pickled veggies work well with just about any rich meat. It also works well on charcuterie boards or served as a side dish alongside your favorite Italian entrees.",
            "This recipe is the “perfect excuse to stop buying store-bought giardiniera and make your own,” according to culinary expert Nicole McLaughlin (a.k.a. NicoleMcMom). Here are some of her best tips:",
            "“I've lived in Chicago for over 30 years and have become hooked on hot giardiniera,” says one Allrecipes community member. “This is hands down the best one ever. I have made it about a dozen times and everyone I know loves when I have a new batch ready.”",
            "“Fantastic,” raves thestashek. “I eat it right out of the jar.”",
            "“Recipe is excellent,” according to April Knebel. “We have decided to try more veggies next time such as radishes and asparagus.”",
            "Editorial contributions by Corey Williams",
            "Place green and red peppers, jalapeños, celery, carrots, onion, and cauliflower in a large bowl. Stir in salt, then fill with enough cold water to cover. Place plastic wrap or aluminum foil over the bowl; refrigerate for 8 hours to overnight.",
            "Drain salty water; rinse vegetables and set aside.",
            "Mix together olives, garlic, oregano, red pepper flakes, and black pepper in a medium bowl. Pour in vinegar and olive oil; mix well. Combine with vegetable mixture; cover and refrigerate for 2 days before using.",
            "Nutrition data for this recipe includes the full amount of brine ingredients. The actual amount of brine consumed will vary."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Christmas",
            "Desserts",
            "Christmas Cookie Recipes",
            "Pizzelle"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "35 mins",
            "Total": "50 mins",
            "Servings": "24",
            "Yield": "2 dozen"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "102",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "2g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/10220/pizzelles-iii/",
        "recipe_name": "Pizzelle",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/t3aBwk1_4lnhBhkOAPqbtHuJfhE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(899x0:901x2):format(webp)/616683-pizzelles-iii-ThatStephanie-1x1-1-2f7ef202c01d49b4aa6cefd0e87968c4.jpg",
        "recipe_ingredients_formatted": [
            "3 large eggs",
            "¾ cup white sugar",
            "½ cup butter, melted",
            "1 tablespoon vanilla extract",
            "1 ¾ cups all-purpose flour",
            "2 teaspoons baking powder",
            "2 teaspoons vegetable oil, or as needed"
        ],
        "recipe_directions_formatted": [
            "This pizzelle recipe creates light, crispy, and beautifully elegant Italian cookies every time. It'll quickly become a holiday season staple in your household.",
            "Pizzelles are thin Italian waffle cookies with a crisp texture. They're made with pizzelle irons and feature intricate designs. Pizzelle cookies, which are commonly served during the Christmas and Easter holidays, can be served flat or molded into shapes while they're still warm.",
            "Believe it or not, you don't need a lot of ingredients to make this impressive pizzelle recipe. Here's what to add to your grocery list:",
            "· Eggs: Eggs lend moisture and act as a binding agent, which means they help hold the dough together.\n· Sugar: Sweeten things up with white sugar.\n· Butter: You'll need a stick of melted butter.\n· Vanilla: A tablespoon of vanilla extract enhances the overall flavor of the pizzelle cookies.\n· Flour: All-purpose flour creates structure in the cookie dough.\n· Baking powder: Baking powder acts as a leavener, which means it helps the cookies rise slightly.\n· Oil: Make sure to brush your pizzelle iron with vegetable oil to keep the cookies from sticking.",
            "You'll find the full, step-by-step recipe below — but here's a brief overview of what you can expect when you make these gorgeous pizzelles:",
            "1. Beat the eggs and sugar, then stir in the butter and vanilla.\n2. Add the flour and baking powder.\n3. Spoon the batter onto the prepared pizzelle iron.\n4. Close the iron and bake for 30-45 seconds.",
            "You can also make chocolate pizzelles by making a few changes to this recipe. To make chocolate pizzelles:",
            "1. Increase the sugar by another ¼ cup.\n2. Add ¼ cup cocoa powder sifted together in the flour-baking powder mixture with an extra ¼ teaspoon baking powder",
            "Make sure the cookies are completely cool before storage. Place them in an airtight container or zip-top storage bag and store at room temperature for up to two weeks.",
            "Yes, you can freeze pizzelles. While they won't be quite as crisp as freshly baked cookies, they'll still be delicious! Arrange the cooled cookies on a baking sheet, cover, and flash freeze for a few hours or up to overnight. Transfer them to a freezer-safe container or zip-top bags and freeze for up to three months. Thaw at room temperature.",
            "\"I have never made these before and enjoyed making them this morning,\" says juliekay. \"I used vanilla and a very small amount of anise seeds. The flavor and texture was great. I look forward to trying making these cookies again.\"",
            "I love this recipe,\" raves noelran9. \"I can't wait to try some different variations people have suggested. I made them exactly as the recipe stated and they were perfect!\"",
            "\"These were just outstanding and I have been eating these cookies my whole life,\" according to Lauren M. \"I followed the recipe exactly the first time and the cookies came out light and crispy and so good. They were very easy to make even on my very old pizzelle iron.\"",
            "Editorial contributions by Corey Williams",
            "Beat eggs and sugar in a large bowl until thick. Stir in melted butter and vanilla. Sift together flour and baking powder, and blend into the batter until smooth.",
            "Heat the pizzelle iron, and brush with oil. Drop about one tablespoon of batter onto each circle on the iron. You may need to experiment with the amount of batter and baking time depending on the iron. Bake for 20 to 45 seconds or until steam is no longer coming out of the iron. Carefully remove cookie from the iron and repeat with remaining batter.",
            "Cool completely before storing in an airtight container.",
            "To try the chocolate version, increase the sugar by another 1/4 cup. Then add 1/4 cup cocoa powder sifted together in the flour-baking powder mixture with an extra 1/4 teaspoon baking powder as well. I find that for the chocolate mixture, the iron must be well oiled to start, and brushed with more as needed."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Everyday Cooking",
            "More Meal Ideas",
            "DIY"
        ],
        "recipe_details_formatted": {
            "Additional Time": "5 mins",
            "Prep": "45 mins",
            "Cook": "15 mins",
            "Total": "1 hr 5 mins",
            "Servings": "12",
            "Yield": "3 balls"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "195",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "11g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/254478/homemade-mozzarella-cheese/",
        "recipe_name": "Homemade Mozzarella Cheese",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/u_DtXMmpVrnY4cLFyhkOP33rDss=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/254478-homemade-mozzarella-cheese-DDMFS-4x3-ed982c4254fe4d86bc38df6381729673.jpg",
        "recipe_ingredients_formatted": [
            "¾ cup cool water, divided",
            "1/4 teaspoon liquid rennet",
            "1 ½ teaspoons citric acid",
            "1 gallon raw milk",
            "1 teaspoon salt (Optional)"
        ],
        "recipe_directions_formatted": [
            "Combine 1/4 cup water and rennet in a small bowl; mix well.",
            "Combine remaining 1/2 cup water and citric acid in another small bowl; mix until dissolved.",
            "Pour milk into a large pot set over medium heat. Stir in citric acid mixture.",
            "Heat milk, stirring occasionally, until it registers 90 degrees F (32 degrees C) on an instant-read thermometer, about 5 minutes.",
            "Remove milk from heat and stir in rennet mixture in a figure-8 motion for 30 seconds. Stir counterclockwise for 30 seconds to still the milk. Let stand, covered, until milk sets into curd, 5 to 10 minutes. Press edge of curd gently with a palette knife or the back of a spoon to check for firmness.",
            "Slice vertically into the pot to cut curd into 3/4-inch cubes with a palette knife. Stir curds gently, but leave cubes mostly intact.",
            "Return pot to the heat; cook over medium heat, stirring curds gently, until temperature reaches 109 degrees F (43 degrees C), about 5 minutes. Remove from heat.",
            "Ladle curds into a colander set over a large bowl using a slotted spoon. Press curds gently to extract liquid whey. Pour drained whey back into the pot.",
            "Heat whey to 185 degrees F (85 degrees C), about 5 minutes. Wearing gloves, tear off a piece of curd and place on a slotted spoon. Dip curd into hot whey for 5 to 10 seconds. Stretch, fold, and knead curd. Repeat until mozzarella is smooth and elastic. Knead in salt and form curd into a ball. Repeat dipping and kneading process with remaining curd.",
            "Allow mozzarella to cool. Wrap tightly in plastic wrap and transfer to the refrigerator.",
            "Enjoy!",
            "Do not use ultra-high temperature processed (UHT) milk. Regular pasteurized milk will work, but raw milk is best.",
            "At the end of step 7, you may place your curds in a plastic bag and store both the curds and the whey in the refrigerator for 2 to 3 days before continuing the process. If you want a softer-textured, moist mozzarella, do not let the curd get as firm and work less when stretching and kneading. You can speed up the cooling process in step 9 by placing mozzarella balls in an ice-water bath."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Pork Soup Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "40 mins",
            "Total": "50 mins",
            "Servings": "6",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "385",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "19g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/12942/italian-sausage-soup/",
        "recipe_name": "Italian Sausage Soup",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/F4y1r2JwQ9-n-4-3-7ZAvOBj-0o=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/6285692-2000-b479479c45264abca7d46e3aee971868.jpg",
        "recipe_ingredients_formatted": [
            "1 pound Italian sausage",
            "1 clove garlic, minced",
            "2 (14 ounce) cans beef broth",
            "1 (14.5 ounce) can Italian-style stewed tomatoes",
            "1 cup sliced carrots",
            "¼ teaspoon salt",
            "¼ teaspoon ground black pepper",
            "1 (14.5 ounce) can great Northern beans, undrained",
            "2 small zucchini, cubed",
            "2 cups spinach - packed, rinsed and torn"
        ],
        "recipe_directions_formatted": [
            "Heat a stockpot or Dutch oven over medium-high heat. Add sausage and garlic; cook and stir until browned, 5 to 7 minutes. Stir in broth, tomatoes, and carrots; season with salt and pepper. Reduce heat to medium-low, cover, and simmer 15 minutes.",
            "Stir in beans with liquid and zucchini; cover and simmer another 15 minutes, or until zucchini is tender.",
            "Remove soup from heat and add spinach; replace the lid and allow spinach to wilt. Stir until warmed through."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Desserts",
            "Cakes",
            "Cheesecake Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "4 hrs",
            "Prep": "15 mins",
            "Cook": "2 hrs",
            "Total": "6 hrs 15 mins",
            "Servings": "8",
            "Yield": "1 9-inch cheesecake"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "704",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "16g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/154297/italian-cream-cheese-and-ricotta-cheesecake/",
        "recipe_name": "Italian Cream Cheese and Ricotta Cheesecake",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/xmB5l7Dor1GjFGAc698q9rnpI5g=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/403548-31849bcc16f044a0a9cbaced9ec4cae9.jpg",
        "recipe_ingredients_formatted": [
            "2 (8 ounce) packages cream cheese, softened",
            "1 (16 ounce) container ricotta cheese",
            "4 large eggs",
            "1 ½ cups white sugar",
            "½ cup butter, melted and cooled",
            "3 tablespoons flour",
            "3 tablespoons cornstarch",
            "1 tablespoon lemon juice",
            "1 teaspoon vanilla extract",
            "1 pint sour cream"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9-inch springform pan.",
            "Mix cream cheese and ricotta cheese together in a mixing bowl until well combined. Add eggs, sugar, butter, flour, cornstarch, lemon juice, and vanilla; mix to combine. Stir in sour cream and pour into the prepared pan.",
            "Bake in the preheated oven for 1 hour. Turn the oven off; allow cheesecake to cool in the oven with the door closed for 1 hour more to prevent cracking. Cool cheesecake completely in the refrigerator before serving."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Noodle Soup Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "25 mins",
            "Total": "35 mins",
            "Servings": "2",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "888",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "44g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/255823/pasta-fazool-pasta-e-fagioli/",
        "recipe_name": "Pasta Fazool (Pasta e Fagioli)",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/5Wy1EFfp0aQs3KojLX1lbrKcEUE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(449x0:451x2):format(webp)/4064575-pasta-fazool-pasta-e-fagioli-Chef-John-1x1-1-3b09444d9d99494181825cda657f3d0f.jpg",
        "recipe_ingredients_formatted": [
            "1 tablespoon olive oil",
            "12 ounces sweet bulk Italian sausage",
            "1 stalk celery, diced",
            "½  yellow onion, chopped",
            "¾ cup dry elbow macaroni",
            "¼ cup tomato paste",
            "3 cups chicken broth, or more as needed, divided",
            "¼ teaspoon crushed red pepper flakes, or to taste",
            "¼ teaspoon dried oregano",
            "Salt and freshly ground black pepper to taste",
            "3 cups chopped Swiss chard",
            "1 (15 ounce) can cannellini (white kidney) beans, drained",
            "¼ cup grated Parmigiano-Reggiano cheese, plus additional for serving, or to taste"
        ],
        "recipe_directions_formatted": [
            "Heat oil in a skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, about 5 minutes. Reduce heat to medium. Add diced celery and chopped onion. Cook until onions are translucent, 4 to 5 minutes. Add dry pasta; cook and stir for 2 minutes.",
            "Stir in tomato paste until evenly distributed, 2 to 3 minutes. Pour in 3 cups broth; increase heat to high and bring to a boil. Stir in red pepper flakes, oregano, salt, and pepper. Reduce heat to medium and let simmer, stirring often, for about 5 minutes. Add more broth if needed.",
            "Place chopped chard in a bowl. Cover with cold water and rinse leaves; any grit will fall to the bottom of the bowl. Transfer chard to a colander to drain briefly; add to soup. Cook and stir until leaves wilt, 2 to 3 minutes.",
            "Stir in white beans; continue cooking and stirring until pasta is tender, 4 to 5 minutes. Remove from heat and stir in grated cheese. Serve topped with additional grated cheese.",
            "This recipe makes enough for 2 large portions or 4 small ones."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Appetizers and Snacks",
            "Antipasto Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "30 mins",
            "Prep": "30 mins",
            "Cook": "35 mins",
            "Total": "1 hr 35 mins",
            "Servings": "16",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "54",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "1g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/247268/eggplant-caponata-sicilian-version/",
        "recipe_name": "Eggplant Caponata (Sicilian Version)",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/_9DIvlYN-Zfpfpk3_xCIlQkBgA4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/247268-eggplant-caponata-sicilian-version-1x1-328-copy-0e945c90f1df4290983e47d79c02bae1.jpg",
        "recipe_ingredients_formatted": [
            "1  eggplant, peeled and cut into 1/2-inch cubes",
            "salt to taste",
            "¼ cup olive oil, divided",
            "1 cup finely chopped celery",
            "1 medium onion, finely chopped",
            "1 clove garlic, minced",
            "1 ½ cups canned plum tomatoes, drained and coarsely chopped",
            "12  green olives, pitted and coarsely chopped",
            "1 ½ tablespoons drained capers",
            "1 tablespoon tomato paste",
            "1 teaspoon minced oregano",
            "2 tablespoons red wine vinegar",
            "2 teaspoons white sugar",
            "1 teaspoon salt",
            "ground black pepper to taste",
            "2 teaspoons minced fresh parsley, or to taste"
        ],
        "recipe_directions_formatted": [
            "Toss eggplant with salt and place in a colander set over a bowl. Let sit, about 30 minutes. Rinse and pat dry.",
            "Heat 2 tablespoons olive oil in a large skillet over medium heat. Add celery; cook, stirring often, until softened, about 4 minutes. Add onion and garlic; cook and stir until onion is soft and lightly golden, about 5 minutes. Transfer the mixture to a bowl using a slotted spoon.",
            "Heat remaining 2 tablespoons olive oil in the skillet. Add eggplant and cook, stirring constantly, until lightly browned, 5 to 7 minutes.",
            "Stir in celery mixture, tomatoes, olives, capers, tomato paste, and oregano. Bring to a boil; reduce heat to low and simmer uncovered until caponata is thickened, about 15 minutes.",
            "Season caponata with vinegar, sugar, salt, and black pepper. Transfer to a serving bowl and garnish with parsley."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Main Dishes",
            "Chicken",
            "Chicken Piccata Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "15 mins",
            "Total": "25 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "321",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "25g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/220751/quick-chicken-piccata/",
        "recipe_name": "Quick Chicken Piccata",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/YzCIUvQU5DOvMmL4QMBo5urrlsc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/220751-QuickChickenPiccata-ddmfs-4X3-0548-be56e9c2a3564e2e8478014299fadf09.jpg",
        "recipe_ingredients_formatted": [
            "4  skinless, boneless chicken breast halves",
            "cayenne pepper to taste",
            "salt and ground black pepper to taste",
            "all-purpose flour for dredging",
            "2 tablespoons olive oil",
            "1 tablespoon capers, drained",
            "½ cup white wine",
            "¼ cup fresh lemon juice",
            "¼ cup water",
            "3 tablespoons cold unsalted butter, cut in 1/4-inch slices",
            "2 tablespoons chopped fresh Italian parsley"
        ],
        "recipe_directions_formatted": [
            "Place chicken breasts between 2 sheets of heavy plastic on a solid, level surface. Firmly pound chicken breasts with the smooth side of a meat mallet to a 1/2-inch thickness.",
            "Season both sides of chicken breasts with cayenne, salt, and black pepper; dredge lightly in flour and shake off any excess.",
            "Heat olive oil in a skillet over medium-high heat. Place chicken in the pan, reduce heat to medium, and cook until browned and cooked through, about 5 minutes per side; transfer to a plate.",
            "Cook capers in reserved oil, smashing them lightly to release brine, until warmed through, about 30 seconds. Pour white wine into the skillet and bring to a boil while scraping the browned bits of food off the bottom of the pan with a wooden spoon. Cook until reduced by half, about 2 minutes.",
            "Stir lemon juice, water, and butter into the reduced wine mixture; cook and stir continuously to form a thick sauce, about 2 minutes. Reduce heat to low and stir parsley through the sauce.",
            "Return chicken breasts to the pan and cook until heated through, 1 to 2 minutes. Serve with sauce spooned over the top."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Cuisine",
            "European",
            "Italian",
            "Desserts"
        ],
        "recipe_details_formatted": {
            "Additional Time": "2 hrs",
            "Prep": "45 mins",
            "Cook": "1 hr",
            "Total": "3 hrs 45 mins",
            "Servings": "30",
            "Yield": "30 cannoli"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "402",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "5g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/88849/cannoli/",
        "recipe_name": "Cannoli",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/kqTw3KYx58GFwLEKuAnycqlhGUI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/865595-0c435d944e5d4817a9797e3def643282.jpg",
        "recipe_ingredients_formatted": [
            "3 cups all-purpose flour",
            "¼ cup white sugar",
            "¼ teaspoon ground cinnamon",
            "3 tablespoons shortening",
            "½ cup sweet Marsala wine",
            "2 tablespoons water",
            "1 tablespoon distilled white vinegar",
            "1 large egg",
            "1  egg yolk",
            "1  egg white",
            "1 quart oil for frying, or as needed"
        ],
        "recipe_directions_formatted": [
            "You might be intimidated by the idea of making cannolis at home, but you shouldn’t be! This cannoli recipe proves anyone can make the iconic Italian treat.",
            "A cannoli is a tube-shaped Italian dessert that consists of fried pastry dough stuffed with a sweet, creamy cheese filling.",
            "Learn more: What Is a Cannoli and What Does It Taste Like?",
            "You'll find a detailed ingredient list and step-by-step instructions in the recipe below, but let's go over the basics:",
            "These are the ingredients you’ll need for this classic cannoli recipe:",
            "Here’s a brief overview of what you can expect when you make these homemade cannolis:",
            "“If you’re feeling the need to channel your inner Italian grandmother or if you’re just looking for the perfect cannoli recipe, this is the one to try,” according to culinary producer Nicole McLaughlin (a.k.a. NicoleMcMom). Here are a few of her best cannoli tips:",
            "Yes, cannolis need to be refrigerated. Don’t leave them at room temperature for more than two to three hours at a time. Store them in an airtight container lined with paper towels in the refrigerator for up to one week.",
            "You can freeze cannolis for up to three months. Thaw them overnight in the refrigerator.",
            "“Thanks for this recipe, it reminds me of my grandfather's recipe,” says touchofspice. “Delish! It also brought back many wonderful childhood memories!”",
            "“They were so delicious that I even surprised myself,” according to Itza Mee. “The recipe was easy to follow and I will definitely be making them again.”",
            "“The shells are very easy and flavorful,” raves MariaC. “You do need to roll out the dough very thin. I don't have a pasta maker, but I do use my tortilla press and it works great at achieving a thin disk.",
            "Editorial contributions by Corey Williams",
            "Make shells: Mix flour, sugar, and cinnamon together in a medium bowl. Cut in shortening until crumbly.",
            "Make a well in the center and add Marsala wine, water, vinegar, egg, and egg yolk.",
            "Mix with a fork until the dough becomes stiff, then finish kneading it by hand on a clean surface, adding a bit more water if needed for about 10 minutes. Cover with plastic wrap and refrigerate for 1 to 2 hours.",
            "Divide cannoli dough into three balls; flatten each one just enough to get through the pasta machine. Roll a ball of dough through successively thinner settings until you have reached the thinnest setting. Dust lightly with flour if necessary.",
            "Place the sheet of dough on a lightly floured surface. Using a cutter or large glass, cut out 4 to 5-inch circles.",
            "Dust the circles with a light coating of flour. This will help you later in removing the shells from the tubes. Roll dough around cannoli tubes, sealing the edge with a bit of egg white. Repeat with remaining dough balls.",
            "Heat oil in a deep fryer or deep skillet to 375 degrees F (190 degrees C).",
            "Fry shells on the tubes in hot oil, a few at a time, until golden, about 2 to 3 minutes. Use tongs to turn as needed. Remove shells carefully using tongs, and place them on a cooling rack set over paper towels.",
            "Cool just long enough that you can handle the tubes, then carefully twist the tube to remove the shell. Using a tea towel may help you get a better grip. Wash or wipe off the tubes, and use them for more shells. Cooled shells can be placed in an airtight container and kept for up to 2 months. You should only fill them immediately or up to 1 hour before serving.",
            "Make filling: Mix ricotta cheese and confectioners' sugar together in a large bowl until well combined. Fold in chocolate and lemon zest.",
            "Transfer mixture into a pastry bag and pipe into shells, filling from the center to one end, then doing the same from the other side. Dust with additional confectioners' sugar to serve, if you like."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Desserts",
            "Cookies",
            "Biscotti Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "15 mins",
            "Prep": "15 mins",
            "Cook": "40 mins",
            "Total": "1 hr 10 mins",
            "Servings": "36",
            "Yield": "36 cookies"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "83",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "1g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/17241/biscotti/",
        "recipe_name": "Biscotti",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/m-fuy0MP8TdEv8xoZ5SQLQj2qJY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1151x0:1153x2):format(webp)/8927344-8da7802af20f4d868ea9230a58666ac5.jpg",
        "recipe_ingredients_formatted": [
            "1 cup white sugar",
            "½ cup vegetable oil",
            "3 large eggs",
            "1 tablespoon anise extract, or 3 drops anise oil",
            "3 ¼ cups all-purpose flour",
            "1 tablespoon baking powder"
        ],
        "recipe_directions_formatted": [
            "Homemade biscotti is easier to make than you think! With this top-rated recipe, you can make bakery-worthy biscotti in the comfort of your own kitchen.",
            "Biscotti are Italian almond cookies. They are baked twice, which gives them their signature hard and crunchy texture. Biscotti are traditionally dipping in a drink before eating.",
            "You’ll need just six ingredients to make this biscotti recipe:",
            "You’ll find the full, step-by-step recipe below — but here’s a brief overview of what you can expect when you make homemade biscotti:",
            "In Italy, biscotti are often dipped in wine (such as Vin Santo, a dessert wine). Biscotti also pairs well with a cup of coffee or a cappuccino. Dunk the cookies in your hot drink of choice and enjoy!",
            "Your homemade biscotti will last for up to one month in an airtight container at room temperature. If you want to keep the biscotti longer, you can freeze it for up to three months.",
            "“I didn’t change a thing,” says Gilmour. “This is my basic go-to recipe for biscotti. Sometimes I add different flavors and add chocolate drizzle or a vanilla drizzle, but this basic recipe is the absolute best!”",
            "“Great recipe that was easy to make,” raves Laurahallie. “I substituted almond extract for the anise and used olive oil since I didn’t have any vegetable oil.”",
            "“Perfectly crunchy, just like from a professional,” according to Dana. “Received many compliments. The only change I made was adding a cup of chopped almonds. People asked for the recipe so I will be passing it on.”",
            "Editorial contributions by Corey Williams",
            "Preheat the oven to 375 degrees F (190 degrees C). Grease two cookie sheets or line with parchment paper.",
            "Beat sugar, oil, eggs, and anise extract together in a medium bowl until well-blended. Combine flour and baking powder in a separate bowl; stir into egg mixture to form a heavy dough.",
            "Divide dough into two equal pieces. Form each piece into a log the length of a cookie sheet. Place one log on each of the prepared sheets; and press dough down to 1/2-inch thickness.",
            "Bake in the preheated oven until golden brown, 25 to 30 minutes. Transfer logs to wire racks; let sit until cool enough to handle, about 15 minutes.",
            "Slice each log crosswise into about eighteen 1/2-inch-thick slices. Place slices cut-sides up back on the cookie sheets.",
            "Bake until lightly toasted and golden brown, 6 to 10 minutes per side."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Seafood"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "40 mins",
            "Total": "50 mins",
            "Servings": "13",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "318",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "35g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/12816/cioppino/",
        "recipe_name": "Cioppino",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/HlBK5JisV8xK6s7gJSpe0ye0Tew=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/12816-cioppino-DDMFS-4x3-39531ec5acc749b9a797de26fa0047d5.jpg",
        "recipe_ingredients_formatted": [
            "¾ cup butter",
            "2  onions, chopped",
            "1 bunch fresh parsley, chopped",
            "2 cloves garlic, minced",
            "2 (14.5 ounce) cans stewed tomatoes",
            "2 (14.5 ounce) cans chicken broth",
            "1 ½ cups white wine",
            "1 cup water",
            "2  bay leaves",
            "1 tablespoon dried basil",
            "½ teaspoon dried thyme",
            "½ teaspoon dried oregano",
            "1 ½ pounds cod fillets, cubed",
            "1 ½ pounds large shrimp - peeled and deveined",
            "1 ½ pounds bay scallops",
            "18 small clams",
            "18  mussels, cleaned and debearded",
            "1 ½ cups crabmeat"
        ],
        "recipe_directions_formatted": [
            "Melt butter in a large stockpot over medium-low heat. Add onions, parsley, and garlic. Cook and stir until onions are softened, 3 to 4 minutes.",
            "Add tomatoes to the pot (break them into chunks as you add them). Stir in chicken broth, wine, water, bay leaves, basil, thyme, and oregano. Cover and simmer for 30 minutes.",
            "Stir in cod, shrimp, scallops, clams, mussels, and crabmeat. Bring to boil; lower heat, cover, and simmer until clams open up, 5 to 7 minutes. Ladle soup into bowls and serve.",
            "Enjoy!",
            "Please note the differences in ingredient amounts when using the magazine version of this recipe."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Cuisine",
            "European",
            "Italian",
            "Main Dishes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "1 hr 30 mins",
            "Total": "1 hr 50 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "478",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "47g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/87389/traditional-osso-buco/",
        "recipe_name": "Traditional Osso Buco",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/b1i7zVQ3NUa6nGiVBIeO4FMqhs0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/87389-traditional-osso-buco-Allrecipes-Magazine-4x3-1-9684fe20cd584e28a27d4cdebd3cfc13.jpg",
        "recipe_ingredients_formatted": [
            "2 pounds veal shanks, cut into short lengths",
            "¼ cup all-purpose flour",
            "¼ cup Butter",
            "2 cloves garlic, crushed",
            "1 large onion, chopped",
            "1 large carrot, chopped",
            "⅔ cup dry white wine",
            "⅔ cup beef stock",
            "1 (14.5 ounce) can diced tomatoes",
            "salt and pepper to taste"
        ],
        "recipe_directions_formatted": [
            "Believe it or not, you can make restaurant-worthy osso buco at home — you just need the right recipe. That's where we come in! This traditional osso buco recipe produces flavorful, tender, and absolutely mouthwatering veal shanks every time.",
            "Osso buco is an Italian dish of braised veal shanks, which are cross-cut from the leg bone beneath the knee and shoulder. The shank is a tougher cut of meat, so slow cooking in liquid is essential for the melt-in-your-mouth texture that osso buco is known for.",
            "The dish, a staple of Lombard cuisine, is traditionally garnished with gremolata (a green, herbaceous sauce with lots of bright flavor).",
            "Learn more: What Is Veal?",
            "You'll find the full, step-by-step recipe below — but here's a brief overview of what you can expect when you make this top-rated osso buco:",
            "Lightly dust the veal with flour and melt the butter in a large skillet over medium-high heat. Sear the veal shanks until they're browned on both sides. Remove the veal from the skillet and set aside.",
            "Cook the onions and two cloves of garlic in the skillet until the onions are tender. Return the veal to the skillet, then add the carrots and wine. Simmer for about 10 minutes, then add the remaining osso buco ingredients (tomatoes, stock, and seasonings). Cover and simmer over low heat, basting often, until the meat is tender.",
            "Mix the parsley, remaining garlic, and lemon zest in a small bowl. Drizzle over the osso buco just before serving.",
            "Osso buco is traditionally served over polenta, mashed potatoes, or risotto alla milanese (a risotto made with beef bone marrow, stock, and saffron).",
            "As far as wines go, osso buco pairs perfectly with a full-bodied red such as Chianti or cabernet sauvignon.",
            "Store your leftover osso buco in an airtight container in the fridge for three to four days. Reheat gently in the microwave or in the oven.",
            "Yes, you can freeze cooked veal shanks. Wrap the cooked veal shanks tightly in aluminum foil or place them in an airtight freezer-safe container. Freeze for up to three months. Thaw overnight in the refrigerator.",
            "\"This dish was amazing,\" raves thecornercottage. \"My husband couldn't believe I cooked it! It's actually better than some osso buco we've had at expensive celebrity restaurants.\"",
            "\"Very good, and relatively easy for osso buco,\" according to BETHMCNICK. \"Make sure to add enough salt and pepper. I added it to the meat when I floured it, and also before simmering.\"",
            "\"This recipe was extremely easy to follow and tasted great,\" says MKENYON. \"I followed it to the letter and we all loved it. The meat was super succulent and the sauce was delicious.\"",
            "Editorial contributions by Corey Williams",
            "Gather all ingredients.",
            "Dust the veal shanks lightly with flour.",
            "Melt the butter in a large skillet over medium to medium-high heat. Add the veal, and cook until browned on the outside. Remove to a bowl, and keep warm.",
            "Add two cloves of crushed garlic and onion to the skillet; cook and stir until onion is tender.",
            "Return the veal to the pan and mix in the carrot and wine. Simmer for 10 minutes.",
            "Pour in the tomatoes and beef stock, and season with salt and pepper.",
            "Cover, and simmer over low heat for 1 1/2 hours, basting the veal every 15 minutes or so. The meat should be tender, but not falling off the bone.",
            "In a small bowl, mix together the parsley, 1 clove of garlic and lemon zest. Sprinkle the gremolata over the veal just before serving."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Side Dish",
            "Casseroles",
            "Potato Casserole"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "40 mins",
            "Total": "1 hr",
            "Servings": "8",
            "Yield": "8 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "539",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "20g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/214500/sausage-peppers-onions-and-potato-bake/",
        "recipe_name": "Sausage, Peppers, Onions, and Potato Bake",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/L-cjNypGOL0W5JclT6KGAJZJc4I=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/214500-sausage-peppers-onions-and-potato-bake-DDMFS-4x3-16e08956570d42578c49791529430d08.jpg",
        "recipe_ingredients_formatted": [
            "2 teaspoons olive oil",
            "2 pounds Italian sausage links, cut into 2-inch pieces",
            "¼ cup olive oil",
            "4 large potatoes, peeled and thickly sliced",
            "2 large green bell peppers, seeded and cut into wedges",
            "2 large red bell peppers, seeded and cut into wedges",
            "3 large onions, cut into wedges",
            "½ cup white wine",
            "½ cup chicken stock",
            "1 teaspoon Italian seasoning",
            "salt and freshly ground black pepper to taste"
        ],
        "recipe_directions_formatted": [
            "If you're looking for a comforting meal that is made with ingredients you currently have in the fridge, then you've found the right recipe for you. This recipe with sausage, potatoes, onion, and peppers starts out in the skillet, but turns into a bubbly casserole-like dish after a trip to the oven.",
            "Everyone in your family will love it and you will have found a new go-to recipe that has hearty and filling ingredients — it's a win-win!",
            "The ingredients in this bake are quite simple — and you probably already have most of them on hand. Here's what you'll need:",
            "Olive Oil\nThe olive oil is used for cooking your sausage, potatoes, and veggies in the skillet.",
            "Italian Sausage\nChoose your favorite Italian sausage (mild, medium, or hot will work) for this recipe.",
            "Potatoes\nYou can use whatever potatoes you like, as long as you peel and thinly slice them. But for faster cooking and less chopping, try smaller red potatoes or fingerlings so you can eat them whole.",
            "Bell Peppers\nBoth red and green bell peppers are used in this recipe — and, hey, if you have yellow or orange, throw those in too!",
            "Onions\nYellow onions will work best here for their caramelized flavor.",
            "White Wine\nWhite wine adds flavor to the veggies and sausage. Plus, it keeps the dish moist during baking.",
            "Chicken Stock\nThis recipe uses chicken stock, though you can use any stock you have on hand in a pinch.",
            "Seasonings\nLightly season the sausage and vegetables with Italian seasoning, salt, and pepper.",
            "You'll find the full recipe below, but here's what you can expect when making this recipe:",
            "In a skillet over medium heat, first, you'll brown the Italian sausage. After it's evenly brown, add it to a baking dish.",
            "Then, in the same skillet, cook the potatoes until brown. Add those to the baking dish.",
            "Next, in the same skillet, cook the bell peppers and the onion until they soften. Add them to the baking dish.",
            "Cover the sausage, potatoes, peppers, and onions with white wine, chicken stock, Italian seasoning, salt, and pepper.",
            "Bake the dish until hot and bubbling.",
            "As a main course, this dish already has a lot going on: meat and veggies in a savory sauce. But there's always room for extra sides.",
            "You can serve it alongside coleslaw, potato salad, macaroni and cheese, or even more grilled vegetables.",
            "\"I found this recipe a few years ago, marvelous! I've made it several times, occasionally making small changes depending on what I have on hand. It doesn't matter, it's always delicious. I personally never add the wine, I use additional stock, still delicious,\" says Barbs favorites.",
            "\"Great easy recipe. Would work with any kind of sausage. I used a spicy smoked polish sausage. After browning the sausage, potatoes and vegetables I had a lot of carmelized brown goodness left in the bottom of my skillet. So I deglazed the pan with the wine and chicken stock before pouring the liquid over the ingredients in the baking dish,\" according to Bruce.",
            "\"I loved it. It was so flavorful and easy to make. Even my 5yr old niece who is a notoriously picky eater ate it up quickly. The only change I made was subbing the wine for more chicken broth because I didn't have any wine. I don't know if that made a big difference to the taste, but it was excellent as is,\" raves Samantha Cobb.",
            "Editorial contributions by Bailey Fink",
            "Gather all ingredients.",
            "Preheat oven to 400 degrees F (200 degrees C).",
            "Heat 2 teaspoons olive oil in a large skillet over medium heat, and cook and stir the sausage until browned, 5 to 10 minutes. Transfer cooked sausage to a large baking dish.",
            "Pour 1/4 cup of olive oil into the skillet, and cook potatoes, stirring occasionally, until browned, about 10 minutes.",
            "Place the potatoes into the baking dish, leaving some oil in the skillet.",
            "Cook and stir green and red peppers and onions in the hot skillet until they are beginning to soften, about 5 minutes.",
            "Add the vegetables to the baking dish. Pour wine and chicken stock over the vegetables and sausage, and sprinkle with Italian seasoning, salt, and pepper.",
            "Gently stir sausage, potatoes, and vegetables together.",
            "Bake in the preheated oven until hot and bubbling, 20 to 25 minutes. Serve hot."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Kitchen Tips",
            "All About Ingredients"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/article/types-of-pasta/",
        "recipe_name": "27 Types of Pasta and Their Uses",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/PnYIF5rFsZbjCfcGma9FmahJfxQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/GettyImages-1228681870-2000-eece91bc1bdf4d0aa9fbcf992755cd67.jpg",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "The number of pasta types seems almost infinite. Isn't it amazing that one type of food can take on so many different shapes? Pasta is one of the most versatile pantry staples — simply boil water and dress it up with a little sauce and maybe some protein.",
            "As reliable as pasta is though, we do have a tendency to go for the same types over and over again. Consider this your permission to explore the pastablilities. Some types of pasta make great vehicles for carrying rich and hearty sauces, while others are best suited for soups and salads. Here you'll learn about 27 different types of pasta, along with suggested uses and recipe inspiration.",
            "The long, delicate strands of angel hair pasta (aka capellini) are best served in light or creamy sauces. The thin strands can go M.I.A. in chunky, meaty sauces.",
            "Browse our entire collection of Angel Hair Pasta Recipes.",
            "Use bow tie pasta to dress up any dish that calls for small pasta shapes, such as penne or shells. Also known as farfalle.",
            "Browse our entire collection of Bow Tie Pasta Recipes.",
            "These long, hollow spaghetti-like tubes (aka perciatelli) are unusual and fun! Try them in casseroles or Asian stir-fries, or tossed with a fresh tomato sauce.",
            "Medium-sized, very short tubes with smooth sides. Like most short pasta shapes, ditalini are excellent when used in soups, pasta salads, and to stand up to chunky sauces.",
            "These noodles add heartiness to soups, stews, and casseroles, and their flat shape makes them the ideal vehicle for cream sauces.",
            "Fettuccine is an egg pasta cut into long, narrow ribbons. It is often served with cream sauces, as in the classic Fettuccine Alfredo. You can use fettuccine in any recipe that calls for linguine or spaghetti.",
            "Browse our entire collection of Fettuccine Recipes.",
            "This long, thick, spiral-shaped pasta adds an unexpected twist to any recipe that calls for spaghetti. Its crevices are perfect for carrying thick sauces, but it's often also used in pasta salads.",
            "Browse our entire collection of Fusilli Recipes.",
            "A short, spiral pasta, versatile gemelli works well in hearty sauces, baked dishes, and lighter vegetable pasta dishes.",
            "These chewy little pasta dumplings — traditionally made from potatoes — are usually boiled and served with rich sauces. Tomato-based or herb and butter sauces also work well.",
            "Browse our entire collection of Gnocchi Recipes.",
            "The name for this long, wide noodle is also the name for the dish. Lasagna (the noodle) can be both flat or with curly edges. Lasagna (the dish) is amazing.",
            "Browse our entire collection of Lasagna Recipes.",
            "These long, flat noodles are slightly thicker than spaghetti. The classic Italian restaurant pairing is clam sauce, but you can use this pasta in any dish that calls for spaghetti.",
            "Browse our entire collection of Linguine Recipes.",
            "A small, tube-shaped pasta, macaroni is terrific in creamy casseroles (like macaroni and cheese) or salads (like macaroni salad). Why? Because the creamy sauce flows into the cooked tubes, giving you flavor in every bite.",
            "Browse our entire collection of Macaroni Recipes.",
            "This large tube-shaped pasta is usually filled with cheese or meat filling and baked. The surface of the pasta can be either smooth or ridged.",
            "Browse our entire collection of Manicotti Recipes.",
            "A small bowl-shaped pasta that means \"little ears\" in Italian. It is usually combined with vegetables and oil rather than hearty sauces. The tiny indentations in the pasta catch tasty bits of meat and veggies.",
            "A tiny, rice-shaped pasta that's used to adding heartiness to soups and salads.",
            "Browse our entire collection of Orzo Recipes.",
            "A two-inch long, tube-shaped pasta that is cut diagonally at both ends. Great with chunky meat or vegetable sauces, as bits of the meat or veggies will slide into the pasta tubes. Similar to the smoother mostaccioli, also called Penne Lisce.",
            "Browse our entire collection of Penne Recipes.",
            "Short, squat, ruffled pasta similar to rotini. They look like radiators, hence the name. Like other sturdy pasta shapes, radiatore stand out in hearty sauces or tossed with veggies in a pasta salad.",
            "These little stuffed pillows of pasta dough are packed with finely ground or chopped fillings, from cheese to meat to puréed veggies. Serve ravioli with sauce, in soups, or just drizzled with olive oil.",
            "Browse our entire collection of Ravioli Recipes.",
            "Short, grooved, tube-shaped \"riggies\" can be used in pretty much any setting, from sauces to salads to baked casseroles.",
            "Browse our entire collection of Rigatoni Recipes.",
            "Shaped like wagon wheels — and also sometimes called by that name — these small, round pastas are fun for the kiddos. Use them to liven up goulash or mac and cheese.",
            "Browse our entire collection of Rotelle Recipes.",
            "These kid-friendly pastas look like smooshed corkscrews and are often used for pasta salad since bits of vegetables will cling to the grooves in the rotini.",
            "Shell pasta comes in many different sizes. Stuff large shells with cheese and bake, like you would with manicotti, use medium-sized shells in casseroles and with meat sauces, and use the smallest shells in soups and stews. Also known as conchiglie and cavatelli.",
            "Browse our entire collection of Shell Recipes.",
            "The classic, long, thin, cylindrical tubes you know and love. Spaghetti is just thick enough so it doesn't get lost in that hearty family meat sauce recipe, but thin enough to serve with cream sauce, or even with just a light dressing of olive oil and garlic.",
            "A long, flat, thin noodle, similar to fettuccine. The classical pairing is with meat sauces, but you can use with light sauces as well.",
            "Stuffed rings of pasta you can eat with sauce, put in soup, or just drizzle with olive oil. Sometimes sold in different colors, with the addition of beets, tomatoes, or other dyeing agents.",
            "Browse our entire collection of Tortellini Recipes.",
            "These long strands of pasta are thinner than spaghetti but thicker than angel hair. You can use just as you would either of those. Also known as spaghettini.",
            "Browse our entire collection of Vermicelli Recipes.",
            "A slender, tube-shaped pasta, ziti stands up to hearty sauces and is great in baked pasta dishes.",
            "Browse our entire collection of Ziti Recipes."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Cuisine",
            "European",
            "Italian",
            "Desserts"
        ],
        "recipe_details_formatted": {
            "Additional Time": "4 hrs 20 mins",
            "Prep": "5 mins",
            "Cook": "10 mins",
            "Total": "4 hrs 35 mins",
            "Servings": "6",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "418",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "4g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/72567/panna-cotta/",
        "recipe_name": "Panna Cotta",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/pm7hFGEQSfoytxd5D-_1J0axbQM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1099x1179:1101x1181):format(webp)/5600811-panna-cotta-Erinna1-1x1-1-3dedd99f2271433e816543e374d8be61.jpg",
        "recipe_ingredients_formatted": [
            "⅓ cup skim milk",
            "1 (.25 ounce) envelope unflavored gelatin",
            "2 ½ cups heavy cream",
            "½ cup white sugar",
            "1 ½ teaspoons vanilla extract"
        ],
        "recipe_directions_formatted": [
            "Pour milk into a small bowl. Sprinkle gelatin powder over milk and stir until combined. Set aside.",
            "Stir heavy cream and sugar together in a saucepan. Set over medium heat and bring to a boil; watch carefully as the cream can quickly bubble up and boil over.",
            "Immediately stir gelatin mixture into boiling cream, stirring until completely dissolved. Cook and stir for 1 minute.",
            "Remove the pan from the heat and stir in vanilla.",
            "Pour cream mixture into 6 individual ramekins. Leave to cool, uncovered, until no longer warm, about 20 minutes.",
            "When cool, cover with plastic wrap. Refrigerate until set, at least 4 hours but preferably overnight."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Desserts",
            "Specialty Dessert Recipes",
            "Tiramisu Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "5 hrs",
            "Prep": "30 mins",
            "Cook": "5 mins",
            "Total": "5 hrs 35 mins",
            "Servings": "12",
            "Yield": "1 7x11-inch tiramisu"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "387",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "7g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/21412/tiramisu-ii/",
        "recipe_name": "Tiramisu",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/zU3lJ09TM7fWH82VXtii7f0yIlU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/21412-tiramisu-ii-DDMFS-4x3-cb78d4ad0e75477ebc2a16968c508fde.jpg",
        "recipe_ingredients_formatted": [
            "6 large egg yolks",
            "¾ cup white sugar",
            "⅔ cup milk",
            "1 ¼ cups heavy cream",
            "½ teaspoon vanilla extract",
            "1 pound mascarpone cheese, at room temperature",
            "¼ cup strong brewed coffee, at room temperature",
            "2 tablespoons rum",
            "2 (3 ounce) packages ladyfinger cookies",
            "1 tablespoon unsweetened cocoa powder"
        ],
        "recipe_directions_formatted": [
            "Classic tiramisu, with its irresistible coffee flavor and lightly sweetened mascarpone, will never go out of style. This tiramisu recipe is a no-bake dessert that's sure to impress even the pickiest of eaters.",
            "Tiramisu is a coffee-flavored dessert that features layers of homemade whipped cream, an egg yolk-enriched mascarpone filling, and coffee-soaked ladyfingers.",
            "Tiramisu has Italian origins. The famous Italian restaurateur Ado Campeol is credited with its invention in the 1970s. In fact, he was widely known as \"the father of tiramisu.\" The word \"tiramisu\" translates to \"pick-me-up.\"",
            "Not sure how to pronounce tiramisu? Order in confidence by saying \"tee-ruh-mee-soo.\"",
            "Tiramisu usually contains alcohol. Marsala wine is the traditional choice, but this recipe calls for a mixture of strong coffee and rum. If you prefer not to use alcohol, just leave it out. It will still be delicious with just the coffee alone (just make sure the coffee is extra strong).",
            "Here's what you'll need to make this top-rated tiramisu recipe:",
            "Ready to make the best tiramisu of your life? You'll find the full recipe below, but here's what you can expect when you make this classic tiramisu recipe:",
            "Tiramisu is served chilled, so refrigerate the dessert (as well as any leftovers) immediately. Store in an airtight container in the fridge for up to four days.",
            "Yes, you can absolutely freeze tiramisu. Wrap the tiramisu in a layer of plastic wrap and then a layer of aluminum foil. Freeze for up to three months. Thaw in the fridge overnight.",
            "\"I followed the instructions and I got a delicious tiramisu cake,\" raves giginium. \"I followed the recommendations left by one of the reviewers and left the cake in the fridge for one night before eating it. The rum soaked through the ladyfingers and the flavor was wonderful.\"",
            "\"I live in a rather small town, over an hour drive to a grocery store that sells mascarpone and ladyfingers,\" says Tami. \"So I made the substitute mascarpone (found on this website) and used pound cake cut into ¼-inch slices and it still turned out WONDERFUL!\"",
            "\"This is my absolute favorite, tried-and-true recipe for tiramisu,\" according to Allie Kate Paterson. \"It is better-than-restaurant quality and so easy to make! The hardest part about making it is keeping your hands off of it while it sets in the fridge. The only tweak I make to this recipe is using Kahlua instead of plain rum.\"",
            "Editorial contributions by Corey Williams",
            "Whisk together egg yolks and sugar in a medium saucepan until well blended.",
            "Whisk in milk and cook over medium heat, stirring constantly, until mixture comes to a boil.",
            "Boil gently for 1 minute, then remove from the heat and allow to cool slightly.",
            "Cover tightly and chill in the refrigerator for 1 hour.",
            "Beat cream and vanilla in a medium bowl with an electric mixer until stiff peaks form.",
            "Remove egg yolk mixture from the refrigerator; add mascarpone cheese and whisk until smooth.",
            "Combine coffee and rum in a small bowl. Split ladyfingers in half lengthwise and drizzle with the coffee mixture. Arrange 1/2 of the soaked ladyfingers in the bottom of a 7x11-inch dish.",
            "Spread 1/2 of the mascarpone mixture over the ladyfingers, then spread 1/2 of the whipped cream over top. Repeat layers once more.",
            "Sprinkle cocoa powder over top.",
            "Cover and refrigerate until set, 4 to 6 hours.",
            "Enjoy!"
        ]
    },
    {
        "recipe_tags_formatted": [
            "Meat and Poultry",
            "Chicken",
            "Chicken Breast",
            "Italian-Style Chicken"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "20 mins",
            "Total": "30 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "448",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "29g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/8887/chicken-marsala/",
        "recipe_name": "Chicken Marsala",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/DL9x25UD0yJCPHcOSujAeWLt0Yw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/8887-chicken-marsala-DDMFS-4x3-a0be8776efe74429a586af0ac1d7c1dd.jpg",
        "recipe_ingredients_formatted": [
            "¼ cup all-purpose flour for coating",
            "½ teaspoon salt",
            "¼ teaspoon ground black pepper",
            "½ teaspoon dried oregano",
            "4 medium skinless, boneless chicken breast halves - pounded 1/4 inch thick",
            "4 tablespoons butter",
            "4 tablespoons olive oil",
            "1 cup sliced mushrooms",
            "½ cup Marsala wine",
            "¼ cup cooking sherry"
        ],
        "recipe_directions_formatted": [
            "Chicken Marsala is a classic dish loaded with rich, meaty, and herbaceous flavor. A luscious mushroom wine sauce coats fried chicken breast for an unrivaled taste of Italian-inspired goodness. This mouthwatering recipe transforms common pantry ingredients into a show-stopping meal. Learn how to make the best Chicken Marsala right here.",
            "Chicken Marsala is a succulent dish that features thinly sliced pieces of pan-fried chicken breast and mushrooms in a reduced wine sauce. Its name comes from the fortified Italian wine used to give the dish its trademark deep, nutty, and slightly sweet flavor.",
            "Make a restaurant-quality chicken dish at home in just 30 minutes. You'll find the full recipe below with step-by-step instructions, but here's what you can expect when you make this top-rated recipe:",
            "Begin by coating chicken in a seasoned flour mixture. Cook chicken breast in a large skillet over medium heat until lightly brown. Add mushrooms, wine, and sherry to the mix before covering the skillet and simmering for around 10 minutes.",
            "This family-friendly chicken recipe pairs well with many side dishes. Try a cheesy risotto or Tuscan white beans for a full Italian meal, or opt for classic dinner rolls. Any way you serve it, this decadent Chicken Marsala is sure to be a hit.",
            "If you want to enjoy your delicious leftovers later, pour Chicken Marsala in a freezer pan and save for up to two months. Thaw in the refrigerator, and reheat in an oven preheated to 350 degrees F for best results.",
            "\"This recipe is quick and easy to make,\" shares home cook Craig. \"I added sliced onions and halved plum tomatoes. Served over a bed of white rice. Delicious.\"",
            "\"Our new go-to meal!\" raves reviewer Kelley. \"We could not find Marsala wine so substituted port wine instead - delish! Plus, I added way more mushrooms!\"",
            "\"I removed the chicken from the pan while making the sauce and added a little half and half to it to make it creamy,\" says Jillian. \"It turned out great - this is a definite keeper!\"",
            "Editorial contributions by Rai Mincey",
            "Gather all ingredients.",
            "In a shallow dish or bowl, mix together the flour, salt, pepper and oregano.",
            "Coat chicken pieces in flour mixture.",
            "In a large skillet, melt butter in olive oil over medium heat. Place chicken in the pan, and lightly brown.",
            "Turn over chicken pieces, and add mushrooms. Pour in wine and sherry.",
            "Cover skillet; simmer chicken 10 minutes, turning once, until no longer pink and juices run clear.",
            "Serve hot and enjoy!"
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Side Dish",
            "Vegetables",
            "Asparagus"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "5 mins",
            "Cook": "15 mins",
            "Total": "20 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "188",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "3g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/18318/pan-fried-asparagus/",
        "recipe_name": "Pan-Fried Asparagus",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/99ceC3WsFRY0YM5FLoJyIpx6MnA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/214328-ad0dbeb2fb14481295e83ef4c326c779.jpg",
        "recipe_ingredients_formatted": [
            "¼ cup butter",
            "2 tablespoons olive oil",
            "1 teaspoon coarse salt",
            "¼ teaspoon ground black pepper",
            "3 cloves garlic, minced",
            "1 pound fresh asparagus spears, trimmed"
        ],
        "recipe_directions_formatted": [
            "Making asparagus on the stove couldn’t be easier or more delicious. This pan-fried asparagus recipe will quickly become a mainstay in your side dish rotation.",
            "You'll find a detailed ingredient list and step-by-step instructions in the recipe below, but let's go over the basics:",
            "This pan-fried asparagus is simply seasoned with coarse salt, ground black pepper, and fresh garlic.",
            "Here’s a brief overview of what you can expect when you make this simple stovetop asparagus recipe:",
            "Recipe creator and Allrecipes Allstar Kim suggests serving this pan-fried asparagus recipe with shrimp scampi for a “perfect pairing.” Here are more delicious serving options:",
            "This pan-fried asparagus is best the day it’s cooked. However, if you have leftovers, you can store them in an airtight container in the refrigerator for up to three days.",
            "“This is by far the best asparagus I've ever had,” raves Marie0654. “I added mushrooms just because I love them. I'd share a picture but it didn't last long enough on our plates.”",
            "“I made this to go with Chef John's spaghetti alla carbonara,” says Linda Rheuark Certuche. “It was the perfect side dish. I always made asparagus like this but never considered adding garlic. Yummo!”",
            "“I loved the recipe,” according to Amy. “Very easy and very quick. I like my asparagus a bit less crispy so I covered the pan for two minutes at the end and it came out perfect.”",
            "Editorial contributions by Corey Williams",
            "Melt butter in a skillet over medium-high heat. Add olive oil, salt, and pepper; cook and stir until garlic is fragrant, about 30 seconds.",
            "Add asparagus and cook until fork-tender, turning asparagus often to ensure even cooking, about 10 minutes.",
            "Try serving this as a side to shrimp scampi for a perfect pairing."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Main Dishes",
            "Pasta",
            "Spaghetti"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "15 mins",
            "Total": "25 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "755",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "23g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/222000/spaghetti-aglio-e-olio/",
        "recipe_name": "Spaghetti Aglio e Olio",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/uvcJZBdckZNBemC9RayGOFhmWtI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/8962968_original-Tammy-2000-ce9b060431df4d3cb3b73b760b970bcc.jpg",
        "recipe_ingredients_formatted": [
            "1 pound uncooked spaghetti",
            "½ cup olive oil",
            "6 cloves garlic, thinly sliced",
            "¼ teaspoon red pepper flakes, or to taste",
            "salt and freshly ground black pepper to taste",
            "¼ cup chopped fresh Italian parsley",
            "1 cup finely grated Parmigiano-Reggiano cheese"
        ],
        "recipe_directions_formatted": [
            "Chef John’s spaghetti aglio e olio recipe is pure Italian comfort food.",
            "You likely already have most of the ingredients you’ll need for this spaghetti aglio e olio recipe on hand. Here’s what you’ll need:",
            "You’ll find the full, step-by-step recipe below – but here’s a brief overview of what you can expect when you make homemade spaghetti aglio e olio:",
            "Tip from Chef John : “It's not traditional, but for extra richness add 1 tablespoon of butter when you toss with the cheese.”",
            "For serving inspiration, explore our collection of 16 of the Best Side Dishes to Pair With Your Spaghetti Dinner. Here are a few of the top-rated recipes you’ll find:",
            "Store your leftover spaghetti aglio e olio in an airtight container in the refrigerator for up to three days. Add a splash of water, then reheat in the microwave or on the stove.",
            "“Very good and easy to make,” raves Rock Doc. “I tripled the red pepper amount, but then I like food a little spicier than most folks.”",
            "“Easy to make and very flavorful,” according to dadonwing. “I let it sit for a few minutes before serving it and toss it several times as well.”",
            "“Added mushrooms, spinach and a few pieces of Gouda tomato basil cheese,” says Samantha.  “It was delicious.”",
            "Editorial contributions by Corey Williams",
            "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 10 to 12 minutes. Drain and transfer to a pasta bowl.",
            "While the pasta is cooking, combine olive oil and garlic in a cold skillet. Cook over medium heat to slowly toast garlic, about 10 minutes. Reduce heat to medium-low when olive oil begins to bubble. Cook and stir until garlic is golden brown, about another 5 minutes. Remove from heat.",
            "Stir red pepper flakes, salt, and black pepper into pasta. Pour in hot olive oil and garlic, and sprinkle on Italian parsley and half of the Parmigiano-Reggiano cheese; toss until combined.",
            "Serve pasta topped with the remaining Parmigiano-Reggiano cheese.",
            "It's not traditional, but for extra richness add 1 tablespoon of butter when you toss with the cheese."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Appetizers and Snacks",
            "Bruschetta Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "5 mins",
            "Total": "20 mins",
            "Servings": "8",
            "Yield": "8 bruschetta"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "197",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "8g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/54165/balsamic-bruschetta/",
        "recipe_name": "Balsamic Bruschetta",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/JZypAo93wyHw3DHTRFBCJwyyHKk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/54165-balsamic-bruschetta-DDMFS-4x3-e2b55b5ca39b4c1783e524a2461634ea.jpg",
        "recipe_ingredients_formatted": [
            "1 loaf French bread, cut into 1/4-inch slices",
            "1 tablespoon extra-virgin olive oil",
            "8  roma (plum) tomatoes, diced",
            "⅓ cup chopped fresh basil",
            "1 ounce Parmesan cheese, freshly grated",
            "2 cloves garlic, minced",
            "1 tablespoon good quality balsamic vinegar",
            "2 teaspoons extra-virgin olive oil",
            "¼ teaspoon kosher salt",
            "¼ teaspoon freshly ground black pepper"
        ],
        "recipe_directions_formatted": [
            "This top-rated bruschetta recipe proves that summertime gives you perfectly ripe and juicy tomatoes, one of the best ways to enjoy them is also one of the easiest.",
            "Bruschetta (pronounced brew-SKET-tah) is an Italian appetizer or antipasti that starts with a base of toasted or grilled bread. The bread is then served warm either with a topping spooned over or with a topping on the side so each person can build their own bruschetta. Bruschetta is meant to be served as a hand-held finger food, large enough for one or two bites.",
            "You'll find a detailed ingredient list and step-by-step instructions in the recipe below, but let's go over the basics:",
            "The best bread for bruschetta has a sturdy crust and is firm enough to hold the bruschetta topping. Choose a loaf of Italian bread, such as ciabatta, for a more traditional bruschetta. This recipe uses slices of French bread, like a baguette. Slice the bread on the diagonal at least ¼-inch thick or more to make an oval shape.",
            "You'll find the full, step-by-step recipe below — but here are a few of our favorite tips for making the best bruschetta every time:",
            "· Quality counts: The beauty of a simple recipe like bruschetta is that it showcases the flavor of the individual ingredients. For this recipe, you can really taste the difference when you use ripe tomatoes and fresh (not dried) basil; the best olive oil and balsamic vinegar you can afford, and hand-grated Parmesan cheese instead of pre-packaged grated cheese.\n· Add flavor with garlic: As an alternative to adding minced raw garlic to the tomato mixture, cut a peeled clove of garlic in half lengthwise and lightly rub the cut side over the slightly roughened surface of the toasted bread to impart a hint of garlic flavor. Rub on a little more garlic for a stronger flavor, if you wish. But watch out: A little garlic goes a long way.\n· Be patient: Make the tomato mixture and let it sit for a couple of hours so the flavors can develop more complexity. Yes, the tomatoes may give off a lot of juice as they marinate, but if you think the mixture is too juicy come serving time, simply use a slotted spoon to lift out the bruschetta topping as you spoon it over the bread. Don't toss the liquid, though — lots of people love to dip into it with extra bread. If you're going to top the bread first before serving, save that step until the last minute so the bread doesn't get soggy as it sits.",
            "Make it a meal by serving this classic Italian appetizer with our collection of Quick and Easy Italian Dinners Ready in 45 Minutes or Less. Here's a preview of what you'll find:",
            "· Italian Sausage, Peppers, and Onions\n· Shrimp Scampi with Pasta\n· Crispy Baked Chicken with Giardiniera",
            "\"I made this for a bridal shower and it was a hit,\" says libs. \"I prepared the tomato mix the night before and toasted the bread about 15 minutes before the party started. I liked the cold mix on the warm bread. I also appreciated that this could be prepared the day before!\"",
            "\"Excellent,\" raves MELSY. \"Served on top of toasted whole wheat baguette slices that were brushed with olive oil and garlic. I also added a little extra basil as I love the flavor. Have also served this on top of slices of fresh mozzarella cheese...equally as good!\"",
            "\"I used two 14-ounce cans of diced tomatoes instead of 8 Roma tomatoes,\" according to blue eyed CC. \"Added about 1/4 cup of chopped red onion, too. Everyone loved it. No one could believe that I used canned tomatoes either!\"",
            "Editorial contributions by Vanessa Greaves and Corey Williams",
            "Gather all ingredients.",
            "Preheat oven to 400 degrees F (200 degrees C).",
            "Brush bread slices on both sides lightly with 1 tablespoon oil and place on large baking sheet. Toast bread until golden, 5 to 10 minutes, turning halfway through.",
            "Meanwhile, toss together tomatoes, basil, Parmesan cheese, and garlic in a bowl.",
            "Mix in balsamic vinegar, 2 teaspoons olive oil, kosher salt, and pepper.",
            "Spoon tomato mixture onto toasted bread slices.",
            "Serve immediately and enjoy!"
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Main Dishes",
            "Rice",
            "Risotto Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "20 mins",
            "Total": "30 mins",
            "Servings": "6",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "249",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "5g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/8495586/parmesan-risotto/",
        "recipe_name": "Parmesan Risotto",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/l4P9sBBomnXC_NO7RpJeGTUYJB0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(952x0:954x2):format(webp)/Parmesan-Risotto-1x1-1-d87876d391094fcfb74a2d16603671fe.jpg",
        "recipe_ingredients_formatted": [
            "1 ½ tablespoons olive oil",
            "1 ½ tablespoons butter",
            "1  shallot, minced",
            "1 clove garlic, minced",
            "1 cup Arborio rice",
            "½ cup dry white wine",
            "3 cups hot vegetable stock",
            "⅓ cup freshly grated Parmesan cheese",
            "2 tablespoons minced fresh parsley",
            "salt to taste",
            "freshly ground white pepper to taste"
        ],
        "recipe_directions_formatted": [
            "Heat olive oil and butter in a large sauté pan over medium-high heat until butter is melted. Reduce heat to medium-low and add shallot and garlic. cook and stir until shallots are translucent but not brown, about 5 minutes.",
            "Pour in rice and stir until the rice is coated in oil and has started to toast, about 5 minutes. Pour in wine and let it simmer until it has mostly evaporated, then stir in one-third of the boiling vegetable broth ; continue stirring until the rice has absorbed the liquid and turned creamy. Repeat this process twice more, stirring constantly. Stirring in the broth should take 15 to 20 minutes in all. When finished, the rice should be tender yet firm to the bite. You may not need all the vegetable stock.",
            "Remove from heat. Stir in Parmesan cheese, parsley, salt, and white pepper until well combined. Serve immediately."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Kitchen Tips",
            "All About Ingredients"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/article/what-is-guanciale/",
        "recipe_name": "What Is Guanciale?",
        "recipe_img_url-src": "None",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "A key ingredient in many classic Italian pasta dishes, guanciale might be the solution to unlocking a new level of flavor when it comes to your Italian cooking. The fatty cured meat can be challenging to find, but seeking it out is worth the effort. Keep reading to learn more about this Italian favorite.",
            "Guanciale is a pork product made from a pig's cheek. The name guanciale comes from the Italian word for cheek, guancia. Guanciale is super fatty and usually cured with salt, sugar, and spices. It can be bought raw but in most cases, it is sold cured. Usually, guanciale is cut into matchsticks or into thin strips and the fat is rendered, much like bacon. Often the guanciale fat is as important as the guanciale itself – in pasta sauces and salad dressing, it infuses the entire dish with richness and the saltiness from the pork.",
            "Guanciale is used most in the cooking of Lazio, the region of Italy that is home to Rome. Typical Roman pastas like carbonara, amatriciana, gricia all depend on the intensity and fattiness of guanciale. It's also often used on pizzas, in salads, and in a range of other dishes.",
            "Guanciale is salty, with a lot of richness from the fat, as well as distinct meatiness. If you like bacon, you're likely to also enjoy guanciale, though it is saltier than bacon. Unlike bacon, guanciale isn't typically smoked.",
            "The biggest difference between guanciale and pancetta is the part of the pig that they come from. While guanciale comes from the cheek of the pig, pancetta is made from the belly, much like bacon. Both pancetta and guanciale are sold cubed, but they are made in different forms. Guanciale is an oblong shape, usually the whole muscle of the cheek, while pancetta is often rolled.",
            "Guanciale is different from bacon in that it is made from pork cheek, not from pork belly. Guanciale is also unsmoked, whereas bacon is generally prized for its smokiness. The other major difference is the intensity of salt: while bacon is salty, it's delicious for eating straight. Guanciale is less appropriate for snacking because of the intensity of the salt levels.",
            "After it's been cut, the guanciale will last seven to ten days. Whole and well-wrapped in plastic wrap, it will last up to three weeks. For longer storage, it's best to tightly wrap the guanciale and freeze it. The fat that is rendered from the pork, which is great for all kinds of cooking, will last several months longer if stored in the refrigerator.",
            "Guanciale is a great way to add just a touch of richness and meatiness to any recipe. Here are a couple of classic dishes that lean on this savory ingredient",
            "This traditional carbonara recipe was created in the Lazio region (the area around Rome) in the middle of the 20th century, after World War II. It utilizes guanciale, eggs, Pecorino Romano cheese, and lots of black pepper to create the signature flavor.",
            "\"Five stars but 14 thumbs up over here,\" says Allrecipes user Buckwheat Queen. \"I doubled it because I had a house full of hungry people. It was perfect. Grazie Enzo e Kim, Bravissimi!\""
        ]
    },
    {
        "recipe_tags_formatted": [
            "Kitchen Tips",
            "All About Ingredients"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/article/what-is-mortadella/",
        "recipe_name": "What Is Mortadella?",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/9JE8h1o6_0Gk_km2WownvOf_6B4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(959x0:961x2):format(webp)/mortadellaonbread1x1-2a52af9c385147c880dd76b1a6f8689e.jpg",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "Mortadella is often compared to bologna, but true lovers of Italian charcuterie know that its depth of flavor and texture are distinct from the classic American sandwich standard. Whether draping it over a pizza, tossing cubed pieces into a salad, or stacking it high on a sandwich or panino, mortadella can offer meat lovers a new treat to fall for. Read on to learn about the origins of mortadella, how it's different from bologna, and what to do with it.",
            "Mortadella is a type of emulsified sausage made with pork meat, fat, pistachios, and black pepper. Emulsification, in this case, refers to a process of grinding high-quality, cooked pork extremely into a fine, silky texture. The sausage is then mixed with pieces of pork fat, toasted pistachios, and black pepper before it is set inside the casing.",
            "When sliced, mortadella has a kind of marbled look. Mortadella originated in Bologna, Italy, and some of the highest quality mortadella still come from the city and the surrounding region of Emilia Romagna, which is also known for the production of Parmigiano Reggiano cheese and Lambrusco wine.",
            "Mortadella is luscious and rich but also incredibly well-balanced. Because the meat is emulsified, when sliced thinly it's incredibly delicate as well, so it doesn't taste overwhelming or leave an unpleasant texture on the palate. The black peppercorns and pistachios offer a wonderfully unique texture that makes the experience of snacking on mortadella totally addictive.",
            "The American lunch meat we know as bologna is derived from Italian mortadella, but if you don't like bologna, don't give up on mortadella just yet. Italian mortadella, especially the kind made in the region of Emilia-Romagna, is made with high-quality, pork from well-cared-for pigs. Bologna, on the other hand, is often made from a blend of meats, including beef and pork.",
            "Italian mortadella is usually made from the pig's cheek and back, whereas bologna is made from the leftover meat from a processed pig's skeleton. The name bologna actually comes from the Italian city of Bologna, where mortadella is made.",
            "Some grocery store deli counters will carry mortadella. If yours doesn't, seek it out at any specialty Italian grocery store or sandwich shop, or find it online.",
            "Once thinly sliced for sandwiches or charcuterie boards, mortadella will dry out but can be kept tightly wrapped in the refrigerator for up to a week. Thicker pieces will last about the same amount of time or can be frozen for longer storage."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Kitchen Tips",
            "All About Ingredients"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/article/what-is-prosciutto/",
        "recipe_name": "What Is Prosciutto?",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/Jzf3XP_mcgWVmx9VjudVo-SuJcE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/what-is-prosciutto-6c23ad1e0ef24b7f8979600a442e8c74.jpg",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "Whether it's wrapped around slender stalks of asparagus, draped over juicy slices of melon, delicately placed on flatbreads, or lovingly piled on charcuterie boards, the near impossibly thin ham known as prosciutto is everywhere. With its pink hues, heavenly texture, and culinary versatility (no cooking required!), there's no wonder why this Italian specialty is popular around the world.",
            "Prosciutto translated from Italian is \"ham.\" Specifically, it's a thinly sliced, dry cured ham, the technique for which is a time-honored, regionally specific Italian custom.This prized ham's origins date to pre-Roman times, when winters were long, and the villagers took to dry-aging their pork legs to extend their meat supply. Since then, the tradition has been perfected century after century, resulting in the celebrated and delicious art it is today.",
            "First, high-quality pork legs are covered in salt and rested in a cool, dry place for weeks to concentrate the flavor. Next, the legs are hung in a cool, humid room for 2-3 months. Finally, they are washed, seasoned by hand (according to family recipe), and dry-aged for 14-36 months at a controlled temperature. Production varies by region and producer.",
            "The delicately sweet signature flavor of prosciutto is a direct result of the combination of salt, air, and time. Depending on the region it's produced, it can have an almost fruity flavor profile, or it may be earthier and slightly gamey. As with other aged products, the longer the time, the more complex it will taste, though prosciutto will always have a beautiful subtlety to it.",
            "Each piece is streaked with luxurious fat and can range in color from salmon pink to brownish-red to orangey, when aged at length. Over time, prosciutto becomes firmer, dryer, and darker. These fine slices are perfectly savory with an enjoyable buttery slickness. Just placing a piece on your tongue will melt the fat and morph it into a creamy texture coating your palate in salty, yet subtly sweet yumminess.",
            "The Italian certification DOP (Denominazioned' Origine Protetta), roughly translated to \"protected designation of origin\" was created to protect names of regions and their agricultural products and can be a useful tool in spotting differences.",
            "Prosciutto crudo",
            "Prosciutto crudo is the general term for raw cured ham. Chances are, unless specified as cotto (which is cooked), prosciutto on a menu or in a description is referring to crudo.",
            "Prosciutto di Parma",
            "DOP signifies that the ham's entire salting to aging process took place in the Parma province (the air and climate both having a unique effect on the meat's flavor), and that the meat is from a carefully selected heritage breed pig. If Parma sounds familiar, it's because it's the same region that Parmesan comes from.",
            "Prosciutto di San Daniele",
            "This DOP is made entirely in the Friuli Venezia region, the higher altitudes and different climate meaning a darker and sweeter flavor. With Prosciutto di San Danielle, the ham undergoes a pressing after salting, flattening the ham and encouraging salt penetration, resulting in a recognizable guitar shape.",
            "Yes! Prosciutto is sliced and served raw with the intent that it is consumed that way. The salt used in the preparation draws out blood and moisture, preventing bacteria from entering the meat – making it safe to eat as is. In fact, cooking it is generally frowned upon. Most people (especially Italians) feel that a such an artisan product should be enjoyed exactly how it is — perhaps complimented simply by items like melon, fresh figs, toasted bread, or Parmigiano-Reggiano.",
            "Prosciutto needs no alteration to be completely delicious, but it's also perfect as part of a lovely charcuterie spread, paired with fruit, cheese, vegetables, bread, and preserves. Prosciutto with a shorter age time can be stirred into pasta or placed on pizza. Longer-aged varieties should be enjoyed on their own to appreciate the deeper, more complex flavor.",
            "Though cooking it isn't the best way to go, chopping up the ends that can't be sliced and cooking them into soups or stews to enhance the flavor is a great idea. And, as a bonus, these ends are usually available on the cheap from any place that slices its own prosciutto.",
            "Once sliced, the ham begins to oxidize and lose its flavor. Try to enjoy it immediately after purchasing or opening. Whole legs, on the other hand, last up to 6 months in cool, dry places."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Everyday Cooking",
            "More Meal Ideas",
            "30-Minute Meal Recipes",
            "Pasta"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "None",
            "Cook": "20 mins",
            "Total": "30 mins",
            "Servings": "6",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "647",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "18g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/8513545/penne-alla-vodka/",
        "recipe_name": "Penne alla Vodka",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/gozgTy0ACjZazVQ2sFLeugiiX04=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/ALR-8513545-penne-alla-vodka-VAT-hero-4x3-2-4a53c968c3d94a32816f01f5793702ce.jpg",
        "recipe_ingredients_formatted": [
            "1 (28 ounce) can whole peeled tomatoes (preferably San Marzano)",
            "2 tablespoons olive oil",
            "3 ounces pancetta, diced",
            "½ cup finely chopped onion",
            "2 cloves garlic, finely minced",
            "¼ teaspoon crushed red pepper, or more to taste",
            "1 teaspoon kosher salt, plus more to taste",
            "3 tablespoons tomato paste",
            "⅔ cup vodka",
            "1 pound rigatoni or penne pasta",
            "1 cup heavy cream",
            "¼ teaspoon pepper, plus more to taste",
            "⅔ cup freshly grated Parmesan cheese",
            "2 tablespoons finely chopped parsley",
            "3 tablespoons chopped fresh basil"
        ],
        "recipe_directions_formatted": [
            "This penne alla vodka recipe is quick, easy, and incredibly delicious. It's the perfect impressive weeknight dinner!",
            "You'll find a detailed ingredient list and step-by-step instructions in the recipe below, but let's go over the basics:",
            "These are the ingredients you'll need to make this penne alla vodka recipe;",
            "· Tomato products: This pasta alla vodka calls for both a can of whole peeled tomatoes and a couple tablespoons of tomato paste.\n· Pancetta and oil: Cook pancetta in olive oil.\n· Onion: You'll need ½ cup of finely diced onion.\n· Seasonings and herbs: This flavorful penne alla vodka is seasoned with garlic, crushed red pepper, salt, pepper, fresh parsley, and fresh basil.\n· Vodka: Of course, you'll need vodka – use whatever brand you have on hand.\n· Pasta: Opt for penne or rigatoni.\n· Cream: Heavy cream is the key to a rich, decadent vodka sauce.\n· Cheese: Make sure to use freshly grated Parmesan cheese instead of the pre-shredded stuff.",
            "Here are some tips and tricks for making the perfect pasta alla vodka from the chef herself:",
            "· You can skip the pancetta if you want to make this a meatless meal, according to culinary producer and recipe creator Nicole McLaughlin (a.k.a. NicoleMcmom). But, if you want to go in the opposite direction, Italian sausage would also work well.\n· Don't skip the tomato paste! It adds a deep, rich flavor that makes this penne alla vodka impossible to resist. Make sure to cook it until it takes on a brownish color.\n· Nicole uses whole canned and peeled tomatoes because she finds they have better flavor than pre-crushed tomatoes. She also crushes them with her hands the old-fashioned way!",
            "In need of serving inspiration? Try pairing your homemade penne alla vodka with one of these top-rated side dishes:",
            "· Classic Restaurant Caesar Salad\n· Toasted Garlic Bread\n· Roasted Garlic Lemon Broccoli\n· Italian Leafy Green Salad\n· Prosciutto-Wrapped Asparagus",
            "Store your leftover penne alla vodka in a shallow, airtight container in the refrigerator for up to four days. We don't recommend freezing this dish, as the pasta will become mushy.",
            "Editorial contributions by Corey Williams",
            "Gather all ingredients.",
            "Place a large pot of salted water over high heat to bring to a boil. Pour tomatoes in a medium bowl and crush well with hands or chop in a food processor. Set aside.",
            "While water heats, prepare the sauce. In a large saucepan or deep skillet, heat oil and pancetta over medium-high heat. Cook, stirring frequently until pancetta is crisp, about 5 minutes. Add onion and cook, stirring constantly, until translucent, about 3 minutes. Add garlic and crushed red pepper and cook for 1 minute. Add tomato paste and cook, stirring often, until the tomato paste has taken on a slight brownish color, 2 to 3 minutes. Add vodka and cook until reduced by at least half. Stir in reserved tomatoes and juices and bring mixture to a simmer. Reduce heat and simmer until thickened, about 10 minutes.",
            "While sauce reduces, add pasta to boiling water and cook, according to package directions until al dente, 11 to 12 minutes.",
            "Once sauce is reduced, stir in heavy cream and pepper and cook for 3 minutes, stirring often. Stir in 1/3 cup cheese, parsley, basil and pasta until well combined. Season with additional salt and pepper if desired.",
            "Sprinkle with remaining cheese and more herbs if desired.",
            "Serve and enjoy."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Main Dishes",
            "Rice",
            "Risotto Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "9 mins",
            "Cook": "35 mins",
            "Total": "44 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "357",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "11g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/228824/lemon-asparagus-risotto/",
        "recipe_name": "Lemon Asparagus Risotto",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/Of9G0zZOIOiSaF_oSL418XvJloY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(2015x0:2017x2):format(webp)/9342335-6b161e4324ae4f6a8f6d603d2d78c924.jpg",
        "recipe_ingredients_formatted": [
            "20  fresh asparagus spears, trimmed",
            "4 cups low-sodium chicken broth",
            "2 tablespoons olive oil",
            "1 small onion, diced",
            "1 stalk celery, diced",
            "¼ teaspoon salt",
            "¼ teaspoon ground black pepper",
            "1 cup Arborio rice",
            "1 clove garlic, minced",
            "½ cup dry white wine",
            "¼ cup freshly grated Parmesan cheese",
            "2 tablespoons lemon juice",
            "½ teaspoon lemon zest"
        ],
        "recipe_directions_formatted": [
            "This lemon asparagus risotto recipe is bright, flavorful, and perfect for springtime.",
            "These are the ingredients you’ll need to make this lemon asparagus risotto recipe at home:",
            "You’ll find the full, step-by-step recipe below – but here’s a brief overview of what you can expect when you make asparagus risotto at home:",
            "If you’d like, you can cook the asparagus in the oven instead of steaming it on the stove. Preheat the oven to 350 degrees F (175 degrees C). Place asparagus on a baking sheet. Drizzle with 1 tablespoon of olive oil; season with salt and ground black pepper. Roast in the preheated oven until just tender, about 15 minutes.",
            "Store your leftover risotto in an airtight container in the refrigerator for up to three days. Reheat it gently in the microwave or in the oven.",
            "While you can freeze asparagus risotto for up to three months, we don’t recommend it. The texture will change during the freezing and thawing process, so it won’t be quite as good as when it was freshly made.",
            "“This recipe is a keeper,” according to sdelyannis. “It paired nicely with a rack of lamb.”",
            "“Loved this,” says TO-Mum. “Creamy texture. Lemon makes a nice addition. I pan-seared a couple of scallops and served them on the side.”",
            "“This was fantastic and easy to make,” raves Momma Clo. “I used water and a little extra wine instead of the broth (didn't have any) and it was very good! Will surely make it again. Served with some lemon dill cod.”",
            "Editorial contributions by Corey Williams",
            "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add asparagus, cover, and steam until tender, about 5 minutes. Cut asparagus into 1-inch pieces; set aside.",
            "Meanwhile, heat chicken broth in a saucepan over medium heat; keep at a simmer while preparing risotto.",
            "Heat olive oil in a large skillet over medium heat. Add onion and celery; cook and stir until vegetables are tender, about 5 minutes. Season with salt and black pepper. Stir in Arborio rice and garlic; cook and stir until rice is lightly toasted, about 5 more minutes.",
            "Stir in white wine and simmer until it has mostly evaporated, then stir in 1/3 of the hot chicken broth; continue stirring until rice has absorbed liquid and turned creamy. Repeat this process twice more, stirring constantly. Stirring in the broth should take 15 to 20 minutes in all. When finished, rice should be tender yet firm to the bite. Stir in asparagus.",
            "Remove from heat and mix in Parmesan cheese, lemon juice, and lemon zest. Serve immediately."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Main Dishes",
            "Pasta",
            "Pesto Pasta Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "15 mins",
            "Total": "35 mins",
            "Servings": "8",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "312",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "9g"
        },
        "recipe_card-href": "https://www.allrecipes.com/pasta-alla-trapanese-sicilian-tomato-pesto-recipe-7571415",
        "recipe_name": "Pasta alla Trapanese (Sicilian Tomato Pesto)",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/HSH2CGgBha1V7zNhc2elAupE5uA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/7571415_Pasta-alla-Trapanese_Chef-John_4x3-9d9541bc16bf4beda4e634e99780d01d.jpg",
        "recipe_ingredients_formatted": [
            "1/2 cup whole roasted almonds",
            "4 cloves garlic",
            "1 teaspoon kosher salt, plus more to taste",
            "1 cup grated pecorino Romano cheese, plus more to taste",
            "1 cup packed fresh basil leaves",
            "4 mint leaves (optional)",
            "1/2 cup extra virgin olive oil",
            "1 pound red cherry tomatoes or red grape tomatoes",
            "1 pound busiate pasta, or other curly shaped pasta, such as fusilli"
        ],
        "recipe_directions_formatted": [
            "Whenever we visit my wife, Michele’s, parents, my father-in-law, Al, always passes along a few local, Sacramento area magazines he’s saved for us. They’re usually recipes or food articles he thinks I may be interested in. In fact, sometimes he’ll do something people almost never do these days: He’ll actually walk to the post office and mail us the piece to read. Yes, just like before the Internet.",
            "We had lunch recently and he passed along a magazine with a feature on heirloom tomatoes. I read and enjoyed the article, but only skimmed the serving suggestions that were interspersed throughout. Luckily, Michele was paying much closer attention, and pointed out a picture of Pasta alla Trapanese, a dish I hadn’t yet posted on the channel.",
            "I started experimenting with Italy’s “other” pesto sauce, and I’m very excited to be sharing it with you. Here are some notes:",
            "No matter what you use, I love this easy, “raw” sauce, and really do hope you give it a try soon. Enjoy!",
            "More recipes: Try the latest and greatest recipes from Chef John!",
            "Bring about 2 cups of water to a boil, remove from the heat, and stir in almonds; let sit for 3 to 4 minutes. Drain, and once cool enough to handle, rub skins off with your hands; alternately; transfer drained almonds to a kitchen towel, then fold up the towel and rub almonds until skins come off.",
            "Crush sliced garlic with kosher salt in a mortar and pestle into a smooth paste. Alternately, place garlic on a board and sprinkle kosher salt on top; use the flat side of the knife to flatten, mash, and scrape the garlic and salt mixture until it is a smooth paste.",
            "Add peeled almonds to the jar of a blender, followed by the cheese, basil, mint, garlic paste, oil, and tomatoes. Add the ingredients in this order, so that the almonds and cheese have a chance to grind before the wetter ingredients mix in.",
            "Begin to pulse blender on and off until almonds and cheese are ground, then continue to pulse until remaining ingredients are incorporated. Blend on high until the pesto is as coarse or smooth as you like.",
            "Taste for salt, and adjust. Set aside while pasta is cooking.",
            "Bring a large pot of lightly salted water to a boil. Cook busiate pasta in the boiling water, stirring occasionally, until tender yet firm to the bite, about 12 minutes. Transfer pasta into a bowl with a strainer. Reserve starchy cooking liquid.",
            "Add about 1/3 cup of the pasta water into the bowl, and then transfer in the pesto, along with a large pinch of salt, and toss to coat. More pasta water can be added to adjust the texture. Once mixed, add another optional handful of cheese, and toss one last time. Serve immediately."
        ]
    }
]