[
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "Asian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "3 hrs 15 mins",
            "Prep": "15 mins",
            "Cook": "35 mins",
            "Total": "4 hrs 5 mins",
            "Servings": "6",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "220",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "5g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/260763/ube-panna-cotta/",
        "recipe_name": "Ube Panna Cotta",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/pg3JiBZIWgf9emv5j4EOPeu_BQ4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(959x0:961x2):format(webp)/4918383-f27ea976388341318cc9c8761c877b20.jpg",
        "recipe_ingredients_formatted": [
            "1  ube (purple yam), peeled",
            "1 ½ cups whole milk, divided",
            "1 cup coconut milk",
            "½ cup white sugar",
            "1 (.25 ounce) package unflavored gelatin"
        ],
        "recipe_directions_formatted": [
            "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add ube, cover, and steam until tender, about 20 minutes. Cool until easily handled, about 10 minutes. Purée ube in a blender or food processor, or thoroughly mash it by hand.",
            "Combine 1 cup puréed ube, 3/4 cup whole milk, coconut milk, and sugar in a blender or food processor; blend until completely smooth.",
            "Pour remaining 3/4 cup whole milk into a saucepan. Sprinkle gelatin on top and let stand for 5 minutes.",
            "Heat milk-gelatin mixture over medium-low heat, stirring until gelatin is dissolved, 3 to 5 minutes. Pour in ube mixture and increase the heat to medium. Heat until steam starts to rise from the mixture, stirring occasionally, 3 to 5 minutes.",
            "Pour mixture into individual serving glasses or molds. Transfer to the refrigerator and chill until set, about 3 hours."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Desserts",
            "Cakes",
            "Cheesecake Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "4 hrs 30 mins",
            "Prep": "35 mins",
            "Cook": "1 hr 55 mins",
            "Total": "7 hrs",
            "Servings": "12",
            "Yield": "1 9-inch cheesecake"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "480",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "10g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/282825/cannoli-cheesecake/",
        "recipe_name": "Cannoli Cheesecake",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/OYeNRWiS0_9K5D3DQ0D_5cQSpU8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(755x0:757x2):format(webp)/8924623-2c1989dfbe5f4d5ab9f33f773db47500.jpg",
        "recipe_ingredients_formatted": [
            "cooking spray",
            "2 ¼ cups graham cracker crumbs",
            "½ cup unsalted butter, melted",
            "3 tablespoons white sugar",
            "¼ teaspoon ground cinnamon"
        ],
        "recipe_directions_formatted": [
            "Make the crust: Preheat the oven to 325 degrees F (165 degrees C). Line a 9-inch springform pan with parchment paper and lightly spray paper and sides of the pan with cooking spray.",
            "Stir graham cracker crumbs, melted butter, sugar, and cinnamon together in a medium bowl until well combined. Press mixture firmly into the bottom and sides of the prepared pan.",
            "Bake in the preheated oven until lightly toasted and firm, about 10 minutes. Remove from the oven and reduce the oven temperature to 300 degrees F (150 degrees C).",
            "Let crust cool to room temperature, about 30 minutes, then wrap the outsides of the pan tightly with aluminum foil.",
            "Make the filling: Beat ricotta, mascarpone, sugar, and flour together in a stand mixer fitted with a paddle attachment on low speed until smooth, scraping down the sides with a spatula as needed. Mix in vanilla, cinnamon, and lemon zest on low speed until combined, about 30 seconds. Add eggs, one at a time, beating on low speed until well combined.",
            "Pour batter into the prepared crust. Place the springform pan in a large baking dish, then carefully fill the baking dish halfway with water.",
            "Bake in the preheated oven until the edges are set and the center jiggles slightly, 1 hour 45 minutes to 2 hours. Turn the oven off, crack the door open slightly, and let cheesecake cool slowly, about 1 hour. Remove from the oven; transfer the springform pan to a wire rack and remove the foil.",
            "Chill cheesecake, uncovered, in the refrigerator until completely firm, at least 4 hours, then carefully remove the springform pan.",
            "Make the topping: Beat cream, powdered sugar, and vanilla together in a stand mixer fitted with a whisk attachment on medium-low speed until well combined, about 1 minute. Continue beating on high speed until stiff peaks develop, about 1 minute.",
            "Spread topping over cheesecake, then sprinkle with chocolate chips.",
            "Turning the oven off and cracking the door open while the cheesecake is still in the oven helps prevent the top from cracking. Even the top will be covered with the whipped topping, it's a great technique that can be applied to other cheesecakes as well."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Desserts",
            "Cookies",
            "International Cookie Recipes",
            "Italy"
        ],
        "recipe_details_formatted": {
            "Additional Time": "35 mins",
            "Prep": "15 mins",
            "Cook": "15 mins",
            "Total": "1 hr 5 mins",
            "Servings": "40",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "128",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "2g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/240649/italian-anise-cookies/",
        "recipe_name": "Italian Anise Cookies",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/lyYZXMAypXSgR4LVrsqMtUbldKQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1511x0:1513x2):format(webp)/7438391-62b4c8394cad4cd89ec371df9abe6e24.jpg",
        "recipe_ingredients_formatted": [
            "4  large eggs",
            "1 cup white sugar",
            "¾ cup vegetable oil",
            "1 teaspoon anise oil",
            "5 cups all-purpose flour",
            "2 tablespoons baking powder"
        ],
        "recipe_directions_formatted": [
            "Beat eggs together in a large bowl. Gradually stir white sugar into beaten eggs until smooth. Slowly pour vegetable oil and anise oil into sugar mixture until incorporated. Mix flour and baking powder together in a separate bowl; slowly add to sugar mixture, stirring with a wooden spoon until dough is dry. Refrigerate dough, 30 minutes to overnight.",
            "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a baking sheet.",
            "Roll dough into walnut-size balls and arrange on the prepared baking sheet.",
            "Bake in the preheated oven until cookies are crisp around the edges, 12 to 15 minutes. Cool cookies on baking sheet for 5 minutes before transferring to a wire rack.",
            "Mix confectioners' sugar and milk together in a bowl until desired consistency is reached. Dip a fork into the icing and drizzle over cookies. Allow icing to harden.",
            "Use anise oil, you cannot substitute with anise extract. For extra anise flavor, use 2 teaspoons."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Desserts",
            "Cookies",
            "International Cookie Recipes",
            "Italy"
        ],
        "recipe_details_formatted": {
            "Additional Time": "5 mins",
            "Prep": "20 mins",
            "Cook": "20 mins",
            "Total": "45 mins",
            "Servings": "48",
            "Yield": "4 dozen cookies"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "122",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "2g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/279153/ginas-italian-butter-cookies/",
        "recipe_name": "Gina's Italian Butter Cookies",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/F3A00ydpRDdSsywYhs4jXf17HpY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/2061923-ginas-italian-butter-cookies-NIGGI823-4x3-1-8e92e34af52a4877b9c75da52750413e.jpg",
        "recipe_ingredients_formatted": [
            "2 ¼ cups cake flour",
            "1 ½ cups all-purpose flour",
            "1 ¼ teaspoons baking powder",
            "1 teaspoon salt",
            "1 cup unsalted butter, softened",
            "1 cup white sugar",
            "½ cup vegetable shortening",
            "4 ounces almond paste",
            "2 large eggs",
            "2 teaspoons vanilla extract",
            "1 teaspoon lemon juice",
            "¼ teaspoon almond extract"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 350 degrees F (175 degrees C).",
            "Combine cake flour, all-purpose flour, baking powder, and salt in a medium bowl.",
            "Combine butter, sugar, and shortening in a large bowl; cream with an electric mixer on medium speed until light and fluffy. Mix in almond paste until thoroughly combined. Add eggs, vanilla extract, lemon juice, and almond extract. Reduce the mixing speed to low and slowly add flour mixture. Scrape down the bowl, then mix on medium speed until evenly combined, about 30 seconds.",
            "Fit a large pastry bag with a French star tip (#864) or an open star tip (4S); fill the pastry bag with batter. Pipe evenly sized cookies onto an ungreased cookie sheet 1 1/2 to 2 inches apart, giving cookies space to puff slightly during baking.",
            "Bake in the preheated oven, in batches if necessary, until bottom edges are slightly browned, 8 to 10 minutes. Cool on the baking sheet for 5 minutes before removing to a wire rack to cool completely.",
            "You can use almond baker's emulsion for almond extract, if desired."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Desserts",
            "Specialty Dessert Recipes",
            "Tiramisu Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "8 hrs",
            "Prep": "30 mins",
            "Cook": "5 mins",
            "Total": "8 hrs 35 mins",
            "Servings": "2",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "774",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "19g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/236604/chef-johns-tiramisu/",
        "recipe_name": "Chef John's Tiramisu",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/5FGJunXhPKy7unYCMeCTei_5R08=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(449x0:451x2):format(webp)/2928460-chef-johns-tiramisu-Irina-Ivanova-1x1-1-d3b867674a294511ba5eea5ff05a5175.jpg",
        "recipe_ingredients_formatted": [
            "½ cup brewed espresso",
            "3 tablespoons Marsala wine, divided",
            "2 large eggs, separated",
            "2 tablespoons white sugar",
            "1 teaspoon white sugar",
            "¾ cup mascarpone cheese",
            "½ teaspoon vanilla extract",
            "1 pinch salt",
            "10  ladyfinger cookies, broken in half, or more as needed",
            "1 tablespoon cocoa powder",
            "½ ounce dark chocolate, grated"
        ],
        "recipe_directions_formatted": [
            "Stir together espresso and 2 tablespoons wine in a shallow bowl. Set aside.",
            "Whisk together egg yolks, 2 tablespoons plus 1 teaspoon sugar, and remaining 1 tablespoon wine in a large bowl over a pot of simmering water until thick, pale yellow, and creamy, 5 to 6 minutes.",
            "Remove the bowl from heat and whisk in mascarpone, vanilla, and salt until completely smooth.",
            "Beat egg whites in a glass or metal bowl until stiff peaks form. Lift your beater or whisk straight up to ensure egg whites form sharp peaks. Gently stir and fold 1/2 of the egg whites into mascarpone mixture; fold in remaining egg whites.",
            "Place 1 heaping spoonful mascarpone mixture into a single-serving glass or cup. Dip 2 cookie halves briefly in espresso mixture; turn 3 to 4 times to coat. Place cookie halves in the bottom of the glass on top of mascarpone.",
            "Fill the glass halfway with mascarpone mixture. Dip 5 ladyfinger halves in espresso mixture and place vertically along the inside of the glass, dipping and placing more ladyfinger halves as needed to fit the glass. Place 2 dipped ladyfinger halves horizontally on top of mascarpone. Fill the glass to the top with mascarpone mixture. Repeat with second glass.",
            "Wrap both glasses in plastic wrap and refrigerate for at least 8 hours to overnight. Remove plastic wrap and dust tops with cocoa and grated chocolate before serving.",
            "This recipe contains raw egg. We recommend that pregnant women, young children, older adults, and the immunocompromised do not consume raw egg. Learn more about egg safety from our article, How to Make Your Eggs Safe."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Desserts",
            "Specialty Dessert Recipes",
            "Tiramisu Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "2 hrs",
            "Prep": "30 mins",
            "Cook": "None",
            "Total": "2 hrs 30 mins",
            "Servings": "12",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "324",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "8g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/239639/authentic-tiramisu/",
        "recipe_name": "Authentic Tiramisu",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/EHjcuswikxPLUBCFfHokIjLcvVY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x479:481x481):format(webp)/Authentic-tiramisu-by-Renee-Paj-3416470_original-c312ad679e254f8da85767bf61061984.jpg",
        "recipe_ingredients_formatted": [
            "3 large eggs, separated, divided",
            "½ cup white sugar",
            "2 tablespoons brandy",
            "2 cups brewed espresso, cooled, divided",
            "2 (8 ounce) packages mascarpone cheese",
            "1 pinch white sugar",
            "30  ladyfingers (such as Savoiardi®)",
            "3 tablespoons unsweetened cocoa powder"
        ],
        "recipe_directions_formatted": [
            "Beat together egg yolks, 1/2 cup sugar, brandy, and 1 tablespoon espresso in a bowl with an electric mixer until smooth, 2 to 3 minutes. Add mascarpone cheese; beat until well blended, 3 to 5 minutes.",
            "Beat egg whites and a pinch of sugar in a separate, clean bowl with an electric mixer until stiff peaks form. Gently fold egg whites into mascarpone mixture; set aside.",
            "Pour remaining espresso into a shallow dish. Dip 1 side of each ladyfinger into espresso and arrange on a serving platter in 2 horizontal rows of 6 and 2 1/2 ladyfingers in opposite directions on both ends to form a rectangular shape.",
            "Spread 1/2 of the mascarpone mixture onto ladyfingers and dust with 1/2 of the cocoa powder. Top with remaining ladyfingers dipped in espresso, mascarpone mixture, and cocoa powder.",
            "Refrigerate tiramisu until ladyfingers have softened, 2 to 3 hours.",
            "Strong brewed coffee can be used in place of espresso.",
            "This recipe contains raw egg. We recommend that pregnant women, young children, older adults, and the immunocompromised do not consume raw egg. Learn more about egg safety from our article, How to Make Your Eggs Safe."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Appetizers and Snacks",
            "Antipasto Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "7 mins",
            "Total": "22 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "183",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "7g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/244601/grilled-prosciutto-wrapped-peaches-with-burrata-and-basil/",
        "recipe_name": "Grilled Prosciutto-Wrapped Peaches with Burrata and Basil",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/kNSGJLDuNB2Od31AP4Y0-wWcczw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/2451285-grilled-prosciutto-wrapped-peaches-with-burrata-and-basil-Chef-John-1x1-1-477bfe500fbd4e98ba8c7a79c8ce93ec.jpg",
        "recipe_ingredients_formatted": [
            "2  ripe, sweet (but not soft) freestone peaches",
            "3 thin slices  prosciutto, or more as needed, torn into ribbons",
            "8 small bamboo skewers, soaked in water 20 minutes",
            "6 ounces burrata cheese",
            "1 tablespoon extra virgin olive oil, for drizzling",
            "Coarse sea salt to taste",
            "Freshly ground black pepper, to taste",
            "1 tablespoon finely sliced fresh basil leaves"
        ],
        "recipe_directions_formatted": [
            "Preheat an outdoor grill at medium-high heat and lightly oil the grate.",
            "Cut peaches in half and remove peach stones. Cut each half in half again.",
            "Wrap prosciutto around each peach section; secure with small bamboo skewers.",
            "Grill peaches, turning often, until prosciutto gets a little crisp around the edges and peaches begin to caramelize, about 6 minutes.",
            "To serve, spoon burrata onto serving plates. Remove peaches from skewers; place several grilled peaches around cheese. Drizzle with olive oil. Top with a sprinkle of sea salt and pepper; garnish with basil.",
            "Two peaches are enough for two large or four small servings.",
            "Instead of bamboo skewers, you can also use wooden toothpicks to attach the prosciutto to the peaches.",
            "If you can't find burrata cheese, you can use fresh mozzarella or ricotta cheese."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Kitchen Tips",
            "How To",
            "Global Kitchen"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/article/what-is-a-cannoli/",
        "recipe_name": "What Is a Cannoli and What Does It Taste Like?",
        "recipe_img_url-src": "None",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "The cannoli is a decadent, rich, and absolutely irresistible staple of Italian cuisine. If you've ever wanted to know more about the tubular dessert (including what it is, where it comes from, and how to make one at home), you've come to the right place. Here's what you need to know about cannolis:",
            "A cannoli is a tube-shaped Italian dessert that consists of fried pastry dough stuffed with a sweet, creamy cheese filling.",
            "The crispy pastry shell is made with the usual suspects: flour, sugar, whole eggs, and butter. It's usually spiked with marsala, a fortified wine that adds distinct flavor and sweetness. The alcohol also helps tenderize the pastry, ensuring a pleasantly flaky finished product.",
            "The creamy filling (often spiked with lemon or orange zest for subtle brightness) is made with sugar and ricotta cheese, but mascarpone is sometimes used. Finished cannolis are often dusted with powdered sugar.",
            "In many parts of Italy, a singular cannoli is called a \"cannolo\" and multiple cannolis are simply called \"cannoli.\" In the U.S., however, the accepted usage has become the singular \"cannoli\" and plural \"cannolis\" – so that's what we'll stick with for the remainder of this article.",
            "In Italian, \"cannoli\" is the plural of \"cannolo.\" \"Cannolo\" roughly translates to \"little tube.\"",
            "In a word, heavenly. Cannolis taste sweet, but not cloyingly so. The filling is rich, creamy, and smooth with a slight cheesy flavor. The shell is subtly sweet and crispy, but sturdy enough to support the thick filling.",
            "Sugar was introduced to Sicily sometime between 827 and 1091, when the island was under Arab rule and known as the Emirate of Sicily. This introduction paved the way for all sorts of Italian sweets we know and love – including the cannoli. The dessert was once known as cappelli di turchi, or Turkish hats, which proves that Sicilians believed the earliest cannolis had Middle Eastern roots.",
            "The cannoli is considered a modern day Sicilian staple, but it's particularly associated with Carnevale. Some say it originally served as a fertility symbol during the festival season.",
            "Cannolis and cream horns are both tube-shaped Italian desserts. However, they're not exactly the same thing.",
            "The cream horn has a puff pastry shell that's filled with sweetened whipped cream or custard. The cannoli, meanwhile, has a fried pastry shell that's filled with a ricotta mixture that tends to be denser than cream horn filling. Cannoli shells are generally much thinner and crispier than cream horn shells, which have the light and fluffy texture that's associated with puff pastry.",
            "There's more than one way to make a cannoli. Traditional cannolis have a simple filling of ricotta (or mascarpone), sugar, and sometimes vanilla extract. Here are a few common additions and variations:",
            "Though making bakery-worthy cannolis isn't exactly easy, it's probably not as hard as you think. You just need to know what you're doing. Here are some of our best tips and tricks to make perfect cannolis every time:",
            "Note: Of course, if you're short on time, you can always buy pre-made cannoli shells at the grocery store. They're usually found in the baking aisle or the international foods aisle.",
            "Ready to try your hand at making cannolis at home? We've got you covered. Try one of our favorite cannoli recipes:",
            "Explore our entire collection of Italian Desserts."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Cuisine",
            "European",
            "Italian",
            "Desserts"
        ],
        "recipe_details_formatted": {
            "Additional Time": "3 hrs 20 mins",
            "Prep": "15 mins",
            "Cook": "20 mins",
            "Total": "3 hrs 55 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "556",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "6g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/280941/butterscotch-budino/",
        "recipe_name": "Butterscotch Budino",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/YiV3kSnIN69j8Hga2-KahgANtW4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/8349527-butterscotch-budino-Chef-John-1x1-1-7c2d8bde373e4791a496a8686991e915.jpg",
        "recipe_ingredients_formatted": [
            "½ cup packed dark brown sugar",
            "¼ teaspoon kosher salt",
            "¼ cup water",
            "2 tablespoons unsalted butter",
            "1 ½ cups heavy cream",
            "¾ cup milk",
            "1 large egg",
            "2 large egg yolks",
            "2 tablespoons cornstarch",
            "1 teaspoon cornstarch",
            "1 tablespoon white rum"
        ],
        "recipe_directions_formatted": [
            "Combine brown sugar, salt, and water in a deep, heavy-bottomed saucepan and place over medium-high heat. Bring to a boil; cook until caramel is very dark, and bubbles appear, 7 to 10 minutes. Immediately turn off the heat.",
            "Carefully whisk in 2 tablespoons butter; pour in heavy cream and continue to stir. Be careful, as mixture may boil up in the pan. Stir over medium-low heat until sugar dissolves. Whisk in milk.",
            "Whisk whole egg, egg yolks, and 2 tablespoons plus 1 teaspoon cornstarch together in a mixing bowl. Slowly whisk in 1 cup of hot cream mixture to temper egg mixture. Whisk egg mixture into the saucepan and increase heat to medium-high. Bring to a simmer, and cook, whisking, until mixture thickens, about 2 minutes.",
            "Remove from heat and pour into a fine-mesh strainer set over a bowl to remove any lumps. Whisk in rum.",
            "Pour into serving glasses. Let cool to room temperature, about 20 minutes, before wrapping in plastic wrap and refrigerating until thoroughly chilled, 3 to 4 hours.",
            "If you want to make the recipe firmer, add more cornstarch. Or, if you want it softer and creamier, add less cornstarch.",
            "Use caramel sauce of your choice or my recipe for Salted Caramel Sauce."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Cuisine",
            "European",
            "Italian",
            "Desserts"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/gallery/italian-cake-recipes/",
        "recipe_name": "16 Classic Italian Cake Recipes",
        "recipe_img_url-src": "None",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "Whether you are Italian or not, you'll love the gorgeous Italian cakes in this recipe collection! Choose from Schiacciata alla Fiorentina, an orange-scented sponge cake from Florence; a spectacular Sicilian-inspired cannoli cake roll (for something a little different on your Easter table); an easy Italian apple cake; a lemon polenta cake; a tiramisu cheesecake — these Italian cakes are simply divine served with an espresso or a glass of sweet dessert wine at the end of a meal.",
            "A creamy Italian cheesecake made with full-fat cream cheese and ricotta for sensational flavor and texture. \"This is my grandmother's cheesecake recipe passed down to my entire family. It's the best.\" says recipe contributor April. \"I can't believe I'm sharing it, but everyone needs to know how to make an authentic Italian cheesecake.\"",
            "This beautiful Italian almond, cornmeal, and vanilla cake is dense and crumbly, similar in taste to shortbread. It tastes simply divine with strong coffee or a glass of cold white wine.",
            "This rustic olive oil cake, with citrusy tones is traditionally made in Italy with the grapes left over from the wine harvest. It's an ideal match with a glass of Vin Santo or other dessert wine for a special treat. \"WOW!\" says reviewer LISUTE. \"Light and moist this cake is a winner. Not too sweet with a hint of citrus.\"",
            "This popular Italian cake is a chocolate lover's dream. It's rich, and dense, typically made with either with ground walnuts or almonds. Dust with powdered sugar before serving for an elegant presentation.",
            "This is a gorgeous, Italian-style, rich-tasting, naturally gluten-free almond, lemon, and ricotta cake. Dust with powdered sugar before serving for an extra touch of sweetness.",
            "Genoese cake is an Italian sponge cake with typical ingredients like butter, flour, sugar, and egg yolks but made lighter in texture thanks to the addition of whipped egg whites. It works great for a layer cake with buttercream, fruit fillings, or syrups.",
            "This luxurious Italian-style, dairy free cake is enriched with semolina, ground almonds, whole oranges, orange liqueur, and Fiori di Sicilia (an extract of citrus and vanilla). \"Such a delicious, moist, flavorful cake!\" says home cook Claire. \"Outstanding taste sensation!\"",
            "A classic Italian apple and vanilla cake that's soft, comforting, and incredibly delicious served slightly warm with a scoop of vanilla ice cream. For a nutty version, fold in some chopped or flaked almonds into the batter.",
            "Known in Italy as torta al limone, this lovely almond and lemon coffee cake is decorated with a drizzle of sweet lemon glaze for a gorgeous finish. Perfect for serving to friends with coffee.",
            "Cassata cake originated in Sicily, Italy. It is an incredibly luxurious cake made up of layers of sponge cake laced with orange liqueur, and layered with a filling made of sweetened ricotta, candied fruits, and chocolate pieces. This version is decorated with chocolate frosting, but you can decorate with candied fruits or sugared flowers if you like.",
            "If you love the flavors in the Italian dessert tiramisu and are a fan of cheesecake, you won't want to skip this stunning cake. With hundreds of 5-star reviews, this dessert will leave a lasting impression on your guests.",
            "This sponge cake from Florence is eaten in Italy during Carnival, which is the week before Lent. It is a shallow cake, flavored with orange juice and zest, that's moist and delicious. Decorate the cake with powdered sugar using a fleur de lis (lily) template which is the symbol of Florence.",
            "Known in Italy as torta di ricotta e cioccolato, this authentic cake is made rich with ricotta cheese, eggs, melted butter, and chunks of bittersweet chocolate. Once the cake has cooled, garnish with grated chocolate for even more chocolaty goodness.",
            "A rich Italian cake made with ground almonds, fine cornmeal, and the juice of six lemons is topped with a sweet, syrupy lemon glaze in this easy to make cake that tastes incredibly delicious. \"A nice, light cake that just happens to be gluten free, can't beat that!\" says Allrecipes Allstar Buckwheat Queen.",
            "This jelly-roll cake might not be 100% authentic Italian, but the flavors are based on classic Italian cannoli, the sweet ricotta-filled pastry treat. It makes a fabulous centerpiece that will wow your guests. \"It is time consuming to put it together but it's not difficult and it's worth the effort,\" says home cook JEANINE.",
            "An Italian-style light sponge cake that's flavored with vanilla, coconut, and pecans. Decorate with a vanilla-cream cheese frosting and a sprinkling of chopped pecans for a beautiful celebration cake."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "1 hr",
            "Prep": "20 mins",
            "Cook": "20 mins",
            "Total": "1 hr 40 mins",
            "Servings": "15",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "219",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "5g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/20354/sfingi/",
        "recipe_name": "Sfingi",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/_uyIzxhJsjOnkp8k0gClU8_e28c=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1336x0:1338x2):format(webp)/9180788-53f07f94d576488c9ad16b15ca9843e5.jpg",
        "recipe_ingredients_formatted": [
            "1 pound ricotta cheese",
            "2  eggs",
            "2 tablespoons white sugar",
            "1 ½ teaspoons vanilla extract",
            "1 ½ tablespoons baking powder",
            "1 cup all-purpose flour",
            "2 quarts vegetable oil for frying",
            "¼ cup honey",
            "¼ cup confectioners' sugar for dusting"
        ],
        "recipe_directions_formatted": [
            "In a large bowl, combine ricotta, eggs, sugar, and vanilla. Mix together baking powder and 1/2 cup flour. Fold into ricotta mixture. Add enough remaining flour to make a thick batter. Let rest 1 hour.",
            "Heat oil in a large heavy saucepan over high heat until a small amount of batter dropped in oil sizzles and starts to color. Drop batter by teaspoons into hot oil and deep-fry until golden. Remove with a slotted spoon and drain on paper towels.",
            "Stack sfingi on a serving platter in a pyramid. Drizzle stack with honey and dust with confectioner's sugar.",
            "We have determined the nutritional value of oil for frying based on a retention value of 10% after cooking. The exact amount may vary depending on cook time and temperature, ingredient density, and the specific type of oil used."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "2 hrs 10 mins",
            "Prep": "10 mins",
            "Cook": "40 mins",
            "Total": "3 hrs",
            "Servings": "8",
            "Yield": "8 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "394",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "10g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/262724/authentic-italian-rice-pudding/",
        "recipe_name": "Authentic Italian Rice Pudding",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/Utj0fvORgSYbZv5CVZMT4-3unHY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(671x164:673x166):format(webp)/1827006-authentic-italian-rice-pudding-Cooking-Italian-With-Joe-4x3-1-d253f55182b04779ac07e3afcf8abfc1.jpg",
        "recipe_ingredients_formatted": [
            "6 cups whole milk",
            "¾ cup Arborio rice",
            "¾ cup white sugar, divided",
            "1 teaspoon vanilla extract",
            "¼ teaspoon salt",
            "2  eggs",
            "2  egg yolks",
            "1 cup heavy whipping cream"
        ],
        "recipe_directions_formatted": [
            "Mix milk, rice, 1/2 of the sugar, vanilla extract, and salt together in a saucepan over medium-high heat. Bring to a boil.",
            "Blend remaining sugar with whole eggs and yolks in a bowl to make a creamy custard.",
            "Reduce heat of the milk mixture. Let simmer, uncovered, until thickened, 30 to 40 minutes. Fold in the custard. Heat until thickened again, about 5 minutes more.",
            "Beat cream in a chilled glass or metal bowl with an electric mixer until soft peaks form.",
            "Remove the milk and custard mixture from heat. Let cool, about 10 minutes. Fold in the whipped cream. Pour pudding into a serving dish, cover, and refrigerate until chilled, at least 2 hours."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "3 hrs 10 mins",
            "Prep": "10 mins",
            "Cook": "10 mins",
            "Total": "3 hrs 30 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "107",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "1g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/258769/granita-di-caffe-con-panna-italian-coffee-granita/",
        "recipe_name": "Granita di Caffe con Panna (Italian Coffee Granita)",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/vgOmPMc6mvyIlvu44rc7mYhTCkQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1099x0:1101x2):format(webp)/4531910-12e97ba42ebd4a2884a27273d78b55b4.jpg",
        "recipe_ingredients_formatted": [
            "1 cup water",
            "⅓ cup white sugar",
            "1 cup strong espresso coffee",
            "1 teaspoon vanilla extract (optional)",
            "1 cup whipped cream, or to taste"
        ],
        "recipe_directions_formatted": [
            "Bring water and sugar to a boil in a small saucepan; simmer until a candy thermometer reads 250 degrees F (120 degrees C), about 5 minutes.",
            "Remove saucepan from heat; add coffee and vanilla. Pour into a metal bowl and mix well. Cool granita mixture to room temperature, about 10 minutes. Freeze for 1 hour.",
            "Stir the granita vigorously to break up ice crystals. Repeat freezing and breaking up process 4 to 5 more times, 2 to 2 1/2 hours total.",
            "Drop spoonfuls of whipped cream into 4 short glasses. Divide granita mixture evenly among the glasses. Top with remaining whipped cream."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Desserts",
            "Cakes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "20 mins",
            "Prep": "25 mins",
            "Cook": "45 mins",
            "Total": "1 hr 30 mins",
            "Servings": "8",
            "Yield": "1 9-inch cake"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "297",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "3g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/8385/italian-fresh-purple-grape-cake/",
        "recipe_name": "Italian Fresh Purple Grape Cake",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/fYYEkHrUP9TqDrdYlmhlasIUsRQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/8537432-italian-fresh-purple-grape-cake-Nora-Lee-4x3-1-ef5dfab5717b49b4b6d7d98269adc5c3.jpg",
        "recipe_ingredients_formatted": [
            "⅔ cup white sugar",
            "2  eggs",
            "⅓ cup milk",
            "¼ cup extra virgin olive oil",
            "4 tablespoons unsalted butter, melted",
            "½ teaspoon vanilla extract",
            "1 ½ cups all-purpose flour",
            "¾ teaspoon baking powder",
            "1 pinch salt",
            "2 tablespoons grated lemon zest",
            "2 tablespoons grated orange zest",
            "10 ounces small purple grapes"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 350 degrees F (175 degrees C). Generously butter and flour a 9-inch springform pan, tapping out any excess flour.",
            "Beat sugar and eggs in the bowl of a stand mixer fitted with the whisk attachment until thick and lemon-colored, about 3 minutes. Add milk, olive oil, melted butter, and vanilla; mix until blended.",
            "Sift flour, baking powder, and salt into a large bowl. Add lemon zest and orange zest and toss until coated with flour.",
            "Spoon the flour mixture into wet ingredients; stir with a wooden spoon until thoroughly blended. Scrape down the sides of the bowl and mix once more. Let sit for 10 minutes to allow the flour to absorb the liquids.",
            "Add 7 to 8 ounces grapes to the batter; stir to incorporate. Spoon batter into the prepared cake pan and smooth out the top with a spatula. Set remaining grapes aside.",
            "Bake cake in the center of the preheated for 15 minutes. Remove from the oven and sprinkle reserved grapes over the top.",
            "Return to the oven and bake until the top is a deep golden brown and the cake feels quite firm when pressed with a fingertip, about 40 more minutes.",
            "Remove from the oven and cool on a wire rack for 10 minutes. Run a knife along the sides of the pan to loosen the cake. Release and remove the side of the springform pan, leaving the cake on the pan base. Let cool to room temperature. Cut thin wedges to serve.",
            "Please note differences in ingredient amounts when following the magazine version of this recipe, as well as the additions of mascarpone and honey."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Kitchen Tips",
            "How To",
            "Sweet Spot"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/article/creative-ways-enjoy-tiramisu/",
        "recipe_name": "10 Creative Ways to Enjoy Tiramisu With a Twist",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/UPNoun1C30WlUGL8cypA86FKg5U=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(324x0:326x2):format(webp)/1113820Tiramisu20Parfaits20Photo20by20Meredith20650x473-90c7cc8003c44010acda119cfaba66a2.jpg",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "Italian tiramisu might look complicated, but it's actually pretty easy to make at home. In fact, it's so easy that home cooks can't help tinkering with it to come up with their own creative takes on this decadent dessert. To show you how easy it is to make tiramisu at home, I'll share a classic tiramisu recipe and several variations, with plenty of prep tips along the way.",
            "More: Browse our entire collection of tiramisu recipes.",
            "At its most basic, Italian tiramisu is a luscious dessert made with ladyfinger cookies dipped in coffee and layered with rich mascarpone cheese whipped with egg yolks. Sometimes Marsala wine or a liqueur is added to the coffee to booze it up, and sometimes the tiramisu is topped with grated chocolate or cocoa powder.",
            "According to The New Food Lover's Companion, \"tiramisu\" translates as \"carry me up\" or \"pick me up,\" with the implication that you're being carried up to heaven. Which, of course, tends to happen when you eat a heavenly dessert like tiramisu.",
            "1. Classic Tiramisu",
            "Let's start with a very simple twist: This is a traditional preparation of the classic dessert, but with the addition of coffee liqueur brushed onto the ladyfinger cookies for another layer of flavor.",
            "Tip: NANNOUSE found it helpful to build the tiramisu in a cheesecake pan and chill it in the fridge overnight to make it easy to pop out the next morning.",
            "Watch the video to get step-by-step instructions to cook the egg yolks and construct a classic tiramisu.",
            "2. Tiramisu II",
            "This is one of our most popular tiramisu recipes, and calls for using rum instead of Marsala wine. LisaC says that after refrigerating hers overnight, it was \"better than any tiramisu I've ever tasted.\"",
            "Tip: Lining your pan with plastic wrap will make for easier removal from pan to platter for a prettier presentation.",
            "3. Chef John's Tiramisu",
            "This classic tiramisu recipe is made into individual servings or parfaits that are perfect for an elegant dinner party or a holiday dessert buffet. Milos Nikolic thought this recipe was \"restaurant-grade tiramisu.\"",
            "Tip: Try using black coffee instead of espresso to make it a little less bitter.",
            "4. Tiramisu Layer Cake",
            "If you're looking to eliminate some of the prep work, look no further. This tiramisu layer cake uses cake mix instead of ladyfingers. Aria warns other cooks to not over-whip the frosting or you \"risk hitting an icky butter zone.\" Here's how to make whipped cream.",
            "Tip: Use a mixer to whip your ingredients, unless you want a quick way to burn up some holiday dessert calories.",
            "5. Tiramisu Cheesecake",
            "Tiramisu-flavored cheesecake is a modern twist on the classic trifle. SAS4U makes a low-fat version by swapping out the mascarpone with ricotta cheese that has been whipped in a blender until smooth.",
            "Tip: If you're not making your own ladyfingers, look for store-bought versions without artificial flavors, which can leave behind an unpleasant taste.",
            "6. Tiramisu Chocolate Mousse",
            "If you want all of the flavors with less of the work, try a tiramisu-inspired chocolate mousse. Home cook mel says this is \"a really divine confection!\"",
            "Tip: A little bit of alcohol goes a long way. You want to flavor your mousse with just a splash, not drown it in booze.",
            "7. Tiramisu al Marsala",
            "Marsala wine is a traditional alcohol used in tiramisu. This recipe can be made in individual serving portions, although you can also streamline the prep and make it in a large pan. Buckwheat Queen, who is \"addicted to tiramisus,\" says this recipe does not disappoint!",
            "Tip: Make sure to let it chill for at least 6 hours and up to 2 days to firm up the filling, soften the ladyfingers, meld the flavors, and moisten the cocoa.",
            "8. Emily's Famous Tiramisu",
            "If you're looking to really impress your guests, then make your own ladyfingers, as is called for in this recipe. NHBaker will \"never use stale, packaged ladyfingers again,\" and says that the homemade versions were actually easy to make.",
            "Tip: Brush, don't dunk, the ladyfingers with the syrup. This will infuse them with flavor but keep them from getting soggy.",
            "9. Strawberry Tiramisu Without Eggs",
            "Loosely inspired by tiramisu, this dessert uses cream cheese and whipping cream instead of mascarpone whipped with egg yolks. The fresh fruit adds gorgeous color and flavor.",
            "Tip: To keep the fruit juices from running and staining the top of the tiramisu, wait until just before serving to decorate with the final layer of fruit.",
            "10. Tiramisu Toffee Dessert",
            "Store-bought or homemade pound cake provides the structure for this twist on tiramisu, and cream cheese whipped with heavy cream and chocolate syrup creates the fluffy filling. Chopped toffee gets sprinkled over the top to give each bite a little crunch.",
            "Tip: Home cook elizabethellis substituted Bailey's Irish Cream for the chocolate syrup, and you can, too.",
            "You might also like..."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Desserts",
            "Cookies",
            "Biscotti Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "1 hr",
            "Prep": "15 mins",
            "Cook": "30 mins",
            "Total": "1 hr 45 mins",
            "Servings": "12",
            "Yield": "12 cookies"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "215",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "4g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/215829/anisette-toast/",
        "recipe_name": "Anisette Toast",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/ym6GWe2Qmbtqz0v2dowtpYbZgiE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/481872-9c40d01b2c174955bd0f1557af87b91d.jpg",
        "recipe_ingredients_formatted": [
            "2 ½ cups all-purpose flour",
            "2 teaspoons baking powder",
            "¼ teaspoon baking soda",
            "¼ teaspoon salt",
            "¼ cup softened butter",
            "1 cup white sugar",
            "3  eggs",
            "4 teaspoons anise extract"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 350 degrees F (175 degrees C). Mix flour, baking powder, baking soda, and salt together in a bowl; set aside. Grease 2 baking sheets.",
            "Beat butter and sugar with an electric mixer in a large bowl until fluffy. Beat in one egg until completely incorporated, then another. Beat in last egg along with the anise extract. Mix in flour until just incorporated. Divide dough into two 12-inch long logs, 1/2-inch thick; place on prepared baking sheets.",
            "Bake in the preheated oven until golden and firm to the touch, 20 to 25 minutes. Remove from the oven, and allow to cool, 5 minutes.",
            "Cut into 3/4-inch thick slices using a serrated knife, and place cut-side-down onto the baking sheets.",
            "Bake 5 to 10 minutes until the bottoms turn golden brown. Turn cookies over, and continue baking until golden brown on the other side, 5 to 10 minutes more. Cool completely on a wire rack before serving."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Desserts",
            "Cookies"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/gallery/italian-christmas-cookies/",
        "recipe_name": "19 Italian Christmas Cookies to Try This Year",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/DgZIpeljeKoFA8fjIj7bg9983Tk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/3409265-gingerbread-biscotti-photo-by-allrecipes-2d3a637386a64f00bae61e1ec3346397.jpg",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "Make your holidays a little sweeter this year with these Italian-inspired Christmas Day cookies. Enjoy seasonal twists on classic biscotti, traditional and simply beautiful pizzelles, espresso-flavored chocolate chip cookies, nutty amaretti cookies, and more. Whatever you're looking for, you'll find it in this collection of our best Italian Christmas cookies.",
            "These light and fluffy cookies with subtle lemony icing are truly heavenly. They're great to serve year-round, but red and green sprinkles make them festive enough for any holiday party.",
            "Can you just imagine dipping this warm, spicy cookie into a hot cup of coffee? Better yet, hot cocoa?! This seasonal treat will quickly become a Christmas tradition.",
            "We love how the red cranberries and green pistachios give these cookies a festive touch, but you could substitute whatever nuts you have on hand.",
            "What's the secret to this vibrant biscotti? Cake mix. The genius shortcut means these cookies come together with just seven ingredients and 20 minutes of hands-on time.",
            "This ancient waffle cookie is truly a showstopper, but it's easier to make these intricate designs than you might think. All you need is a pizzelle press! This top-rated Cuisinart model comes with a traditional pizzelle recipe book.",
            "Though it looks quite different than today's coconut cookies, traditional Italian amaretti cookies (which are deliciously nutty, thanks to the almonds) are actually an ancestor to macaroons.",
            "These traditional Italian fig cookies are a labor of love, but we promise, they're worth it. They freeze really well, so this recipe is a great make-ahead option.",
            "\"Finally, a recipe for pizzelles that calls for anise oil! I had one long ago, but lost the recipe,\" user Chris Lidberg says. \"Thank you so much for posting it. The anise oil gives a more intense flavor of anise to the cookie much better than anise extract, which is more commonly found! Love it.\"",
            "Multiple reviewers say these cookies evoke childhood memories of long-forgotten family recipes. If you've been trying to duplicate your grandma's Italian iced cookie recipe, you may have just found what you're looking for.",
            "Cantucci, a form of biscotti, is a crunchy almond cookie that is almost impossible to stop eating. For the full experience, serve it with hot coffee.",
            "It's hard to improve upon the classic chocolate chip cookie, but this espresso-flavored recipe makes a darn good attempt. For an extra coffee kick, try substituting espresso morsels for chocolate chips.",
            "Similar to Italian wedding cookies, these smooth, fluffy, and powdered sugar-covered treats are perfect for any celebration.",
            "\"Delicious! I made them a little smaller and rolled them in granulated sugar after I removed them from the oven,\" user Christina says. \"These are gonna be a new cookie tradition in our family—Everyone LOVED them. Yum! Thanks for sharing.\"",
            "What's more festive than a gorgeous, delicate, and delicious pizzelle? A gorgeous, delicate, and delicious pizzelle that tastes like gingerbread!",
            "If you've always wanted to try your hand at pizzelle-making, but you follow a gluten-free diet, this paleo recipe was made for you.",
            "Here's a five-ingredient Italian cookie that everyone will love. This is an especially nutty recipe (it has almond paste and pine nuts). So make sure your guests don't have any allergies before serving.",
            "\"Without a doubt the BEST chewy almond cookie I've found,\" user Dutchmommy raves. \"My daughter and I thought we had tasted the best one in Europe on a recent trip but these are even better!\"",
            "This brownie-like biscotti recipe is too good not to try at least one. Drizzle with more chocolate and top with red and green sprinkles for an extra festive touch.",
            "Think fancy, gourmet versions of a Fig Newton! These fig-stuffed cookies are traditionally served at Christmas time. \"A flavorful fig and date filling is wrapped in a soft, sweet dough, then baked and dipped in festive frosting and decorated with sprinkles,\" recipe submitter Nicolemcmom says. \"Need to send cookies through the mail? These are perfect for gifting! My favorite way to enjoy these cookies is for breakfast with a hot cup of coffee. Store in an airtight container for up to two weeks. Alternatively, freeze un-iced cookies for up to three months and ice just before serving.\""
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "None",
            "Cook": "None",
            "Total": "None",
            "Servings": "12",
            "Yield": "1 to 9 - inch round layer cake"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "759",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "10g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/7260/italian-cream-cake-i/",
        "recipe_name": "Italian Cream Cake I",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/J7eBN7_2Ke45210Hf0IW_5KAOtY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1151x0:1153x2):format(webp)/5000563-d662c8909e17419bb2d8ffe11e58088e.jpg",
        "recipe_ingredients_formatted": [
            "1 cup butter",
            "5  egg yolks",
            "1 teaspoon baking soda",
            "2 cups all-purpose flour",
            "5  egg whites",
            "2 cups white sugar",
            "1 ½ cups buttermilk",
            "1 cup chopped walnuts",
            "1 cup flaked coconut",
            "1 (8 ounce) package cream cheese",
            "½ cup butter",
            "3 ½ cups confectioners' sugar",
            "1 teaspoon vanilla extract",
            "¼ cup chopped walnuts"
        ],
        "recipe_directions_formatted": [
            "Cream together 1 cup butter or margarine, egg yolks, and 2 cups white sugar. Alternately mix in flour and buttermilk. Add baking soda. Mix in 1 cup walnuts and coconut.",
            "Beat egg whites, and fold into batter. Pour batter into three greased and floured 9 inch round cake pans.",
            "Bake for 20 to 25 minutes in a preheated 350 degrees F (175 degrees C) oven.",
            "Combine cream cheese, 1/2 cup butter or margarine, confectioners' sugar, and vanilla extract. Spread onto cooled cake. Top iced cake with chopped walnuts."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Desserts",
            "Cookies",
            "Biscotti Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "30 mins",
            "Prep": "25 mins",
            "Cook": "40 mins",
            "Total": "1 hr 35 mins",
            "Servings": "30",
            "Yield": "30 cookies"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "138",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "2g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/11525/cinnamon-hazelnut-biscotti/",
        "recipe_name": "Cinnamon Hazelnut Biscotti",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/9xIRZrm-eJ1tm4UDTAIxo7RjTT0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2):format(webp)/114892-cinnamon-hazelnut-biscotti-chibi-chef-4x3-1-7524482017624a3b9ca4eec0f57ebffb.jpg",
        "recipe_ingredients_formatted": [
            "¾ cup butter",
            "1 cup white sugar",
            "2 large eggs",
            "1 ½ teaspoons vanilla extract",
            "2 ½ cups all-purpose flour",
            "1 teaspoon ground cinnamon",
            "¾ teaspoon baking powder",
            "½ teaspoon salt",
            "1 cup hazelnuts"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 350 degrees F (175 degrees C). Grease a cookie sheet or line with parchment paper.",
            "In a medium bowl, cream together butter and sugar until light and fluffy. Beat in eggs and vanilla. Sift together flour, cinnamon, baking powder, and salt; mix into egg mixture. Stir in hazelnuts.",
            "Shape dough into two 12-inch long logs; place on the prepared baking sheet and press down to 1/2-inch thickness.",
            "Bake for about 30 minutes in the preheated oven, or until the edges are golden and the center is firm. Remove from oven to cool on the pans. When logs are cool enough to handle, use a serrated knife to slice the logs diagonally into 1/2-inch-thick slices. Return the slices to the baking sheet.",
            "Bake for an additional 10 minutes, turning over once. Cool completely, and store in an airtight container at room temperature."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Desserts",
            "Cakes",
            "Cheesecake Recipes",
            "New York Cheesecake Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "3 hrs",
            "Prep": "20 mins",
            "Cook": "1 hr",
            "Total": "4 hrs 20 mins",
            "Servings": "12",
            "Yield": "1 10-inch cheesecake"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "452",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "11g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/218805/new-york-italian-style-cheesecake/",
        "recipe_name": "New York Italian Style Cheesecake",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/SRQzPdtMK8_srk8ZzZEMy7s9EvQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1151x0:1153x2):format(webp)/5131313-775a867ba7da4f83b5c4e35e45f4f07c.jpg",
        "recipe_ingredients_formatted": [
            "1 pound cream cheese, softened",
            "1 pound ricotta cheese",
            "1 ½ cups white sugar",
            "4  eggs",
            "¼ cup butter, melted and cooled",
            "3 tablespoons all-purpose flour",
            "3 tablespoons cornstarch",
            "2 ½ teaspoons vanilla extract",
            "2 cups sour cream",
            "2 tablespoons lemon juice (Optional)"
        ],
        "recipe_directions_formatted": [
            "Preheat oven to 325 degrees F (165 degrees C). Move an oven rack to the middle of the oven.",
            "Beat the cream cheese, ricotta cheese, and sugar in a large mixing bowl with an electric mixer until well combined. Beat in the eggs, one at a time. Add the butter, flour, cornstarch, and vanilla extract; mix until well combined. Fold in the sour cream and lemon juice. Pour the mixture into an ungreased 10-inch springform pan.",
            "Bake in the preheated oven for 1 hour. Turn off the oven and leave the cheesecake in the oven for 2 more hours. Remove from oven and let cool completely. Run a thin spatula around the edge of the cheesecake before springing open the pan to remove. Serve at room temperature or cold; refrigerate leftovers."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Cuisine",
            "European",
            "Italian",
            "Desserts"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "None",
            "Total": "20 mins",
            "Servings": "12",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "149",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "1g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/245169/pumpkin-cannoli/",
        "recipe_name": "Pumpkin Cannoli",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/f_SNvLRFsLKHvpVFWQe77yPeQ9M=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/2773857-b5cb3b692deb4f4eaec34354f219888f.jpg",
        "recipe_ingredients_formatted": [
            "1 cup confectioners' sugar",
            "¾ cup canned pumpkin",
            "4 ounces mascarpone cheese",
            "½ cup ricotta cheese",
            "¼ cup instant vanilla pudding mix",
            "1 teaspoon pumpkin pie spice",
            "½ cup heavy whipping cream",
            "12  large cannoli shells",
            "1 tablespoon sprinkles, or as desired",
            "1 teaspoon confectioners' sugar for dusting"
        ],
        "recipe_directions_formatted": [
            "Stir 1 cup confectioners' sugar, pumpkin, mascarpone cheese, ricotta cheese, pudding mix, and pumpkin pie spice together in a bowl until smooth.",
            "Beat cream in a chilled bowl with an electric mixer until stiff peaks form; fold into pumpkin mixture. Spoon pumpkin mixture into a resealable plastic bag and snip a 3/4-inch hole in the corner. Pipe pumpkin mixture into each cannoli shell. Garnish the ends with sprinkles and confectioners' sugar."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/gallery/italian-cookies/",
        "recipe_name": "25 Italian Cookies You'll Love",
        "recipe_img_url-src": "None",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "Make room in your recipe box for your new favorite cookies. From biscotti (this Cranberry Pistachio Biscotti is perfect for the holidays, and this cinnamon-sugar version will rival your favorite snickerdoodle recipe) to celebration-worthy Italian Wedding Cookies and traditional Pizzelles, you'll find exactly what you're looking for in this collection of our best Italian cookies.",
            "These light and fluffy Italian cookies are sweet, but not too sweet. Plus, this recipe comes together with only six ingredients in about half an hour.",
            "\"Was looking for a recipe like my husband's grandmother and this was it,\" says reviewer Jeanmarie Kerkowski Anicito. \"These are excellent and so easy to make ... thank you for sharing!\"",
            "Smooth, chewy, and perfectly sweet, this old family recipe is traditionally served around the holidays — but you'll want to make it all year long.",
            "Ricotta cheese gives these fluffy cookies a deliciously unexpected tanginess that everyone will absolutely love.",
            "Though it looks quite different than today's coconut cookies, traditional Italian amaretti (which is deliciously nutty, thanks to the almonds) is actually an ancestor to macaroons. Read more about the connection here.",
            "Not only is this fruit- and nut-packed biscotti gorgeous (and super festive-looking), but it's absolutely delicious.",
            "This ancient waffle cookie is truly a showstopper, but it's easier to make these intricate designs than you might think. All you need is a pizzelle press! This top-rated Cuisinart model comes with a traditional pizzelle recipe book.",
            "This traditional Italian recipe is a labor of love, but these fig cookies are so worth the work. They're super freezer-friendly, so feel free to make this treat ahead of time.",
            "These nutty cookies are so soft and chewy, you'll be surprised to learn they're completely flourless. This is a great option for the gluten-free cookie lovers in your life.",
            "Cantucci, a form of crunchy biscotti, is an almond cookie that is almost impossible to stop eating. For the full Italian experience, serve with hot coffee.",
            "\"Delicious! I made them a little smaller and rolled them into granulated sugar after I removed them from the oven,\" says reviewer Christina. \"These are gonna be a new cookie tradition in our family ... everyone LOVED them — yum! Thanks for sharing.\"",
            "\"Without a doubt the BEST chewy almond cookie I've found,\" raves user Dutchmommy. \"My daughter and I thought we had tasted the best one in Europe on a recent trip but these are even better!\"",
            "Looking for a great biscotti to pair with your coffee? This recipe is super customizable, so you can adapt it to fit your palate. For instance, use anise instead of almond extract or throw in some chocolate chips.",
            "These are traditional \"Italian-American bakery-style butter cookies that will make you feel like you bought them from your favorite local bakery in New York,\" according to recipe creator NIGGI823.",
            "\"A great and unique cookie recipe,\" says reviewer M. McBride. \"Everyone loved them. They are very light and fluffy with a great flavor.\"",
            "These tri-colored bar cookies are traditionally served at weddings and around the holidays, but they're sure to be a welcome sight at any celebration.",
            "If you like Italian Cream Cake, you'll love these cute and easy bite-sized desserts.",
            "\"These are just like my Nonna and my Mother made,\" says reviewer CARM DAVENPORT. \"I could never find the exact recipe but this is really close. I made a batch for a cookie exchange and I've had to make them three more times to have any left for Christmas Eve. Very good!!!\"",
            "Ricciarelli are Italian almond cookies that date back to the 14th-century. Make these traditional treats for your next special occasion.",
            "\"After trying my hand at countless sesame cookie recipes, my Italian girlfriend shared her Aunt Anne's recipe and I knew my search had ended,\" says recipe creator DianeF. \"Basically an anise flavored butter cookie covered in sesame seeds. The smell when removing them from the oven is wonderful!\"",
            "Biscotti Regina are small Italian cookies coated in sesame seeds. This recipe is perfect for people who love a salty-sweet flavor combination.",
            "\"They are absolutely delicate and delicious,\" according to reviewer misscarolb. \"I love biscotti and these have that perfect subtle taste. I did bake mine slightly longer the second time around (about 8 mins per side) because I like my biscotti really crunchy. Can't wait to share with friends and family I know they'll be impressed!\"",
            "This absolutely irresistible Italian take on the cinnamon-packed snickerdoodle is too good to pass up.",
            "Who doesn't love ravioli? These sweet little dumplings are filled with cherry preserves, but you can use whatever fruit you want.",
            "These miniature cheesecakes are \"a little bite of heaven,\" according to recipe creator Rita. Top with the sauces, fruits, or nuts of your choice."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Desserts",
            "Cakes",
            "Cheesecake Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "35 mins",
            "Total": "45 mins",
            "Servings": "8",
            "Yield": "1 to 10 - inch cheesecake"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "160",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "7g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/186428/ancient-roman-cheesecake-savillum/",
        "recipe_name": "Ancient Roman Cheesecake (Savillum)",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/gq27jqBuwODthSLcmCOlI53lmqI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(124x0:126x2):format(webp)/835056-161cf0aa75794cb0aabd67eff1a27a85.jpg",
        "recipe_ingredients_formatted": [
            "15  bay leaves",
            "3  eggs",
            "8 ounces ricotta cheese",
            "½ cup honey",
            "1 teaspoon grated orange zest",
            "1 teaspoon lemon juice",
            "½ cup all-purpose flour"
        ],
        "recipe_directions_formatted": [
            "Preheat an oven to 425 degrees F (220 degrees C). Pour some water into a small, oven proof bowl, and place into the oven. Arrange the bay leaves over the bottom of the springform pan to cover.",
            "Beat the eggs in a mixing bowl, then mix in ricotta cheese, honey, orange zest, and lemon juice. Sprinkle in the flour, and stir until evenly combined. Gently pour the batter over the bay leaves, being careful not to disturb them too much.",
            "Bake in the preheated oven until browned, about 35 to 40 minutes. Run the tip of a paring knife around the edges of the pan, and release from the springform pan. Invert onto a serving plate, and serve warm or chilled."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Kitchen Tips",
            "How To",
            "Global Kitchen"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/article/what-is-budino/",
        "recipe_name": "Budino Is the Italian Pantry Dessert You Won't Be Able To Stop Making",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/5m3HqN8ZyNu0ojJiTQY5fEfbxb0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(621x0:623x2):format(webp)/fm18-puddin-seasaltcaramel-1244-9c462cee62714ae08942055bdd87855a.jpg",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "Everybody loves pudding, it's a fact of life. But more often than not, the little peel-top cups or boxes of powdered mix leave something to be desired. So what if you could whip up a better version at home, whenever the craving strikes? And what if it was pretty easy, mainly using stuff you already have on hand? And what if it was like, kind of grown-up and sophisticated… as in, you could impress other people with it? Well, I have some excellent news: Budino is the answer to all of the above.",
            "In its simplest form, budino is an Italian pudding. But trust me, it's so much more than that. Made from a milk and egg custard thickened with cornstarch, budino is similar to American puddings and custards; however, budino tends to have a richer, eggier texture, akin to Mexican flan.",
            "Better still, budino almost always includes some type of crust, like crushed cookies, and a whipped cream-based topping. You'll often find other top layers, like salted caramel or butterscotch, included as well. In America, chocolate is a super popular flavor for pudding, but budino is a little different. The most common flavors are coffee, caramel (or butterscotch), vanilla, or honey. You don't often find fruit flavors, but you'll stumble upon the occasional lemon budino accompanied by a fruit compote in the summer months. Nuts like pistachios are a common final-touch topping, but crushed bits of biscotti or other crunchy cookies are also welcome additions.",
            "Get the Recipe: Chef John's Chocolate Puddino",
            "Budino is a show-stopper dessert that is easily made with pantry staples. A plain vanilla budino comes together with ingredients — like milk, eggs, butter, and cornstarch — that home cooks often have on hand. Plus, the custard comes together in less than 20 minutes on the stovetop. Egg custards have the reputation of being tricky or complicated, which is why many people reach for a box of pudding mix over making it from scratch. That said, the method for making budino, which involves tempering the milk first and then bringing down the temperature of the custard mixture with cold milk and cornstarch, provides a bit more insurance against accidentally scrambling the eggs in your pudding.",
            "Even though it's relatively easy to make and uses common ingredients, budino feels legitimately special and can be dressed up with different flavors and toppings. The base recipe below can be very easily adapted to your personal tastes and what you have on hand.",
            "Makes 2 budino cups",
            "CRUST:",
            "CUSTARD:",
            "TOPPING:",
            "To make the crust:",
            "1. Mix cookie crumbs, melted butter, and salt in a small bowl and then spoon into two small cups or glasses.",
            "To make the custard:",
            "1. Whisk together ¼ cup of the milk with the cornstarch in a small bowl and set aside.",
            "2. Heat remaining ½ cup of milk in a saucepan, just until it starts to bubble.",
            "3. Whisk egg yolk in a large, heat-proof bowl. Very slowly stream in the warmed milk while whisking vigorously, followed by whisking in the milk and cornstarch mixture. Set aside.",
            "4. Heat brown sugar and 3 tablespoons of water in the same pan you used to heat the milk until the sugar dissolves.",
            "5. Slowly stream the sugar mixture into the bowl with the milk and eggs while whisking vigorously. Pour mixture back into the pan and warm over medium heat, whisking constantly until the mixture begins to thicken, about 3-5 minutes.",
            "6. Remove from heat and stir in the cold butter, vanilla extract, rum (if using), and salt. Pour mixture over the cookie crumbs and refrigerate for at least 4 hours.",
            "To make the topping and finish:",
            "1. Whip the cream in a stand mixer, with an electric hand mixer, or by hand until slightly thickened. Add in the sugar and vanilla extract, and continue to whip until fluffy. Top each budino with a generous dollop of whipped cream and garnish with cookie crumbs.",
            "Related:"
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "4 hrs",
            "Prep": "15 mins",
            "Cook": "18 mins",
            "Total": "4 hrs 33 mins",
            "Servings": "6",
            "Yield": "6 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "345",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "5g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/150221/panna-cotta-with-fresh-strawberry-sauce/",
        "recipe_name": "Panna Cotta With Fresh Strawberry Sauce",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/ai4Hgmjtjb6ZBiQEGMG6Bhzjyh8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/886542-04a2620e04fc4f5aa536c2b4f8c2704b.jpg",
        "recipe_ingredients_formatted": [
            "1 ½ cups milk",
            "1 (.25 ounce) envelope unflavored gelatin",
            "1 ½ cups whipping cream",
            "¼ cup white sugar",
            "2 teaspoons vanilla extract",
            "1 quart fresh strawberries, quartered",
            "2 teaspoons vanilla extract",
            "¼ cup white sugar",
            "¼ cup water"
        ],
        "recipe_directions_formatted": [
            "Pour the milk into a bowl; sprinkle the gelatin over the milk. Allow mixture to sit until the gelatin softens, about 5 minutes.",
            "Combine the cream and 1/4 cup sugar in a saucepan over medium heat. Stir in the gelatin mixture; cook and stir until gelatin dissolves completely, about 3 minutes. Add the vanilla extract. Pour the mixture evenly into ramekins; cover and chill at least 4 hours.",
            "To make the strawberry sauce, combine the strawberries, 2 teaspoon vanilla extract, 1/4 cup sugar, and water in a saucepan over medium heat. While the mixture cooks, crush the strawberries with a potato masher. Simmer the sauce until the sugar has dissolved and the sauce has thickened, about 10 minutes; cool.",
            "Remove chilled ramekins from the refrigerator shortly before serving. Dip the bottoms of the cups in warm water to help loosen the custard. Run a thin-bladed knife around the inner edge of each ramekin to loosen the dessert; turn onto a dessert plate to unmold. Spoon strawberry sauce over panna cotta to serve."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Desserts",
            "Cookies",
            "International Cookie Recipes",
            "Italy"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "10 mins",
            "Total": "30 mins",
            "Servings": "48",
            "Yield": "4 dozen"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "137",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "2g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/19199/italian-easter-cookies/",
        "recipe_name": "Italian Easter Cookies",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/EyACK5PAaMJ0RkxOTlxQ644Ld5I=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/375673-30c588e5fc0444f9b603557c5a5ede16.jpg",
        "recipe_ingredients_formatted": [
            "1 ¾ cups white sugar",
            "½ cup butter",
            "3  eggs",
            "¼ cup milk",
            "¼ cup vegetable oil",
            "1 teaspoon vanilla extract",
            "1 teaspoon almond extract",
            "3 ¾ cups all-purpose flour",
            "5 teaspoons baking powder"
        ],
        "recipe_directions_formatted": [
            "These Italian Easter cookies are light and fluffy with a subtly sweet vanilla- and almond-flavored icing. What's not to love?",
            "These are the ingredients you'll need to make this top-rated Easter cookie recipe:",
            "· For the cookies: sugar, butter, eggs, milk, vegetable oil, vanilla and almond extracts, all-purpose flour, and baking powder\n· For the icing: confectioners' sugar, butter, vanilla and almond extracts, milk, food coloring, and sprinkles",
            "You'll find the full, step-by-step recipe below — but here's a brief overview of what you can expect when you make Italian Easter cookies at home:",
            "1. Make the cookie dough.\n2. Roll the cookie dough into balls, then roll the balls into ropes.\n3. Tie the ropes into loose knots.\n4. Bake the cookies in a preheated oven until golden brown.\n5. Make the icing, then dip the cooled cookies into the icing.",
            "Store the Italian Easter cookies in an airtight container at room temperature for up to one week. You can freeze Italian Easter cookies for up to three months, but it's best to freeze them before you add the icing.",
            "\"These are yummy,\" according to jacebanty, \"They taste like a sugar cookie, but a little smaller, fluffier and slightly more bland, which is perfect with the sweet frosting.\"",
            "\"Delicious,\" says Koekje. \"I wish I could give it more stars. This is a REAL winner. I made only a dozen to test the recipe. I think these cookies can be made without the icing and served with a sweet hot drink.\"",
            "\"These were so incredibly moist and delicious,\" raves stanleyandsammiesmom. \"They were gone by the next morning! Will definitely make them again!\"",
            "Editorial contributions by Corey Williams",
            "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease cookie sheets.",
            "To make the cookies: Beat sugar and butter in a large bowl with an electric mixer until smooth. Add eggs one at a time, beating well after each addition. Stir in milk, oil, vanilla, and almond extract. Combine flour and baking powder; stir into milk mixture to form a dough.",
            "Roll dough into 1-inch balls; roll the balls out on a lightly floured surface into 5-inch long ropes. Bring one end over the other, then underneath and through the middle, like a loose knot; place cookies 1 inch apart on the prepared cookie sheets.",
            "Bake in the preheated oven until the bottoms of the cookies are golden brown, about 5 minutes on the bottom shelf, then 5 minutes on the top shelf. Transfer cookies to a wire rack to cool completely.",
            "To make the icing: Beat confectioners' sugar, butter, vanilla, and almond extract with an electric mixer in a large bowl until smooth; beat in milk, one tablespoon at a time. Add food coloring and stir until well combined.",
            "Dip cooled cookies upside down into the icing then sprinkle with candy sprinkles."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Desserts",
            "Cookies",
            "International Cookie Recipes",
            "Italy"
        ],
        "recipe_details_formatted": {
            "Additional Time": "3 mins",
            "Prep": "15 mins",
            "Cook": "12 mins",
            "Total": "30 mins",
            "Servings": "48",
            "Yield": "4 dozen"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "172",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "3g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/19215/ricotta-cookies-iii/",
        "recipe_name": "Ricotta Cookies III",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/fJdFt0mR5owmLdLHJ3lY3MWFboc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1295x0:1297x2):format(webp)/9430379-53d30ec8c2b34bc09f2d3f620e44206d.jpg",
        "recipe_ingredients_formatted": [
            "1 cup butter",
            "2 cups white sugar",
            "2  eggs",
            "16 ounces ricotta cheese",
            "2 teaspoons vanilla extract",
            "4 cups all-purpose flour",
            "1 teaspoon baking powder",
            "1 teaspoon baking soda",
            "½ cup milk",
            "½ teaspoon butter",
            "½ teaspoon shortening",
            "4 cups confectioners' sugar",
            "1 tablespoon lemon extract",
            "½ cup colored candy sprinkles"
        ],
        "recipe_directions_formatted": [
            "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.",
            "In a large bowl, cream together the 1 cup of butter and sugar. Beat in the eggs, one at a time, then stir in the ricotta cheese and vanilla. Combine the flour, baking powder and baking soda, stir into the ricotta mixture. Drop by rounded spoonfuls onto the prepared cookie sheet.",
            "Bake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.",
            "To make the frosting warm the milk, 1/2 teaspoon of butter and shortening, in a small saucepan. Cook over medium heat, stirring occasionally until solids are melted. Remove from heat and gradually stir in the confectioners' sugar and lemon extract. Dip each cookie into the icing then dip in colored sugar or sprinkles."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Desserts",
            "Cookies",
            "International Cookie Recipes",
            "Italy"
        ],
        "recipe_details_formatted": {
            "Additional Time": "30 mins",
            "Prep": "15 mins",
            "Cook": "10 mins",
            "Total": "55 mins",
            "Servings": "48",
            "Yield": "48 cookies"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "43",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "1g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/189046/italian-butterball-cookies/",
        "recipe_name": "Italian Butterball Cookies",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/hZhIYmGVyPwZNPACIY0XRt4vM5g=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/3274415-872bdd63d77345e9b26f98c65b2cc890.jpg",
        "recipe_ingredients_formatted": [
            "1 stick butter",
            "¾ cup confectioners' sugar",
            "1  egg",
            "1 teaspoon vanilla extract",
            "1 teaspoon almond extract",
            "1 ½ cups all-purpose flour",
            "2 teaspoons baking powder",
            "1 pinch salt",
            "¼ cup confectioners' sugar"
        ],
        "recipe_directions_formatted": [
            "Preheat an oven to 350 degrees F (175 degrees C). Grease a baking sheet.",
            "Beat together the butter and 3/4 cup confectioners' sugar with an electric mixer in a large bowl until smooth. Add the egg, vanilla extract, and almond extract. Stir together the flour, baking powder, and salt in a bowl and mix into the butter mixture until just incorporated. Shape the dough into 1-inch balls and arrange on the prepared baking sheet spaced about 2 inches apart.",
            "Bake in the preheated oven until firm, about 10 minutes. Cool on the sheet for 10 minutes before removing to cool completely on a wire rack.",
            "Spread the 1/4 cup confectioners sugar on a plate; roll the cooled cookies in the confectioners' sugar to coat."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Desserts",
            "Cakes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "1 hr",
            "Prep": "25 mins",
            "Cook": "1 hr 30 mins",
            "Total": "2 hrs 55 mins",
            "Servings": "18",
            "Yield": "1 to 13 - x inch cake"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "348",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "11g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/7998/italian-love-cake/",
        "recipe_name": "Italian Love Cake",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/kNLvqIPcBV4ZI-g4NUe-Xg_ByrQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1511x0:1513x2):format(webp)/9279696-b37139d9b0c24f15b846cbdc228c5f7a.jpg",
        "recipe_ingredients_formatted": [
            "1 (18.25 ounce) package chocolate cake mix",
            "2 pints part-skim ricotta cheese",
            "¾ cup white sugar",
            "1 teaspoon vanilla extract",
            "4  eggs",
            "1 (3.9 ounce) package instant chocolate pudding mix",
            "1 cup milk",
            "1 (12 ounce) container frozen whipped topping, thawed"
        ],
        "recipe_directions_formatted": [
            "Prepare cake mix as directed on box. Pour batter into 9 x 13 x 2 inch greased baking dish. Set aside.",
            "Combine ricotta cheese, sugar, vanilla, and eggs. Blend well. Spread mixture evenly over the top of the cake batter.",
            "Bake at 350 degrees F (175 degrees C) for 75 minutes if using a glass baking dish, 90 minutes if using a metal pan.",
            "Blend pudding mix and milk until thickened. Blend in whipped topping. Spread over cooled cake."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "1 hr",
            "Cook": "10 mins",
            "Total": "1 hr 10 mins",
            "Servings": "24",
            "Yield": "24 truffles"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "169",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "1g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/263814/nipples-of-venus-capezzoli-di-venere/",
        "recipe_name": "Nipples of Venus (Capezzoli di Venere)",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/14-k340eB8ZguQxhXjYhj9cjyRQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(2591x0:2593x2):format(webp)/5309887-469c8925b68c485db1dcc0c00fd8b4b1.jpg",
        "recipe_ingredients_formatted": [
            "⅓ cup white sugar",
            "5 tablespoons unsalted butter, room temperature",
            "6 ounces dark chocolate, chopped",
            "14 ounces whole chestnuts",
            "1 pinch salt",
            "1 pinch cayenne pepper",
            "1 teaspoon vanilla extract",
            "¼ cup brandy",
            "8 ounces white chocolate, chopped",
            "⅓ cup confectioners' sugar",
            "2 teaspoons milk, or as needed",
            "paper candy cups",
            "1 drop red food coloring, or more as needed"
        ],
        "recipe_directions_formatted": [
            "Cream sugar and butter together with a spatula until light and creamy. Set aside.",
            "Heat an inch of water in a pot set over low heat. Melt dark chocolate in a heat-proof bowl placed over the pot. Stir with a small spatula.",
            "Place chestnuts in a food processor; pulse on and off until very finely ground. Add chestnuts to the sugar-butter mixture and stir until combined. Add salt, cayenne pepper, vanilla extract, and brandy. Stir well. Pour in the melted chocolate and mix again until filling is well blended.",
            "Scoop filling onto a silicone-lined baking sheet and smooth out if necessary. Cover the balls in plastic wrap and refrigerate while you prepare the white chocolate coating.",
            "Reserve about 20% of the white chocolate to stir in later. Melt the rest in a heat-proof bowl over a pot of simmering water until an instant-read thermometer inserted in to the chocolate reads 105 degree F (41 degrees C). Add the reserved white chocolate and stir until melted.",
            "Place 1 chocolate truffle on a fork and hold it up above the white chocolate coating. Spoon on the white chocolate until ball is well coated. Use another fork to push the truffle onto a lined baking sheet. Repeat with the remaining truffles and coating. Place the bowl of coating back over hot water if it chocolate starts to harden.",
            "Mix confectioners' sugar with enough milk to make a very thick paste that will hold together well. Dye it pink with red food coloring. Transfer into a piping bag and pipe a small dot on top of each truffle. Serve truffles in paper candy cups.",
            "If you must, another nut like almond, or hazelnut, should work about the same, especially when you consider your guest, or guests, will be fairly distracted by the eye-opening appearance.",
            "Substitute cognac for the brandy if you prefer.",
            "You can easily make the filling ahead of time, freeze, and add the coating any time.",
            "This is more white chocolate than you need for coating, but that's how this stuff works. Just eat the rest."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Desserts",
            "Cookies",
            "International Cookie Recipes",
            "Italy"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "None",
            "Cook": "None",
            "Total": "None",
            "Servings": "60",
            "Yield": "4 to 5 - dozen"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "302",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "4g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/10267/italian-fig-cookies-i/",
        "recipe_name": "Italian Fig Cookies I",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/DhCGmUcQCZ6uTuEK1TVrJweE4hc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/10267kimshupe_italianfigcookiesi4x3-6df49e2775d94c43886a1419bbd8b7e8.jpg",
        "recipe_ingredients_formatted": [
            "2 cups shortening",
            "3 cups white sugar",
            "6  eggs",
            "8 cups all-purpose flour",
            "7 teaspoons baking powder",
            "2 tablespoons vanilla extract",
            "1 pinch salt",
            "2 cups whole milk",
            "4 pounds dried figs",
            "1 pound raisins",
            "2 teaspoons ground cinnamon",
            "½ cup white sugar",
            "1  whole orange, with peel",
            "1  small apple",
            "1 ½ cups chopped pecans",
            "1 cup water (Optional)"
        ],
        "recipe_directions_formatted": [
            "To Make Dough: Cream sugar and shortening. Add eggs, vanilla, and salt. Blend in flour and baking powder by hand. Knead dough until smooth and workable. Add milk to reach workable consistency. (This takes a while and you will get a workout, but you'll know when it's right.)",
            "To Make Filling: Cut up figs, orange, and apple into small pieces. (It is easier to grind this way). Grind figs, raisins, orange, and apple. If the mixture is too dry or thick, mix in up to 1 cup of water, if desired. (I do not use the water, the juice from the apple and orange are enough). The spices and chopped nuts are added to the ground fig mixture. After the fig mixture is ground, I sprinkle them in over the mixture and mix (knead) it in by hand. STICKY! But good.",
            "Preheat oven to 375 degrees F (190 degrees C).",
            "Roll out some dough. (should be kind of thin). Put fig mixture in a line. Wrap dough over mixture, sealing figs inside dough. Trim to desired length, using a diagonal cut. Make small diagonal slits in the sides of the cookies. Bake on ungreased cookie sheet for 10-15 minutes. (Dough makes good cookies without the filling also). Wonderful with coffee."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Desserts",
            "Cookies",
            "Biscotti Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "25 mins",
            "Cook": "40 mins",
            "Total": "1 hr 5 mins",
            "Servings": "48",
            "Yield": "4 dozen"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "70",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "1g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/43941/gingerbread-biscotti/",
        "recipe_name": "Gingerbread Biscotti",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/ag1_qBHmMGAQ-LNObGypaa0dPAI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/2942870-3f1b2d4aa44d4ccfa3c566388c4f3e9d.jpg",
        "recipe_ingredients_formatted": [
            "⅓ cup vegetable oil",
            "1 cup white sugar",
            "3  eggs",
            "¼ cup molasses",
            "2 ¼ cups all-purpose flour",
            "1 cup whole wheat flour",
            "1 tablespoon baking powder",
            "1 ½ tablespoons ground ginger",
            "¾ tablespoon ground cinnamon",
            "½ tablespoon ground cloves",
            "¼ teaspoon ground nutmeg"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 375 degrees F (190 degrees C). Grease a cookie sheet.",
            "In a large bowl, mix together oil, sugar, eggs, and molasses. In another bowl, combine flours, baking powder, ginger, cinnamon, cloves, and nutmeg; mix into egg mixture to form a stiff dough.",
            "Divide dough in half, and shape each half into a roll the length of the cookie. Place rolls on cookie sheet, and pat down to flatten the dough to 1/2 inch thickness.",
            "Bake in preheated oven for 25 minutes. Remove from oven, and set aside to cool.",
            "When cool enough to touch, cut into 1/2 inch thick diagonal slices. Place sliced biscotti on cookie sheet, and bake an additional 5 to 7 minutes on each side, or until toasted and crispy."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Desserts",
            "Cookies",
            "International Cookie Recipes",
            "Italy"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "45 mins",
            "Cook": "15 mins",
            "Total": "1 hr",
            "Servings": "24",
            "Yield": "4 dozen"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "48",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "2g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/11248/savoiardi-i/",
        "recipe_name": "Savoiardi I",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/oyILKOPErMz8awmuZVPCTX90udU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1170x0:1172x2):format(webp)/6958670-a9cd2fdab8e24a25bbfb710aa7410d1e.jpg",
        "recipe_ingredients_formatted": [
            "4  eggs",
            "⅔ cup white sugar",
            "1 teaspoon vanilla extract",
            "⅛ teaspoon salt",
            "¾ cup all-purpose flour"
        ],
        "recipe_directions_formatted": [
            "Preheat oven to 375 degrees F (190 degrees C). Line three jelly roll pans with parchment paper. Prepare a pastry bag with a size 6 tip (1/2 inch).",
            "Separate the eggs. Whisk the egg yolks with 1/2 of the sugar and all of the vanilla. Beat until very light colored. This will take about 5 minutes.",
            "In a clean bowl, beat the egg whites until they hold soft peaks. While beating, slowly add the salt and the remaining sugar until combined. Gently fold the beaten egg whites into the egg yolk mixture.",
            "Sift the flour over the egg mixture and gently fold it in.",
            "Fill the pastry with half of the batter and pipe 3 1/2 inch fingers, 1 1/2 inches apart, in rows on the parchment paper. Continue with the second half of the batter in the same manner.",
            "Bake at 375 degrees F (190 degrees C) for about 15 minutes until firm to the touch and golden. Remove the paper and fingers from the baking sheet and place on racks to cool. After cooling, remove fingers from the paper and use, or store between layers of wax paper in a airtight container. These freeze well."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Desserts",
            "Cookies",
            "International Cookie Recipes",
            "Italy"
        ],
        "recipe_details_formatted": {
            "Additional Time": "45 mins",
            "Prep": "15 mins",
            "Cook": "1 hr",
            "Total": "2 hrs",
            "Servings": "15",
            "Yield": "30 biscotti"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "200",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "4g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/260575/chef-johns-almond-biscotti/",
        "recipe_name": "Chef John's Almond Biscotti",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/JBtiUoUIOWPq2Z0TQwI4sDCpKgM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1512x0:1514x2):format(webp)/5679265-870e665405d445cd963fa6e9c2c492d9.jpg",
        "recipe_ingredients_formatted": [
            "2 cups all-purpose flour",
            "1 teaspoon baking powder",
            "¼ teaspoon fine salt",
            "3 tablespoons unsalted butter, room temperature",
            "1 cup white sugar",
            "1 tablespoon white sugar",
            "1 tablespoon olive oil",
            "2  large eggs",
            "¼ teaspoon vanilla extract",
            "¾ teaspoon almond extract",
            "½ cup whole roasted almonds",
            "½ cup chopped roasted almonds"
        ],
        "recipe_directions_formatted": [
            "Whisk flour, baking powder, and salt together in a mixing bowl.",
            "Place butter, 1 cup plus 1 tablespoon sugar, olive oil in a separate mixing bowl. Mix together thoroughly until mixture has a creamy texture. Add 1 egg; mix into butter/sugar mixture. Whisk in 2nd egg, vanilla extract, and almond extract; whisk until smooth. Add flour mixture. Mix until flour is incorporated. Add whole almonds and chopped almonds; mix in evenly. Cover bowl with plastic wrap; refrigerate 30 minutes.",
            "Preheat oven to 350 degrees F (175 degrees C). Line a rimmed baking sheet with a silicone mat.",
            "Divide dough in half. Place each half on a length of plastic wrap and shape into a log. Wrap with the plastic wrap and press into a shape about 3 or 4 inches wide and about 1/2 inch high. Transfer both pieces to prepared baking sheet leaving about 3 or 4 inches of space between them to allow for spreading.",
            "Bake in center of preheated oven until turning golden and a toothpick inserted into the center comes out clean, about 30 minutes. Let cool 15 minutes before slicing.",
            "Reduce oven temperature to 325 degrees F (165 degrees C).",
            "Cut each piece at a slight angle into 1/2- to 1 -inch thick slices with a serrated knife. Transfer pieces back to baking sheet in a single layer. Bake 12 minutes; remove from oven and flip pieces over. Return pan to oven and bake until biscotti are golden brown and crunchy, about 20 minutes.",
            "Transfer biscotti to a cooling rack; let cool to room temperature.",
            "If using kosher salt, use 1/2 teaspoon instead of 1/4 teaspoon fine salt.",
            "Depending on the size and shape of the biscotti, your baking times will vary greatly. Keep peeking at them once they get close, and wait for that perfect golden brown.",
            "Please note the differences in yield and cook time, as well as the use of cranberries instead of chopped almonds when using the magazine version of this recipe."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "35 mins",
            "Total": "50 mins",
            "Servings": "8",
            "Yield": "1 (8-inch) cake"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "394",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "6g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/213067/refreshing-limoncello-cake/",
        "recipe_name": "Refreshing Limoncello Cake",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/GJN9Xl9rIaR2_8dATmdIT4zfR9I=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/213067refreshing-limoncello-cakeKim4x3-265e69061305447b92a5a7a94fa20f51.jpg",
        "recipe_ingredients_formatted": [
            "cooking spray",
            "1 cup plain yogurt",
            "2  eggs",
            "⅓ cup canola oil",
            "2 tablespoons lemon juice",
            "2 tablespoons lemon zest",
            "1 cup sugar",
            "¼ cup limoncello liqueur",
            "2 cups all-purpose flour",
            "1 ½ teaspoons baking powder",
            "½ teaspoon baking soda",
            "1 pinch salt (Optional)",
            "¾ cup confectioners' sugar",
            "3 tablespoons limoncello liqueur"
        ],
        "recipe_directions_formatted": [
            "Preheat oven to 350 degrees F (175 degrees C). Prepare an 8-inch cake pan with cooking spray.",
            "Whisk together the yogurt, eggs, canola oil, lemon juice, lemon zest, sugar, and 4 tablespoons limoncello in a large bowl. In a separate large bowl, mix the flour, baking powder, baking soda, and salt. Gently stir the dry ingredients into the wet. Do not over mix or the cake will be tough. Pour batter into prepared pan.",
            "Bake in the preheated oven until top is golden and a toothpick inserted in the center of the cake comes out clean, about 35 minutes. Remove from oven and allow to cool slightly.",
            "Stir the powdered sugar and 3 tablespoons of limoncello together in a small bowl until smooth. Poke small holes all over the top of the still-warm cake with a fork or toothpick. Spoon the glaze over the cake and spread with the back of a spoon. The glaze will seep into the cake and add moisture."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "4 hrs 15 mins",
            "Prep": "10 mins",
            "Cook": "10 mins",
            "Total": "4 hrs 35 mins",
            "Servings": "6",
            "Yield": "6 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "488",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "4g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/275711/lemon-panna-cotta/",
        "recipe_name": "Lemon Panna Cotta",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/k3gVAnZQxDj2OXUxv2Ldd77YTb0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(966x0:968x2):format(webp)/9123237-59ceefdd32f840f9917e216221d9fd70.jpg",
        "recipe_ingredients_formatted": [
            "2 tablespoons freshly squeezed lemon juice",
            "1 (.25 ounce) package powdered gelatin (such as Knox®)",
            "3 cups heavy cream",
            "½ cup white sugar",
            "2 ½ tablespoons fresh lemon zest, divided",
            "1 tablespoon orange liqueur (such as Grand Marnier®) (Optional)"
        ],
        "recipe_directions_formatted": [
            "Place lemon juice in a small bowl and sprinkle the unflavored gelatin over it. Let stand for about 15 minutes until gelatin softens.",
            "Combine heavy cream, sugar, and 2 tablespoons lemon zest in a saucepan over medium-low heat; bring to a simmer. Whisk in gelatin mixture until dissolved. Remove from heat and stir in orange liqueur.",
            "Strain the cream mixture into a medium bowl and divide evenly among small glass bowls or ramekins.",
            "Place uncovered panna cottas into the refrigerator until set, at least 4 hours. If time permits, cover the bowls with plastic wrap and chill overnight.",
            "Garnish with remaining lemon zest before serving."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "4 hrs",
            "Prep": "20 mins",
            "Cook": "30 mins",
            "Total": "4 hrs 50 mins",
            "Servings": "12",
            "Yield": "12 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "435",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "5g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/237434/italian-lemon-cream-cake/",
        "recipe_name": "Italian Lemon Cream Cake",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/2tI6M4g8dGM205ctq1dfPAz1lB0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/5871913-26ebb2da9c4b4332810614f55dbd6c85.jpg",
        "recipe_ingredients_formatted": [
            "cooking spray"
        ],
        "recipe_directions_formatted": [
            "Preheat oven to 350 degrees F (175 degrees C). Spray the bottom of a 10-inch springform pan with cooking spray.",
            "Measure 1 cup cake mix; set aside for crumb topping. Place the remaining cake mix in a large bowl; add 3/4 cup plus 1 tablespoon milk, eggs, and oil. Beat cake mix mixture using an electric mixer until batter is thoroughly combined, about 2 minutes. Pour batter into the prepared pan.",
            "Mix melted butter and vanilla extract together in a bowl; stir in reserved 1 cup cake mix until mixture is crumbly. Sprinkle crumbs over top of cake batter.",
            "Bake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, 30 to 35 minutes. Cool cake to room temperature in the pan.",
            "Beat cream cheese, 1/3 cup confectioners' sugar, lemon juice, and lemon zest together in a bowl until smooth and creamy. Beat cream and remaining 1/3 cup confectioners' sugar together in a separate bowl using an electric mixer until stiff peaks form. Fold cream cheese mixture into whipped cream.",
            "Remove cake from springform pan. Cut cake horizontally into 2 layers using a serrated knife; remove top layer. Spread filling onto the bottom cake layer; place top cake over filling. Refrigerate cake for at least 4 hours. Dust cake with more confectioners' sugar before serving."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Holidays and Events Recipes",
            "Easter",
            "Desserts"
        ],
        "recipe_details_formatted": {
            "Additional Time": "1 hr",
            "Prep": "20 mins",
            "Cook": "50 mins",
            "Total": "2 hrs 10 mins",
            "Servings": "10",
            "Yield": "1 8-inch cake"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "397",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "11g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/283483/almond-ricotta-cake/",
        "recipe_name": "Almond Ricotta Cake",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/oGX1KYDZ1bAdsEQHM9c2yseoGW4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/9059478-03abd9a3eef04474a274c3f7b8b186f7.jpg",
        "recipe_ingredients_formatted": [
            "½ cup unsalted butter, at room temperature",
            "¾ cup white sugar",
            "2 teaspoons vanilla sugar",
            "1 large lemon, zested and juiced",
            "4 large eggs, separated",
            "2 cups blanched almond flour",
            "9 ounces ricotta cheese",
            "⅓ cup white sugar",
            "¼ cup sliced almonds, or to taste",
            "1 tablespoon confectioners' sugar for dusting"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 325 degrees F (165 degrees C). Grease an 8-inch springform pan and line with parchment paper.",
            "Combine butter and 3/4 cup sugar in a large bowl; beat with an electric mixer until creamy, about 3 minutes. Add vanilla sugar, lemon zest, and lemon juice; mix until well combined. Add egg yolks, 1 at a time, beating well after each addition.",
            "Fold in almond flour and ricotta cheese with a silicone spatula.",
            "Wash and dry the beaters and beat egg whites in a glass, metal, or ceramic bowl until foamy. Gradually add 1/3 cup sugar, continuing to beat until stiff peaks form. Fold stiff egg whites into the batter. Pour batter into the prepared pan. Sprinkle with sliced almonds.",
            "Bake on the center rake of the preheated oven until edges of the cake are lightly browned, about 50 minutes. Cake will still be a little wobbly in the middle.",
            "Remove from the oven and let the cake to cool completely in the pan before transferring to a cake platter, about 1 hour. Dust with confectioners' sugar before serving."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Desserts",
            "Cookies",
            "International Cookie Recipes",
            "Italy"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "17 mins",
            "Total": "32 mins",
            "Servings": "60",
            "Yield": "5 dozen cookies"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "72",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "1g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/57184/aunt-annes-sesame-cookies/",
        "recipe_name": "Aunt Anne's Sesame Cookies",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/TLiR7timTEIqh4oEQygWNzgD2zk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1511x0:1513x2):format(webp)/5662682-016319f2fe9844ee85ee8a81769cfe60.jpg",
        "recipe_ingredients_formatted": [
            "1 cup butter",
            "¾ cup sugar",
            "1  egg, room temperature",
            "2 teaspoons anise extract",
            "2 ½ cups all-purpose flour",
            "¼ teaspoon baking powder",
            "⅛ teaspoon salt",
            "½ cup milk, or as needed",
            "1 cup sesame seeds"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 350 degrees F (175 degrees C).",
            "In a large bowl, cream together the butter and sugar until smooth. Beat in the egg and anise extract until well blended. Sift together the flour, baking powder and salt; stir into the butter mixture until well incorporated. If you are using a stand mixer, let the dough mix for another minute to add lightness to the dough. The dough will be soft, but will hand roll easily.",
            "Pinch off pieces of dough slightly smaller than a walnut, and roll them into small logs. Dip in milk, then roll in sesame seeds. Place cookies one inch apart on a cookie sheet. Cookies will not spread very much.",
            "Bake for 17 to 20 minutes in the preheated oven, or until bottom and sides of cookies are lightly toasted. Remove from cookie sheets to cool on wire racks. Store in an airtight container at room temperature."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "1 hr",
            "Prep": "10 mins",
            "Cook": "10 mins",
            "Total": "1 hr 20 mins",
            "Servings": "2",
            "Yield": "2 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "213",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "4g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/246464/chef-johns-zabaglione/",
        "recipe_name": "Chef John's Zabaglione",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/DvyA4v497yR3Wlmg6GYW2nCTuLk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/3345334-chef-johns-zabaglione-Chef-John-1x1-1-b96a7a94552747d1b765424fc93e2bf2.jpg",
        "recipe_ingredients_formatted": [
            "½ cup strawberries - hulled, halved and sliced",
            "1 teaspoon white sugar",
            "3  large egg yolks",
            "3 tablespoons white sugar",
            "¼ cup dry Marsala wine"
        ],
        "recipe_directions_formatted": [
            "Gently stir the strawberries and sugar together in a bowl. Cover and let sit at room temperature until juices release, about 1 hour.",
            "Divide fruit between 2 small, clear serving bowls or stemmed cocktail glasses.",
            "Place egg yolks, sugar, and marsala into metal mixing bowl. Set over burner on low heat. Hold rim of bowl with a potholder. Whisk until mixture forms loose peaks, 7 or 8 minutes. Mixture should feel warm to the touch.",
            "Spoon custard over the strawberries. Serve while custard is still warm."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "4 hrs",
            "Prep": "1 hr 30 mins",
            "Cook": "30 mins",
            "Total": "6 hrs",
            "Servings": "16 to 20",
            "Yield": "16 to 20 pastries"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "271",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "4g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/235629/sfogliatelle-ricce/",
        "recipe_name": "Sfogliatelle Ricce",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/iSciaERnNbdidQOwlM7saV1dzHM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(383x272:385x274):format(webp)/1099479-sfogliatelle-ricce-SugarMogill-4x3-1-c80a22b122504bfd8ab710e3c97b0dd0.jpg",
        "recipe_ingredients_formatted": [
            "12 ⅓ ounces bread flour",
            "5 ⅓ ounces semolina flour",
            "⅓ ounce kosher salt",
            "6 ½ fluid ounces water, or more if needed",
            "⅔ fluid ounce honey"
        ],
        "recipe_directions_formatted": [
            "Make the dough: Mix bread flour, semolina flour, and kosher salt together in a large bowl. Mix in water and honey; the dough will be very dry, like pasta. If there is still dry flour after a few minutes of mixing, add up to 2 teaspoons more water to ensure all flour is moistened.",
            "Turn dough out onto a work surface and knead for a few minutes until smooth, firm, and not tacky. While you want a firm dough, it must still be workable. Divide dough into four pieces and flatten. Cover dough with plastic wrap when not working with it. Run each piece through a pasta machine on its widest setting a dozen or so times, folding it in half and rotating the sheet 45 degrees each time (see Tips). Dust with flour very sparingly, only if needed to prevent tearing. Repeat with remaining dough pieces. Wrap dough in plastic wrap and refrigerate for 2 hours.",
            "Meanwhile, make the filling: Blend ricotta cheese in a food processor until smooth. Bring water to a boil in a saucepan, then stir in sugar. Sift in semolina flour, whisking to avoid clumping; it will immediately thicken up. Reduce the heat to low, fold in blended ricotta, and cook for 2 more minutes, stirring constantly.",
            "Remove from the heat and transfer filling to the food processor. Add egg yolks, one at a time with the processor running, until fully combined. Add orange peel, vanilla, and cinnamon, then pulse to mix. Transfer filling to a bowl and cool to room temperature. Cover with plastic wrap and refrigerate.",
            "Divide each dough piece into four smaller pieces and cover with plastic wrap. Place clean kitchen towels over a work surface so you can lay each sheet of dough on the towels while you roll out the remaining sheets.",
            "Run each piece of dough through a pasta machine on progressively smaller settings until dough is as thin as possible. After running it through the machine, stretch each sheet as wide as you can without tearing. Dough sheets should stretch to three times their original width and be so thin you can see through them.",
            "Melt butter and lard in a saucepan. Place a sheet of parchment paper onto a work surface, and place the first sheet of pastry onto the parchment. Brush pastry with butter mixture. Place the second sheet above the first, overlapping 1/2 inch or so. Roll sheets up into a tight cylinder, leaving about 1 inch to overlap the next sheet. Place the third dough sheet onto the parchment, overlapping the second sheet, and brush with butter mixture. Continue rolling up the log of dough, repeating until all dough pieces are brushed with butter mixture and rolled. Wrap dough log in the parchment sheet, then wrap entirely with plastic wrap. Refrigerate for 2 hours.",
            "Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper. Transfer chilled filling to a pastry bag or a 1-gallon zip-top bag with the corner snipped off.",
            "Cut dough log into 1/2-inch slices; you should have 16 to 20 pieces. Holding it in both hands, use your thumbs to flatten each slice from the center outwards, then shape it into a cone. Pipe some filling into the center, close partially, and repeat to form remaining pastries.",
            "Bake in the preheated oven until dough turns golden brown and starts to peel back from the pastries, 20 to 30 minutes, basting a couple of times with any leftover butter mixture if desired. Serve warm pastries dusted with confectioners' sugar.",
            "Nutrition data for this recipe includes the full amount of butter mixture. The actual amount consumed will vary."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Desserts",
            "Cookies"
        ],
        "recipe_details_formatted": {
            "Additional Time": "30 mins",
            "Prep": "50 mins",
            "Cook": "1 hr",
            "Total": "2 hrs 20 mins",
            "Servings": "18",
            "Yield": "18 chocolate-filled cookies"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "213",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "3g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/282681/lace-cookies-florentine-cookies/",
        "recipe_name": "Florentine Cookies",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/VpigSzEejaWhTCIKEMeW16JDutA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(639x0:641x2):format(webp)/image-437-1693de075bb14844aa126c693b96be49.jpg",
        "recipe_ingredients_formatted": [
            "1 ½ cups whole raw almonds",
            "½ cup unsalted butter",
            "¾ cup light brown sugar",
            "¼ cup honey",
            "½ teaspoon vanilla extract",
            "1 pinch salt",
            "3 tablespoons all-purpose flour",
            "1 cup semisweet chocolate chips, melted"
        ],
        "recipe_directions_formatted": [
            "If you asked the average person to name their five favorite cookies, lace cookies (a.k.a. Florentine cookies), wouldn't make it on to many of those lists. That's kind of surprising for several reasons: First of all, they'reincredibly simple to prepare. Also, the dough only takes minutes to make. Finally, they are very adaptable — the same technique works beautifully no matter which nuts or type of chocolate you use.",
            "Maybe it's the fact that these are closer to a candy than a cookie, but whatever the reason, they are very much underrated. You can also add \"durable\" to their list of adjectives, which is why they make for such a great edible gift.",
            "Please note: The baking time given here is only a rough estimate. Depending on the particulars of your pan, oven, and portion size, your actual time might be a few minutes off either way. So forget about time and go by appearance instead. These should be baked until golden brown with a slightly darker golden brown ring around the outside.",
            "Once they're cool and crisp, they are ready to be spread and sandwiched with chocolate. Or, if you're one of these people who are only able to eat one cookie at a time, you can drizzle the chocolate over the tops instead. Speaking of cool and crisp, while these are still warm, you can roll or bend them into whatever shapes you want. A scoop of vanilla ice cream is nice, but imagine how much nicer it would be served in an edible lace cookie cup? So, whether you make these as shown or bend them to you will, I really do hope you give them a try soon. Enjoy!",
            "For more Chef John, be sure to subscribe to Food Wishes on YouTube! Click the \"Join\" button there to get Chef John's bonus video footage and behind-the-scenes pictures, live chats, and other Food Wishes member exclusives.",
            "Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with a silicone liner (such as Silpat®).",
            "Place almonds into the bowl of a food processor; alternate pulsing and running at full speed every few seconds until finely chopped and crumblike. Be careful not to go too far; you don't want them too fine and pasty.",
            "Combine butter, brown sugar, and honey in a saucepan over medium heat. Stir a few times and cook until melted and dissolved. Bring to a boil, then carefully remove from the heat.",
            "Add vanilla extract, salt, and flour, and whisk until smooth. Add chopped almonds and mix with a spatula until everything is combined.",
            "Drop eight uniformly sized, rounded spoonfuls of batter (each about 2 teaspoons, or 15 grams) onto the prepared sheet. Fine-tune the cookie shapes and make sure they are evenly spaced.",
            "Place in the center of the preheated oven and bake until golden brown and a bit darker around the outsides, 10 to 12 minutes, rotating the pan halfway through.",
            "Remove from the oven and slide the silicone liner off the baking sheet and directly onto the countertop. Allow to sit until cool and crisp, 3 to 5 minutes, then gently peel cookies off the liner. Repeat to bake remaining batches.",
            "Spread melted chocolate over the flat side of one cookie. Place a second cookie, flat-side down, on top to make a sandwich and press very gently to seal. Repeat to form remaining cookies. Let sit until chocolate has firmed up, about 30 minutes."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Desserts",
            "Cookies",
            "International Cookie Recipes",
            "Italy"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "10 mins",
            "Total": "30 mins",
            "Servings": "36",
            "Yield": "3 dozen"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "129",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "2g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/10226/italian-anisette-cookies/",
        "recipe_name": "Italian Anisette Cookies",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/mc5oKBg7eldl7CGVNdbS2sCj0S0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1374x0:1376x2):format(webp)/6316551-a4f649859e8749c18ece175bb2eadad7.jpg",
        "recipe_ingredients_formatted": [
            "4 cups all-purpose flour",
            "1 cup white sugar",
            "1 tablespoon baking powder",
            "¾ cup vegetable oil",
            "½ cup milk",
            "2 large eggs",
            "1 tablespoon anise extract"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 375 degrees F (190 degrees C). Grease or line cookie sheets.",
            "Combine flour, sugar, and baking powder together in a large bowl. Make a well in the center and add oil, milk, eggs, and 1 tablespoon anise extract; mix together to form a workable dough. Roll dough into walnut-sized balls, flatten slightly, and place 1 inch apart onto prepared cookie sheets.",
            "Bake in the preheated oven until edges are golden, about 8 minutes.",
            "Meanwhile, make the icing: Mix confectioners' sugar, hot water, and 1 teaspoon anise extract together until smooth. Spoon or drizzle over warm cookies and allow to cool completely."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Desserts",
            "Specialty Dessert Recipes",
            "Tiramisu Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "1 hr",
            "Prep": "30 mins",
            "Cook": "30 mins",
            "Total": "2 hrs",
            "Servings": "12",
            "Yield": "12 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "568",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "10g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/8490/classic-tiramisu/",
        "recipe_name": "Classic Tiramisu",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/_0YBFlNPMZUXTvVaXz7mHsl-X2I=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/3206640-classic-tiramisu-manson.yan-1x1-1-61ddb0cb4b484299b39410de9baddaa7.jpg",
        "recipe_ingredients_formatted": [
            "6  egg yolks",
            "1 ¼ cups white sugar",
            "1 ¼ cups mascarpone cheese",
            "1 ¾ cups heavy whipping cream",
            "2 (12 ounce) packages ladyfingers",
            "⅓ cup coffee flavored liqueur",
            "1 teaspoon unsweetened cocoa powder, for dusting",
            "1 (1 ounce) square semisweet chocolate"
        ],
        "recipe_directions_formatted": [
            "Combine egg yolks and sugar in the top of a double boiler, over boiling water. Reduce heat to low, and cook for about 10 minutes, stirring constantly. Remove from heat and whip yolks until thick and lemon colored.",
            "Add mascarpone to whipped yolks. Beat until combined. In a separate bowl, whip cream to stiff peaks. Gently fold into yolk mixture and set aside.",
            "Split the lady fingers in half, and line the bottom and sides of a large glass bowl. Brush with coffee liqueur. Spoon half of the cream filling over the lady fingers. Repeat ladyfingers, coffee liqueur and filling layers. Garnish with cocoa and chocolate curls. Refrigerate several hours or overnight.",
            "To make the chocolate curls, use a vegetable peeler and run it down the edge of the chocolate bar."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "3 hrs 45 mins",
            "Prep": "20 mins",
            "Cook": "None",
            "Total": "4 hrs 5 mins",
            "Servings": "8",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "69",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "1g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/233726/fresh-strawberry-granita/",
        "recipe_name": "Fresh Strawberry Granita",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/BV4_k3cxxEBf8dOlyAqNADP5ozI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x599:1001x601):format(webp)/6629911-fresh-strawberry-granita-Yoly-1x1-1-5c3d1a9a4a2b490b81ee3aa096ef1182.jpg",
        "recipe_ingredients_formatted": [
            "2 pounds ripe strawberries, hulled and halved",
            "1 cup water",
            "⅓ cup white sugar, or to taste",
            "½ teaspoon lemon juice (Optional)",
            "¼ teaspoon balsamic vinegar (Optional)",
            "1 tiny pinch salt"
        ],
        "recipe_directions_formatted": [
            "Rinse strawberries with cold water, then drain.",
            "Place berries into a blender with water, sugar, lemon juice, balsamic vinegar, and salt. Pulse several times to get the mixture moving, then blend until smooth, about 1 minute. Pour into a large baking dish; the mixture should only be about 3/8 inch deep in the dish.",
            "Place the uncovered dish into the freezer until the mixture barely begins to freeze around the edges, about 45 minutes, it will still be slushy in the center.",
            "Keeping the mixture in the freezer, use a fork to lightly stir the frozen crystals from the edges in towards the center; mix thoroughly. Close the freezer and continue to chill until granita is nearly frozen, 30 to 40 more minutes. Mix lightly again with a fork as before, scraping the crystals loose. Repeat freezing and stirring with the fork three to four more times until the crystals are separate and the granita looks dry and fluffy.",
            "Portion granita into small serving bowls to serve.",
            "This will work with other fruit and berry purees.",
            "Hull strawberries by using the tip of small, sharp paring knife inserted at a 45-degree angle near the hull. Rotate the berry to cut out a small cone containing the hull. It saves a little bit of fruit from each strawberry.",
            "Freezing times will vary greatly depending on how cold, empty, large, etc., your freezer is. Just keep checking and forking!",
            "This recipe appeared in Allrecipes Magazine and was modified to include sparkling rosé or prosecco and fresh mint leaves."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Desserts",
            "Cookies",
            "International Cookie Recipes",
            "Italy"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "25 mins",
            "Cook": "10 mins",
            "Total": "35 mins",
            "Servings": "36",
            "Yield": "3 dozen"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "78",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "2g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/9826/italian-cookies-i/",
        "recipe_name": "Italian Cookies",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/ay59-O9B6kh3bUQPJApC_lCzQ_I=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1511x0:1513x2):format(webp)/6179214-6a855ff497d5446f8f5a914f4e0aafdb.jpg",
        "recipe_ingredients_formatted": [
            "3 cups all-purpose flour",
            "3 teaspoons baking powder",
            "½ cup unsalted butter, softened",
            "½ cup white sugar",
            "3 large eggs",
            "2 teaspoons vanilla extract"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 350 degrees F (175 degrees C). Grease two baking sheets.",
            "Combine flour and baking powder in a bowl.",
            "Beat butter and sugar in a mixing bowl with an electric mixer until smooth and creamy. Mix in eggs, one at a time, beating well after each addition. Mix in vanilla. Gradually stir in flour mixture until well blended.",
            "Roll walnut-sized portions of dough into small ropes. Shape each rope into a loop and press the ends to seal. Place 2 inches apart onto the prepared baking sheets.",
            "Bake in the preheated oven until firm and golden at the edges, 8 to 10 minutes. Remove from the oven and cool on a wire rack."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "1 hr",
            "Prep": "15 mins",
            "Cook": "1 hr 15 mins",
            "Total": "2 hrs 30 mins",
            "Servings": "40",
            "Yield": "80 (1-inch) square pieces"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "137",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "3g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/246463/torrone-italian-nut-and-nougat-confection/",
        "recipe_name": "Torrone (Italian Nut and Nougat Confection)",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/0CifYypXHrOnPp50e3EMdXoZyio=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(477x0:479x2):format(webp)/3345442_torrone-italian-nut-and-nougat-confection_chef-john-f0eda314f78d472cae4ca04003ced3c3.jpg",
        "recipe_ingredients_formatted": [
            "2  (8x10-inch) sheets wafer paper",
            "3 cups roasted almonds",
            "1 cup roasted pistachios",
            "1 ⅓ cups honey",
            "1 cup white sugar",
            "3 tablespoons white sugar",
            "2 large egg whites, at room temperature",
            "1 pinch salt",
            "1 tablespoon lemon zest",
            "¼ teaspoon vanilla extract"
        ],
        "recipe_directions_formatted": [
            "Line an 8x11-inch baking dish with plastic wrap, allowing ends to hang over the sides. Place 1 sheet wafer paper in the bottom of the lined dish. Place almonds and pistachios in a warm place to make them easier to mix in at the end.",
            "Pour honey into a heavy-bottomed pot. Add 1 cup plus 3 tablespoons sugar; cook over low heat with a spatula, stirring constantly, until mixture turns from grainy to silky and smooth, about 30 minutes. Remove the pot from heat.",
            "Place egg whites and salt in a mixing bowl. Whisk until whites form soft peaks, 3 to 4 minutes. Place the pot with honey mixture back on low heat. Gradually whisk 1/4 of the whipped egg whites into honey mixture; whisk in remaining egg whites in 3 more batches.",
            "Continue cooking over low heat, stirring constantly with a spatula, until mixture turns a brighter white and a ribbon of mixture on the surface does not immediately incorporate, about 40 minutes. You can add a few drops of mixture to a small bowl of ice cold water to test the consistency; ideally it should feel like soft clay.",
            "Whisk in lemon zest and vanilla. Add warm almonds and pistachios; stir to incorporate evenly. Transfer nougat mixture to the prepared baking dish; smooth the top with a clean, oiled spatula. Top nougat with remaining sheet wafer paper, shiny-side up. Lay plastic wrap over the top and press down evenly, tamping mixture down gently but firmly. Remove top plastic wrap.",
            "Allow nougat to sit at room temperature until cool, firm, and ready to cut, 1 or 2 hours.",
            "Lift the edges of overhanging plastic wrap to release nougat from the baking dish. Invert and remove plastic wrap from the bottom. Trim off the edges if plastic wrap is hard to remove. Cut torrone into 1-inch squares using a sharp serrated knife.",
            "If you don't have wafer paper (edible rice paper), you can spray the plastic wrap with vegetable oil. Some people use cornstarch, but I'm not a fan."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Desserts",
            "Specialty Dessert Recipes",
            "Tiramisu Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "40 mins",
            "Prep": "40 mins",
            "Cook": "25 mins",
            "Total": "1 hr 45 mins",
            "Servings": "12",
            "Yield": "1 (3-layer) 9-inch cake"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "465",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "4g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/25639/tiramisu-layer-cake/",
        "recipe_name": "Tiramisu Layer Cake",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/drVk1fhLukd5Pges9w813jFIwhw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/TiramisuLayerCakeKim-b51f80ededa24f51804257aa2bbdd1cf.jpg",
        "recipe_ingredients_formatted": [
            "1 (15.25 ounce) package moist white cake mix",
            "1 cup water",
            "3 large egg whites",
            "⅓ cup vegetable oil",
            "1 teaspoon instant coffee powder"
        ],
        "recipe_directions_formatted": [
            "In this tiramisu layer cake recipe, coffee-flavored vanilla sponge cake is layered with a creamy mascarpone filling and topped with chocolate garnishes.",
            "Tiramisu cake is a fun twist on classic Italian tiramisu. It consists of cake layers soaked in coffee syrup layered with a mascarpone filling and creamy icing. This easy recipe calls for a package of white cake mix.",
            "These are the ingredients you’ll need to make this decadent tiramisu cake recipe:",
            "You’ll find the full, step-by-step recipe below — but here’s a brief overview of what you can expect when you make homemade tiramisu layer cake:",
            "Store your leftover tiramisu cake in an airtight container in the refrigerator for up to three days.",
            "“This is my new party cake,” says Barbara L. Mcmahon. “It’s relatively easy, not too expensive, and really really tasty. I’ve also layered it in a trifle dish and it looks really pretty that way as well!!”",
            "“Elegant and delicious,” raves Gladys. “I have made this cake twice and everyone loved it both times. I followed the recipe exactly. I was a bit concerned about how long the frosting would hold up, but I found that it will last for at least two days when refrigerated.”",
            "Editorial contributions by Corey Williams",
            "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour three 9-inch pans.",
            "To make the cake: Beat cake mix, water, egg whites, and oil in a large bowl with an electric mixer on medium speed until well combined, about 2 minutes. Divide 2/3 of the batter between 2 prepared pans. Stir instant coffee into remaining batter; pour into the remaining prepared pan.",
            "Bake in the preheated oven until a toothpick inserted into the center of cakes comes out clean, 23 to 28 minutes. Cool cakes in the pans for 10 minutes, then turn out onto a wire rack to cool completely.",
            "To make the syrup: Combine brewed coffee and coffee liqueur in a measuring cup; set aside.",
            "To make the filling: Beat mascarpone, confectioners' sugar, and coffee liqueur in a medium bowl with an electric mixer on low speed until smooth. Cover with plastic wrap and place in the refrigerator to keep cool.",
            "To make the frosting: Beat cream, confectioners' sugar, and coffee liqueur in a medium bowl with an electric mixer on medium-high speed until stiff. Fold 1/2 cup frosting into chilled filling until combined. Store frosting and filling, covered, in the refrigerator to keep cool.",
            "To assemble the cake: Place 1 plain cake layer on a serving plate. Using a thin skewer, poke holes in cake, about 1 inch apart. Pour 1/3 of the coffee syrup over cake, then cover with 1/2 of the filling. Top with coffee-flavored cake layer; poke holes in cake. Pour another 1/3 of the coffee syrup over cake and cover with remaining filling. Top with remaining cake layer; poke holes in cake. Pour remaining coffee syrup on top. Spread sides and top of cake with frosting.",
            "To garnish the cake: Place cocoa powder in a sieve and lightly dust top of cake. Run a vegetable peeler down the edge of chocolate square to form curls. Scatter chocolate curls over cake.",
            "Chill cake in the refrigerator for at least 30 minutes before serving."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "25 mins",
            "Prep": "30 mins",
            "Cook": "30 mins",
            "Total": "1 hr 25 mins",
            "Servings": "12",
            "Yield": "1 3-layer, 9-inch cake"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "767",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "8g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/7871/incredibly-delicious-italian-cream-cake/",
        "recipe_name": "Incredibly Delicious Italian Cream Cake",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/5gCaAp5yCTZ0nkHzepfcOVEWtS0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/2556678-incredibly-delicious-italian-cream-cake-Yoly-1x1-2-51735f4035424c1491bb635b26d6d1b1.jpg",
        "recipe_ingredients_formatted": [
            "1 cup buttermilk",
            "1 teaspoon baking soda",
            "½ cup butter",
            "½ cup shortening",
            "2 cups white sugar",
            "5 large eggs",
            "1 teaspoon vanilla extract",
            "1 cup flaked coconut",
            "1 teaspoon baking powder",
            "2 cups all-purpose flour"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 350 degrees F (175 degrees C). Grease three 9-inch round cake pans.",
            "Make the cake: Combine buttermilk and baking soda together in a small bowl; set aside.",
            "Beat butter, shortening, and sugar together in a large bowl with an electric mixer until light and fluffy. Mix in eggs, buttermilk mixture, vanilla, coconut, baking powder, and flour; stir until just combined. Pour batter into the prepared pans.",
            "Bake in the preheated oven until a toothpick inserted into the center of the cake comes out clean, 30 to 35 minutes. Cool in the pans for 5 minutes; transfer to a wire rack and let cool completely, 20 to 25 minutes.",
            "Make the frosting (while cakes are cooling): Beat cream cheese, butter, vanilla, and confectioners' sugar in a medium bowl with an electric mixer until light and fluffy. Beat in cream, a little at a time, to attain the desired consistency. Stir in walnuts and coconut. Spread frosting between the cake layers and on the top and sides of cooled cake."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "30 mins",
            "Prep": "45 mins",
            "Cook": "45 mins",
            "Total": "2 hrs",
            "Servings": "24",
            "Yield": "2 9-inch deep-dish pies"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "352",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "13g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/9328/ricotta-pie-old-italian-recipe/",
        "recipe_name": "Ricotta Pie (Old Italian Recipe)",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/9vTXY4ZwDxfeQDJgGD4gm-_yW6g=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(511x0:513x2):format(webp)/7674026-b5b9aa67f31f429bb00c45d472d9b689.jpg",
        "recipe_ingredients_formatted": [
            "12 large eggs",
            "2 cups white sugar",
            "2 teaspoons vanilla extract",
            "3 pounds ricotta cheese",
            "¼ cup miniature semisweet chocolate chips, or to taste"
        ],
        "recipe_directions_formatted": [
            "This old-fashioned ricotta pie recipe is rich, creamy, and tastes just like it came from an Italian bakery.",
            "These are the ingredients you'll need to make this absolutely irresistible ricotta pie recipe:",
            "· Eggs: This Italian ricotta pie calls for a whopping 16 eggs (12 for the filling and four for the crust).\n· Sugar: You'll need three cups of white sugar (two for the filling and one for the crust).\n· Vanilla: Vanilla extract enhances the overall flavor of the ricotta filling and the sweet crust.\n· Ricotta: The dense, creamy filling calls for three pounds of ricotta cheese.\n· Chocolate: Semisweet chocolate chips take the decadent filling up a notch, but you can leave them out if you like.\n· Flour: The sweet crust starts with four cups of all-purpose flour.\n· Baking powder: Baking powder guarantees a tender and flaky pie crust.\n· Shortening: Shortening (instead of butter) makes the pie crust easy to roll out and it holds its shape well.\n· Milk: Brush the pie crust with milk to give it a matte finish.",
            "You'll find the full, step-by-step recipe below — but here's a brief overview of what you can expect when you make ricotta pie at home:",
            "1. Make the filling: Beat the eggs, then add sugar and vanilla. Beat in the ricotta and the chocolate chips.\n2. Make the crust: Combine the dry ingredients, cut in the shortening, then beat in the egg mixture. Divide the dough into balls, wrap in plastic, and chill.\n3. Roll and cut the crust: Roll out the dough balls and use them to line two prepared pie plates. Roll out the remaining two balls and cut into strips.\n4. Assemble the pies: Fill each of the pies then top each pie with a lattice pattern. Brush the crust with milk.\n5. Bake the pies: Bake the pies in the preheated oven until a knife inserted into the center comes out clean. Cool on wire racks, then refrigerate.",
            "Tips from recipe creator Misty:",
            "· Instead of chocolate chips, you can use 1 tablespoon of fresh lemon zest.\n· Instead of a lattice top, you can use cookie cutters and place the cutouts on the top of the pies.",
            "Allow the pie to cool completely before storing. Cover the leftovers tightly with storage wrap or foil, then store for up to three days in the refrigerator.",
            "Freezing may change the texture of the ricotta pie, but it will preserve it for up to three months. Wrap the pie tightly in storage wrap, then wrap it again in a layer of aluminum foil. Thaw the pie in the refrigerator.",
            "\"This pie was delicious and exactly what I remember from my childhood,\" according to Elaine Lienhart. \"The family loved it and requested that I make one for Thanksgiving. Next time I will cut the recipe in half and only make one pie.\"",
            "\"This recipe is almost perfect,\" says Cookin' With Lukie. \"My grandmother used to make this at Easter time. It's a delicious treat, but a very small piece goes a long way. Would I make it again? Of course I would...my Grandmother's recipe is lost to us, so this one will make up for that loss and bring smiles to my family as they enjoy this springtime treat!\"",
            "\"Amazing, delicious, easy to make,\" raves bldrdgirl. \"I'd give it 10 stars if I could! The tip to getting the crust to stay in one piece is to FOLLOW THE DIRECTIONS. You must let it chill in the fridge.\"",
            "Editorial contributions by Corey Williams",
            "Make the filling: Beat eggs, sugar, and vanilla together in a large bowl. Stir in ricotta cheese and chocolate chips; set aside.",
            "Make the crust: Combine flour, sugar, and baking powder together in a large bowl; cut in shortening until mixture resembles coarse crumbs. Mix in beaten eggs and vanilla. Divide dough into 4 balls, wrap in plastic, and chill for at least 30 minutes.",
            "Preheat the oven to 325 degrees F (165 degrees C). Grease two 9-inch, deep-dish pie plates.",
            "Roll out two dough balls and line the bottom and sides of each prepared pie plate. Try not to make the crust too thick, as it will expand during cooking. Roll the remaining two dough balls out into 10-inch circles. Cut into 1/2-inch strips with a sharp paring knife or pastry wheel.",
            "Pour ricotta filling evenly into pie crusts. Start with the longest strips of dough and lay the first 2 in an X in the center of the pie. Alternate horizontal and vertical strips, weaving them in an over-and-under pattern. Use the shortest strips for the edges of the lattice. Fold the ends of the lattice strips under the edge of the bottom crust and flute the crust; brush lattice top with milk. Arrange foil on edges of crust.",
            "Bake in the preheated oven for 20 to 30 minutes; remove foil. Rotate pies on the rack so they will bake evenly. Continue to bake until a knife inserted in the center of each pie comes out clean, 25 to 30 minutes more. Cool completely on wire racks. Refrigerate until serving."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Desserts",
            "Cookies",
            "International Cookie Recipes",
            "Italy"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "30 mins",
            "Cook": "15 mins",
            "Total": "45 mins",
            "Servings": "36",
            "Yield": "3 dozen"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "101",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "3g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/10022/pignoli-cookies-i/",
        "recipe_name": "Pignoli Cookies",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/nT72T6vILKgaE0k9YGt6n8nip1k=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/8760190-8894c6acd8664f7f852cb7521ccd3f77.jpg",
        "recipe_ingredients_formatted": [
            "cooking spray",
            "12 ounces almond paste",
            "½ cup white sugar",
            "1 cup confectioners' sugar",
            "4  egg whites, divided",
            "1 ½ cups pine nuts",
            "all-purpose flour for rolling"
        ],
        "recipe_directions_formatted": [
            "Pignoli cookies are soft, chewy, perfectly nutty, and absolutely irresistible. Reviewers say this pignoli cookie recipe creates Italian bakery-worthy results!",
            "A pignolo (\"pignoli\" when it's plural) is a traditional Italian cookie. The pine nut-studded cookies are made with egg whites and almond paste, which gives them a nutty flavor and airy texture.",
            "These are the ingredients you'll need to make this top-rated pignoli cookie recipe:",
            "· Almond paste: You can buy almond paste at the store or make your own at home.\n· Sugars: You'll need both white and confectioners' sugars.\n· Egg whites: Egg whites give the pignoli cookies a light and airy texture.\n· Pine nuts: Pine nuts are the main ingredient in pignolis! A more budget-friendly option is sliced almonds.\n· Flour: Lightly flour your hands before rolling the dough to prevent sticking.",
            "You'll find the full, step-by-step recipe below — but here's a brief overview of what you can expect when you make these pignoli cookies:",
            "1. Blend the almond paste and white sugar in a food processor.\n2. Add the confectioners' sugar and two egg whites. Blend.\n3. Roll the dough into balls.\n4. Coat each ball in egg whites, then roll in pine nuts.\n5. Arrange the dough balls on a prepared baking sheet and bake until lightly browned.",
            "Allow the pignoli cookies to cool completely. Store them in an airtight container at room temperature for up to a week. If you have to stack the cookies, make sure to place wax paper between each layer to prevent sticking.",
            "\"Absolutely wonderful,\" raves CMKONTHEGO. \"Moist and chewy with a crispy bottom — great flavor too. Just like the ones from the New York bakeries. I will make them again and again!\"",
            "\"These cookies are fantastic,\" says one Allrecipes community member. \"I've always made this recipe exactly as-is here. I've found that making everything in the food processor is the easiest way to go. Thanks so much for the recipe — it's always a hit!\"",
            "\"These came out absolutely delicious,\" according to Always Cooking Up Something. \"I had to chill the dough for about 15 minutes before it was firm enough to form the cookies, but other than that everything turned out perfect!\"",
            "Editorial contributions by Corey Williams",
            "Preheat the oven to 325 degrees F (165 degrees C). Line 2 cookie sheets with foil; lightly grease the foil with cooking spray.",
            "Place almond paste and white sugar in a food processor; blend until combined. Add confectioners' sugar and 2 egg whites; blend until smooth.",
            "Whisk remaining 2 egg whites in a small bowl. Place pine nuts on a shallow plate.",
            "With lightly floured hands, roll dough into 1-inch balls. Coat balls in egg whites, shaking off excess, then roll in pine nuts, pressing lightly to stick. Arrange balls on cookie sheets, and flatten slightly to form a 1 1/2-inch round.",
            "Bake in the preheated oven until lightly browned, 15 to 18 minutes. Let stand on cookie sheets briefly, then transfer to a wire rack to cool.",
            "If you need to keep these cookies gluten-free, use gluten-free flour when shaping the cookies."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Italian"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "None",
            "Cook": "3 hrs",
            "Total": "3 hrs",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "416",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "8g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/55609/gelato/",
        "recipe_name": "Gelato",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/hAaJwiWmoVmk2nm6BSzIZrUG0E8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(799x0:801x2):format(webp)/4517634-gelato-Buckwheat-Queen-4x3-1-f5f732166ec64620b2a438391cbd0583.jpg",
        "recipe_ingredients_formatted": [
            "2 cups milk",
            "1 cup heavy cream",
            "4  egg yolks",
            "½ cup sugar"
        ],
        "recipe_directions_formatted": [
            "Mix milk and cream in a medium saucepan. Warm until foam forms around the edges. Remove from heat.",
            "Beat egg yolks and sugar until frothy in a large bowl. Gradually pour the warm milk into egg yolks and sugar, whisking constantly. Return mixture to saucepan; cook over medium heat, stirring with a wooden spoon until the mixture gels slightly and coats the back of the spoon. If small egg lumps begin to show, remove from heat immediately.",
            "Pour the mixture through a sieve or fine strainer into a bowl. Cover, and chill for several hours or overnight.",
            "Pour the mixture into an ice cream maker, and freeze according to the manufacturer's instructions. Transfer to a sealed container, and freeze until firm. If the gelato is too firm, place it in the refrigerator until it reaches the desired consistency."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Christmas",
            "Desserts",
            "Christmas Cookie Recipes",
            "Pizzelle"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "35 mins",
            "Total": "50 mins",
            "Servings": "24",
            "Yield": "2 dozen"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "102",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "2g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/10220/pizzelles-iii/",
        "recipe_name": "Pizzelle",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/t3aBwk1_4lnhBhkOAPqbtHuJfhE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(899x0:901x2):format(webp)/616683-pizzelles-iii-ThatStephanie-1x1-1-2f7ef202c01d49b4aa6cefd0e87968c4.jpg",
        "recipe_ingredients_formatted": [
            "3 large eggs",
            "¾ cup white sugar",
            "½ cup butter, melted",
            "1 tablespoon vanilla extract",
            "1 ¾ cups all-purpose flour",
            "2 teaspoons baking powder",
            "2 teaspoons vegetable oil, or as needed"
        ],
        "recipe_directions_formatted": [
            "This pizzelle recipe creates light, crispy, and beautifully elegant Italian cookies every time. It'll quickly become a holiday season staple in your household.",
            "Pizzelles are thin Italian waffle cookies with a crisp texture. They're made with pizzelle irons and feature intricate designs. Pizzelle cookies, which are commonly served during the Christmas and Easter holidays, can be served flat or molded into shapes while they're still warm.",
            "Believe it or not, you don't need a lot of ingredients to make this impressive pizzelle recipe. Here's what to add to your grocery list:",
            "· Eggs: Eggs lend moisture and act as a binding agent, which means they help hold the dough together.\n· Sugar: Sweeten things up with white sugar.\n· Butter: You'll need a stick of melted butter.\n· Vanilla: A tablespoon of vanilla extract enhances the overall flavor of the pizzelle cookies.\n· Flour: All-purpose flour creates structure in the cookie dough.\n· Baking powder: Baking powder acts as a leavener, which means it helps the cookies rise slightly.\n· Oil: Make sure to brush your pizzelle iron with vegetable oil to keep the cookies from sticking.",
            "You'll find the full, step-by-step recipe below — but here's a brief overview of what you can expect when you make these gorgeous pizzelles:",
            "1. Beat the eggs and sugar, then stir in the butter and vanilla.\n2. Add the flour and baking powder.\n3. Spoon the batter onto the prepared pizzelle iron.\n4. Close the iron and bake for 30-45 seconds.",
            "You can also make chocolate pizzelles by making a few changes to this recipe. To make chocolate pizzelles:",
            "1. Increase the sugar by another ¼ cup.\n2. Add ¼ cup cocoa powder sifted together in the flour-baking powder mixture with an extra ¼ teaspoon baking powder",
            "Make sure the cookies are completely cool before storage. Place them in an airtight container or zip-top storage bag and store at room temperature for up to two weeks.",
            "Yes, you can freeze pizzelles. While they won't be quite as crisp as freshly baked cookies, they'll still be delicious! Arrange the cooled cookies on a baking sheet, cover, and flash freeze for a few hours or up to overnight. Transfer them to a freezer-safe container or zip-top bags and freeze for up to three months. Thaw at room temperature.",
            "\"I have never made these before and enjoyed making them this morning,\" says juliekay. \"I used vanilla and a very small amount of anise seeds. The flavor and texture was great. I look forward to trying making these cookies again.\"",
            "I love this recipe,\" raves noelran9. \"I can't wait to try some different variations people have suggested. I made them exactly as the recipe stated and they were perfect!\"",
            "\"These were just outstanding and I have been eating these cookies my whole life,\" according to Lauren M. \"I followed the recipe exactly the first time and the cookies came out light and crispy and so good. They were very easy to make even on my very old pizzelle iron.\"",
            "Editorial contributions by Corey Williams",
            "Beat eggs and sugar in a large bowl until thick. Stir in melted butter and vanilla. Sift together flour and baking powder, and blend into the batter until smooth.",
            "Heat the pizzelle iron, and brush with oil. Drop about one tablespoon of batter onto each circle on the iron. You may need to experiment with the amount of batter and baking time depending on the iron. Bake for 20 to 45 seconds or until steam is no longer coming out of the iron. Carefully remove cookie from the iron and repeat with remaining batter.",
            "Cool completely before storing in an airtight container.",
            "To try the chocolate version, increase the sugar by another 1/4 cup. Then add 1/4 cup cocoa powder sifted together in the flour-baking powder mixture with an extra 1/4 teaspoon baking powder as well. I find that for the chocolate mixture, the iron must be well oiled to start, and brushed with more as needed."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Desserts",
            "Cakes",
            "Cheesecake Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "4 hrs",
            "Prep": "15 mins",
            "Cook": "2 hrs",
            "Total": "6 hrs 15 mins",
            "Servings": "8",
            "Yield": "1 9-inch cheesecake"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "704",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "16g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/154297/italian-cream-cheese-and-ricotta-cheesecake/",
        "recipe_name": "Italian Cream Cheese and Ricotta Cheesecake",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/xmB5l7Dor1GjFGAc698q9rnpI5g=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/403548-31849bcc16f044a0a9cbaced9ec4cae9.jpg",
        "recipe_ingredients_formatted": [
            "2 (8 ounce) packages cream cheese, softened",
            "1 (16 ounce) container ricotta cheese",
            "4 large eggs",
            "1 ½ cups white sugar",
            "½ cup butter, melted and cooled",
            "3 tablespoons flour",
            "3 tablespoons cornstarch",
            "1 tablespoon lemon juice",
            "1 teaspoon vanilla extract",
            "1 pint sour cream"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9-inch springform pan.",
            "Mix cream cheese and ricotta cheese together in a mixing bowl until well combined. Add eggs, sugar, butter, flour, cornstarch, lemon juice, and vanilla; mix to combine. Stir in sour cream and pour into the prepared pan.",
            "Bake in the preheated oven for 1 hour. Turn the oven off; allow cheesecake to cool in the oven with the door closed for 1 hour more to prevent cracking. Cool cheesecake completely in the refrigerator before serving."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Cuisine",
            "European",
            "Italian",
            "Desserts"
        ],
        "recipe_details_formatted": {
            "Additional Time": "2 hrs",
            "Prep": "45 mins",
            "Cook": "1 hr",
            "Total": "3 hrs 45 mins",
            "Servings": "30",
            "Yield": "30 cannoli"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "402",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "5g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/88849/cannoli/",
        "recipe_name": "Cannoli",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/kqTw3KYx58GFwLEKuAnycqlhGUI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/865595-0c435d944e5d4817a9797e3def643282.jpg",
        "recipe_ingredients_formatted": [
            "3 cups all-purpose flour",
            "¼ cup white sugar",
            "¼ teaspoon ground cinnamon",
            "3 tablespoons shortening",
            "½ cup sweet Marsala wine",
            "2 tablespoons water",
            "1 tablespoon distilled white vinegar",
            "1 large egg",
            "1  egg yolk",
            "1  egg white",
            "1 quart oil for frying, or as needed"
        ],
        "recipe_directions_formatted": [
            "You might be intimidated by the idea of making cannolis at home, but you shouldn’t be! This cannoli recipe proves anyone can make the iconic Italian treat.",
            "A cannoli is a tube-shaped Italian dessert that consists of fried pastry dough stuffed with a sweet, creamy cheese filling.",
            "Learn more: What Is a Cannoli and What Does It Taste Like?",
            "You'll find a detailed ingredient list and step-by-step instructions in the recipe below, but let's go over the basics:",
            "These are the ingredients you’ll need for this classic cannoli recipe:",
            "Here’s a brief overview of what you can expect when you make these homemade cannolis:",
            "“If you’re feeling the need to channel your inner Italian grandmother or if you’re just looking for the perfect cannoli recipe, this is the one to try,” according to culinary producer Nicole McLaughlin (a.k.a. NicoleMcMom). Here are a few of her best cannoli tips:",
            "Yes, cannolis need to be refrigerated. Don’t leave them at room temperature for more than two to three hours at a time. Store them in an airtight container lined with paper towels in the refrigerator for up to one week.",
            "You can freeze cannolis for up to three months. Thaw them overnight in the refrigerator.",
            "“Thanks for this recipe, it reminds me of my grandfather's recipe,” says touchofspice. “Delish! It also brought back many wonderful childhood memories!”",
            "“They were so delicious that I even surprised myself,” according to Itza Mee. “The recipe was easy to follow and I will definitely be making them again.”",
            "“The shells are very easy and flavorful,” raves MariaC. “You do need to roll out the dough very thin. I don't have a pasta maker, but I do use my tortilla press and it works great at achieving a thin disk.",
            "Editorial contributions by Corey Williams",
            "Make shells: Mix flour, sugar, and cinnamon together in a medium bowl. Cut in shortening until crumbly.",
            "Make a well in the center and add Marsala wine, water, vinegar, egg, and egg yolk.",
            "Mix with a fork until the dough becomes stiff, then finish kneading it by hand on a clean surface, adding a bit more water if needed for about 10 minutes. Cover with plastic wrap and refrigerate for 1 to 2 hours.",
            "Divide cannoli dough into three balls; flatten each one just enough to get through the pasta machine. Roll a ball of dough through successively thinner settings until you have reached the thinnest setting. Dust lightly with flour if necessary.",
            "Place the sheet of dough on a lightly floured surface. Using a cutter or large glass, cut out 4 to 5-inch circles.",
            "Dust the circles with a light coating of flour. This will help you later in removing the shells from the tubes. Roll dough around cannoli tubes, sealing the edge with a bit of egg white. Repeat with remaining dough balls.",
            "Heat oil in a deep fryer or deep skillet to 375 degrees F (190 degrees C).",
            "Fry shells on the tubes in hot oil, a few at a time, until golden, about 2 to 3 minutes. Use tongs to turn as needed. Remove shells carefully using tongs, and place them on a cooling rack set over paper towels.",
            "Cool just long enough that you can handle the tubes, then carefully twist the tube to remove the shell. Using a tea towel may help you get a better grip. Wash or wipe off the tubes, and use them for more shells. Cooled shells can be placed in an airtight container and kept for up to 2 months. You should only fill them immediately or up to 1 hour before serving.",
            "Make filling: Mix ricotta cheese and confectioners' sugar together in a large bowl until well combined. Fold in chocolate and lemon zest.",
            "Transfer mixture into a pastry bag and pipe into shells, filling from the center to one end, then doing the same from the other side. Dust with additional confectioners' sugar to serve, if you like."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Desserts",
            "Cookies",
            "International Cookie Recipes",
            "Italy"
        ],
        "recipe_details_formatted": {
            "Additional Time": "15 mins",
            "Prep": "45 mins",
            "Cook": "15 mins",
            "Total": "1 hr 15 mins",
            "Servings": "80",
            "Yield": "80 cookies"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "70",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "1g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/10431/italian-wedding-cookies-iii/",
        "recipe_name": "Italian Wedding Cookies",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/oOkzngc4mSnmTRo3jHnAhPNZ9EM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(959x841:961x843):format(webp)/AR_GC_ItalianWeddingCookies_stills_DSC01074-2000-8c88bfed9180469eace7b62ef1779aee.jpg",
        "recipe_ingredients_formatted": [
            "1 ½ cups unsalted butter",
            "¾ cup confectioners' sugar",
            "¾ teaspoon salt",
            "1 ½ cups finely ground almonds",
            "4 ½ teaspoons vanilla extract",
            "3 cups sifted all-purpose flour",
            "⅓ cup confectioners' sugar for rolling"
        ],
        "recipe_directions_formatted": [
            "Italian wedding cookies are balls of buttery goodness rolled in powdered sugar. What's not to love?",
            "You'll need just six easy-to-find ingredients to make this classic Italian wedding cookie recipe:",
            "· Butter: This Italian wedding cookie dough starts with three sticks of unsalted butter.\n· Confectioners' sugar: Confectioners' sugar blends perfectly into these melt-in-your-mouth cookies.\n· Salt: Salt enhances the flavors of the other ingredients, but they won't make your cookies taste salty.\n· Almonds: Finely ground almonds are the key ingredient in traditional Italian wedding cookies.\n· Vanilla: A hefty dose of vanilla extract enhances the overall flavor of the cookies.\n· Flour: All-purpose flour creates structure and helps hold the cookie dough together.",
            "You'll find the full, step-by-step recipe below — but here's a brief overview of what you can expect when you make these Italian wedding cookies:",
            "1. Beat the butter, sugar, and salt.\n2. Mix in the almonds and vanilla, then gradually add the flour.\n3. Shape the dough into balls and bake until lightly browned.\n4. Roll the warm cookies in confectioners' sugar.",
            "\"There's not a Christmas that goes by that we don't enjoy a tin full of Italian wedding cookies,\" says culinary producer Nicole McLaughlin (a.k.a. NicoleMcMom). Here are a few of Nicole's favorite tips and tricks for baking the perfect Italian wedding cookies every time:",
            "· The cookie dough won't spread out much, so don't worry — you'll be able to fit quite a few on one baking sheet, according to Nicole.\n· Let the cookies cool until they're just cool enough to handle. They still need to be quite warm to hang onto all that powdered sugar!\n· \"Bring in the family,\" Nicole advises. \"Because this one batch makes a whole lot of cookies.\"",
            "You can store Italian wedding cookies in an airtight container at room temperature for up to a week. If you stack the cookies, place a piece of parchment paper between each layer to prevent sticking.",
            "Yes, you can freeze Italian wedding cookies — but it's best to freeze the dough before baking and rolling in powdered sugar.",
            "Arrange the dough balls on a baking sheet, cover, and freeze for a few hours or up to overnight. When the dough is frozen, transfer to zip-top bags or another freezer-safe container. Thaw in the refrigerator overnight, then bake according to the instructions.",
            "\"I make these frequently, and they always go fast,\" says pam. \"My variation is that instead of using almonds, I use finely ground pecans. Delicious!\"",
            "\"Very light, delicious cookies,\" according to per464. \"One tip: Use a strainer to sprinkle with confectioners sugar after baking. Less breakage!\"",
            "\"My family loved these cookies,\" raves ErichNJ. \"The flavor is simple and subtle. I halved the recipe and omitted the salt in favor of using salted butter.\"",
            "Editorial contributions by Corey Williams",
            "Preheat the oven to 325 degrees F (165 degrees C).",
            "Place butter, 3/4 cup confectioners' sugar, and salt in a large bowl; beat with an electric mixer until smooth and creamy, about 2 to 3 minutes. Mix in almonds and vanilla. Blend in flour gradually until well-combined.",
            "Shape into balls (or crescents) using about 1 teaspoon for each cookie; place 1 inch apart on ungreased cookie sheets.",
            "Bake in the preheated oven until just browned, 15 to 20 minutes.",
            "Let sit until slightly cooled, about 15 minutes. Roll cookies in remaining confectioners' sugar."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Desserts",
            "Cookies",
            "Biscotti Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "15 mins",
            "Prep": "15 mins",
            "Cook": "40 mins",
            "Total": "1 hr 10 mins",
            "Servings": "36",
            "Yield": "36 cookies"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "83",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "1g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/17241/biscotti/",
        "recipe_name": "Biscotti",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/m-fuy0MP8TdEv8xoZ5SQLQj2qJY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1151x0:1153x2):format(webp)/8927344-8da7802af20f4d868ea9230a58666ac5.jpg",
        "recipe_ingredients_formatted": [
            "1 cup white sugar",
            "½ cup vegetable oil",
            "3 large eggs",
            "1 tablespoon anise extract, or 3 drops anise oil",
            "3 ¼ cups all-purpose flour",
            "1 tablespoon baking powder"
        ],
        "recipe_directions_formatted": [
            "Homemade biscotti is easier to make than you think! With this top-rated recipe, you can make bakery-worthy biscotti in the comfort of your own kitchen.",
            "Biscotti are Italian almond cookies. They are baked twice, which gives them their signature hard and crunchy texture. Biscotti are traditionally dipping in a drink before eating.",
            "You’ll need just six ingredients to make this biscotti recipe:",
            "You’ll find the full, step-by-step recipe below — but here’s a brief overview of what you can expect when you make homemade biscotti:",
            "In Italy, biscotti are often dipped in wine (such as Vin Santo, a dessert wine). Biscotti also pairs well with a cup of coffee or a cappuccino. Dunk the cookies in your hot drink of choice and enjoy!",
            "Your homemade biscotti will last for up to one month in an airtight container at room temperature. If you want to keep the biscotti longer, you can freeze it for up to three months.",
            "“I didn’t change a thing,” says Gilmour. “This is my basic go-to recipe for biscotti. Sometimes I add different flavors and add chocolate drizzle or a vanilla drizzle, but this basic recipe is the absolute best!”",
            "“Great recipe that was easy to make,” raves Laurahallie. “I substituted almond extract for the anise and used olive oil since I didn’t have any vegetable oil.”",
            "“Perfectly crunchy, just like from a professional,” according to Dana. “Received many compliments. The only change I made was adding a cup of chopped almonds. People asked for the recipe so I will be passing it on.”",
            "Editorial contributions by Corey Williams",
            "Preheat the oven to 375 degrees F (190 degrees C). Grease two cookie sheets or line with parchment paper.",
            "Beat sugar, oil, eggs, and anise extract together in a medium bowl until well-blended. Combine flour and baking powder in a separate bowl; stir into egg mixture to form a heavy dough.",
            "Divide dough into two equal pieces. Form each piece into a log the length of a cookie sheet. Place one log on each of the prepared sheets; and press dough down to 1/2-inch thickness.",
            "Bake in the preheated oven until golden brown, 25 to 30 minutes. Transfer logs to wire racks; let sit until cool enough to handle, about 15 minutes.",
            "Slice each log crosswise into about eighteen 1/2-inch-thick slices. Place slices cut-sides up back on the cookie sheets.",
            "Bake until lightly toasted and golden brown, 6 to 10 minutes per side."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Cuisine",
            "European",
            "Italian",
            "Desserts"
        ],
        "recipe_details_formatted": {
            "Additional Time": "4 hrs 20 mins",
            "Prep": "5 mins",
            "Cook": "10 mins",
            "Total": "4 hrs 35 mins",
            "Servings": "6",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "418",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "4g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/72567/panna-cotta/",
        "recipe_name": "Panna Cotta",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/pm7hFGEQSfoytxd5D-_1J0axbQM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1099x1179:1101x1181):format(webp)/5600811-panna-cotta-Erinna1-1x1-1-3dedd99f2271433e816543e374d8be61.jpg",
        "recipe_ingredients_formatted": [
            "⅓ cup skim milk",
            "1 (.25 ounce) envelope unflavored gelatin",
            "2 ½ cups heavy cream",
            "½ cup white sugar",
            "1 ½ teaspoons vanilla extract"
        ],
        "recipe_directions_formatted": [
            "Pour milk into a small bowl. Sprinkle gelatin powder over milk and stir until combined. Set aside.",
            "Stir heavy cream and sugar together in a saucepan. Set over medium heat and bring to a boil; watch carefully as the cream can quickly bubble up and boil over.",
            "Immediately stir gelatin mixture into boiling cream, stirring until completely dissolved. Cook and stir for 1 minute.",
            "Remove the pan from the heat and stir in vanilla.",
            "Pour cream mixture into 6 individual ramekins. Leave to cool, uncovered, until no longer warm, about 20 minutes.",
            "When cool, cover with plastic wrap. Refrigerate until set, at least 4 hours but preferably overnight."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Desserts",
            "Specialty Dessert Recipes",
            "Tiramisu Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "5 hrs",
            "Prep": "30 mins",
            "Cook": "5 mins",
            "Total": "5 hrs 35 mins",
            "Servings": "12",
            "Yield": "1 7x11-inch tiramisu"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "387",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "7g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/21412/tiramisu-ii/",
        "recipe_name": "Tiramisu",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/zU3lJ09TM7fWH82VXtii7f0yIlU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/21412-tiramisu-ii-DDMFS-4x3-cb78d4ad0e75477ebc2a16968c508fde.jpg",
        "recipe_ingredients_formatted": [
            "6 large egg yolks",
            "¾ cup white sugar",
            "⅔ cup milk",
            "1 ¼ cups heavy cream",
            "½ teaspoon vanilla extract",
            "1 pound mascarpone cheese, at room temperature",
            "¼ cup strong brewed coffee, at room temperature",
            "2 tablespoons rum",
            "2 (3 ounce) packages ladyfinger cookies",
            "1 tablespoon unsweetened cocoa powder"
        ],
        "recipe_directions_formatted": [
            "Classic tiramisu, with its irresistible coffee flavor and lightly sweetened mascarpone, will never go out of style. This tiramisu recipe is a no-bake dessert that's sure to impress even the pickiest of eaters.",
            "Tiramisu is a coffee-flavored dessert that features layers of homemade whipped cream, an egg yolk-enriched mascarpone filling, and coffee-soaked ladyfingers.",
            "Tiramisu has Italian origins. The famous Italian restaurateur Ado Campeol is credited with its invention in the 1970s. In fact, he was widely known as \"the father of tiramisu.\" The word \"tiramisu\" translates to \"pick-me-up.\"",
            "Not sure how to pronounce tiramisu? Order in confidence by saying \"tee-ruh-mee-soo.\"",
            "Tiramisu usually contains alcohol. Marsala wine is the traditional choice, but this recipe calls for a mixture of strong coffee and rum. If you prefer not to use alcohol, just leave it out. It will still be delicious with just the coffee alone (just make sure the coffee is extra strong).",
            "Here's what you'll need to make this top-rated tiramisu recipe:",
            "Ready to make the best tiramisu of your life? You'll find the full recipe below, but here's what you can expect when you make this classic tiramisu recipe:",
            "Tiramisu is served chilled, so refrigerate the dessert (as well as any leftovers) immediately. Store in an airtight container in the fridge for up to four days.",
            "Yes, you can absolutely freeze tiramisu. Wrap the tiramisu in a layer of plastic wrap and then a layer of aluminum foil. Freeze for up to three months. Thaw in the fridge overnight.",
            "\"I followed the instructions and I got a delicious tiramisu cake,\" raves giginium. \"I followed the recommendations left by one of the reviewers and left the cake in the fridge for one night before eating it. The rum soaked through the ladyfingers and the flavor was wonderful.\"",
            "\"I live in a rather small town, over an hour drive to a grocery store that sells mascarpone and ladyfingers,\" says Tami. \"So I made the substitute mascarpone (found on this website) and used pound cake cut into ¼-inch slices and it still turned out WONDERFUL!\"",
            "\"This is my absolute favorite, tried-and-true recipe for tiramisu,\" according to Allie Kate Paterson. \"It is better-than-restaurant quality and so easy to make! The hardest part about making it is keeping your hands off of it while it sets in the fridge. The only tweak I make to this recipe is using Kahlua instead of plain rum.\"",
            "Editorial contributions by Corey Williams",
            "Whisk together egg yolks and sugar in a medium saucepan until well blended.",
            "Whisk in milk and cook over medium heat, stirring constantly, until mixture comes to a boil.",
            "Boil gently for 1 minute, then remove from the heat and allow to cool slightly.",
            "Cover tightly and chill in the refrigerator for 1 hour.",
            "Beat cream and vanilla in a medium bowl with an electric mixer until stiff peaks form.",
            "Remove egg yolk mixture from the refrigerator; add mascarpone cheese and whisk until smooth.",
            "Combine coffee and rum in a small bowl. Split ladyfingers in half lengthwise and drizzle with the coffee mixture. Arrange 1/2 of the soaked ladyfingers in the bottom of a 7x11-inch dish.",
            "Spread 1/2 of the mascarpone mixture over the ladyfingers, then spread 1/2 of the whipped cream over top. Repeat layers once more.",
            "Sprinkle cocoa powder over top.",
            "Cover and refrigerate until set, 4 to 6 hours.",
            "Enjoy!"
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Desserts",
            "Frozen Dessert Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "10 mins",
            "Total": "4 hrs 30 mins",
            "Servings": "10",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "173",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "3g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/8503963/tiramoussa-semifreddo-frozen-italian-coffee-dessert/",
        "recipe_name": "Tiramoussa Semifreddo – Frozen Italian Coffee Dessert",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/2zTntQHozuZMR98N-VVn9cYK3ZY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/8503963-tiramoussa-semifreddo-frozen-italian-coffee-dessert-hero-02-VAT-4x3-da578a6aaa6c4cf9a6abe76cbd4fea50.jpg",
        "recipe_ingredients_formatted": [
            "4 large eggs, separated",
            "2 ½ teaspoons  instant dark roast coffee",
            "½ cup white sugar",
            "1 tablespoon marsala wine",
            "¼ pinch salt",
            "1 ¼ cups heavy cream"
        ],
        "recipe_directions_formatted": [
            "Tiramoussa Semifreddo – Hopefully Hand Made",
            "As you're probably starting to realize, I really love the flavor combinations in tiramisu, and I've featured them in multiple video recipes. While I love the classic version, I'm not the biggest fan of soggy ladyfinger cookies in a dessert, which is something I think I caught from Michele, but anyway, I love the combination of coffee and marsala wine in any sweet treat. Especially if that sweet treat is a feather-light semifreddo.",
            "If you're not familiar, semifreddo is basically a frozen mousse, hence the recipe's name, and it's probably the easiest way to make something similar to ice cream without an ice cream maker, or any other special equipment. You do need a few mixing bowls, and the ability to work a whisk, or an electric mixer, but other than that, the procedure is dead simple.",
            "Regarding the electric mixer, I much prefer to do this by hand, since both the whites and cream only take a few minutes to whip up, and you're much less likely to over-whisk. If you go too far with the cream, you'll be enjoying butter, and over-whipped whites become dry and grainy, and more difficult to fold in. So, don't do either of those things. But, whether you enjoy the convenience of power tools, or go manual, I really loved this technique, and this great dessert, and hope you give it a try soon. Enjoy!",
            "Gather all ingredients.",
            "Combine egg yolks, instant dark roast coffee, marsala wine, and sugar in a metal bowl and whisk together until smooth.",
            "Place bowl in the top of a double boiler over lightly simmering water. Whisk constantly until mixture thickens and drippings from the whisk form ribbons on the surface that are visible for 1/2 second to 1 second, about 10 minutes. If you are \"brave\", you can set the bowl directly over medium-low heat and thicken the egg cream that way, but you have to be careful so you don't end up with scrambled eggs. This last method is slightly faster and will take about 6 to 7 minutes.",
            "Beat egg whites in a glass, metal, or ceramic bowl until foamy. Gradually add salt and continue to beat until stiff peaks form. Set aside.",
            "Beat heavy cream in a chilled glass or metal bowl with an electric mixer until medium-stiff peaks form.",
            "Using a spatula, fold in egg yolk mixture until combined.",
            "Add half of the egg whites and fold in until combined. Then fold in remaining egg whites until well combined.",
            "Transfer mixture into small 4 ounce jam jars and close with lids. Freeze for 4 hours or overnight.",
            "Garnish and enjoy!",
            "I used Starbuck's® Dark Italian Roast Instant coffee.",
            "The salt amount added to the egg whites is NOT a full \"pinch.\" It is a very small pinch, like a 1/4 of a pinch. May be omitted.",
            "This can be also made by pouring the mixture into a cold, plastic lined loaf pan, and then served by cutting it into slices once frozen.",
            "Shaved chocolate, cookie crumbs, or crushed candy bars can be folded in at the end for a more decadent dessert."
        ]
    }
]