[
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Meat and Poultry",
            "Lamb",
            "Leg"
        ],
        "recipe_details_formatted": {
            "Additional Time": "5 mins",
            "Prep": "15 mins",
            "Cook": "2 hrs",
            "Total": "2 hrs 20 mins",
            "Servings": "6",
            "Yield": "6 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "514",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "46g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/163691/dragans-leg-of-lamb-with-garlic-and-beer/",
        "recipe_name": "Dragan's Leg of Lamb with Garlic and Beer",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/_8Ntk6O_D4EK_1XwUjF9S8yy2VI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1151x0:1153x2):format(webp)/5281586-e8b8ad3a618945d4bbb2c8836c282c92.jpg",
        "recipe_ingredients_formatted": [
            "1 pound new potatoes",
            "12 ounces baby carrots",
            "1 (5 pound) leg of lamb",
            "30 cloves garlic, peeled",
            "salt and pepper to taste",
            "¼ cup coarse-grain brown mustard",
            "1 cup beer"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 400 degrees F (200 degrees C). Bring a large pot of water to a boil. Add the potatoes and carrots; boil for about 3 minutes. Drain and set aside.",
            "Rinse the leg of lamb and pat dry. Place it in a roasting pan and season generously with salt and pepper. Rub the salt and pepper into the meat. Use a small knife to make incisions big enough for a garlic clove to fit in all over the leg. Stuff the garlic cloves into the holes. Spoon the mustard over the lamb and rub it in as well.",
            "Roast, uncovered, in the preheated oven for about 30 minutes. Reduce the oven temperature to 375 degrees F (190 degrees C) Add the potatoes and carrots to the roasting pan. Baste the lamb with beer, reserving the rest for basting at 20 minute intervals.",
            "Continue to roast the lamb until the internal temperature reaches at least 140 degrees F (60 degrees C) for medium rare, about 1 1/2 hours longer. Remove from the oven and allow to rest for at least 5 minutes before carving. Spoon the pan drippings over the meat and vegetables when serving."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Everyday Cooking",
            "Sheet Pan Dinner Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "20 mins",
            "Total": "40 mins",
            "Servings": "6",
            "Yield": "6 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "441",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "30g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/285076/sheet-pan-chicken-breast-with-feta-and-vegetables/",
        "recipe_name": "Sheet Pan Chicken Breast with Feta and Vegetables",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/NpDI5CxSS6Ia8hCIQABECM85X2M=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/9345315-02f8ca6b18284c2082663d59c8a76570.jpg",
        "recipe_ingredients_formatted": [
            "1 tablespoon vegetable oil",
            "2 pounds boneless chicken breast cut into 1-inch cubes",
            "12 ounces mini bell peppers, halved lengthwise and seeded",
            "1 medium white onion, quartered",
            "½ cup Italian-style salad dressing",
            "6 ounces crumbled feta cheese",
            "2 teaspoons dried oregano"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 375 degrees F (190 degrees C). Lightly oil a sheet pan.",
            "Spread out chicken, peppers, and onion across the sheet pan. Sprinkle with Italian dressing, feta cheese, and oregano; combine gently.",
            "Bake in the preheated oven until chicken is no longer pink in the center and the juices run clear, 20 to 25 minutes. An instant-read thermometer inserted into the center of a chicken breast should read at least 165 degrees F (74 degrees C)."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Meat and Poultry",
            "Chicken",
            "Baked and Roasted",
            "Thighs"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "50 mins",
            "Total": "1 hr 10 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "449",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "29g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/286355/lemon-yogurt-and-dill-chicken-thighs-with-roasted-veggies/",
        "recipe_name": "Lemon, Yogurt, and Dill Chicken Thighs with Roasted Veggies",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/dhEmpuOgK1qZu_uVwYL0lO1nkMQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/9443408-ee58457f6fd746e39c06f9f052ffb5e7.jpg",
        "recipe_ingredients_formatted": [
            "3 small russet potatoes, cut into 1/2-inch wedges",
            "1 large onion, cut into 1/2-inch pieces",
            "2 large carrots, cut into 1/2-inch chunks",
            "5 large radishes, trimmed and cut into wedges",
            "1 ½ tablespoons vegetable oil",
            "1 teaspoon dried dill weed",
            "½ teaspoon kosher salt, or to taste",
            "¼ teaspoon fresh cracked black pepper, or to taste"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 400 degrees F (200 degrees C). Lightly grease a rimmed baking sheet.",
            "Place potatoes, onion, carrots, and radishes in a large bowl. Drizzle with oil, and toss to coat. Sprinkle with 1 teaspoon dill, 1/2 teaspoon kosher salt, and 1/4 teaspoon black pepper. Toss again to coat. Pour veggies out onto the prepared baking sheet.",
            "Bake in the preheated oven for 20 minutes.",
            "While the veggies bake, prepare the chicken. In the same bowl the veggies were in, add the Greek yogurt, lemon zest, lemon juice, 1 teaspoon dill, 1/2 teaspoon kosher salt, onion powder, garlic powder, and 1/4 teaspoon black pepper. Mix until thoroughly combined. Dip each chicken thigh into the yogurt mixture, making sure each one is evenly coated.",
            "Remove pan from the oven, and gently push the veggies to the sides of the pan, leaving room in the middle for the chicken thighs. Place the thighs in the middle of the baking sheet, and place pan back into the oven until chicken is no longer pink in the center, and veggies are tender, 30 to 40 minutes more. An instant-read thermometer inserted into the center of each thigh should read at least 165 degrees F (74 degrees C). If desired, place pan beneath broiler, and broil chicken for a few minutes to brown the chicken. Season with additional salt and pepper to taste before serving."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Everyday Cooking",
            "Sheet Pan Dinner Recipes"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/gallery/vegan-sheet-pan-dinners/",
        "recipe_name": "8 Ultra Easy Vegan Sheet Pan Dinners",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/xSfdXvawvOScQsacGzPGct80GL8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(438x0:440x2):format(webp)/5150909-b75e49352b2043e1a31b7c4f967d91dd.jpg",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "No meat, dairy, or eggs? No problem! Vegan cooking doesn't have to be complicated, which is highlighted by these simple vegan dinner recipes that are made entirely on a sheet pan. Roasted veggies, legumes, and seasonings make for bold dinners that the whole family, whether vegan or not, will love. Cooking them on a sheet pan makes for fast and nearly-effortless cleanup.",
            "You'll never settle for a skimpy salad again after enjoying this filling vegetable bowl. Zucchini, potatoes, and garlic are all roasted together before getting layered up with tomatoes, arugula, and a tart balsamic dressing.",
            "Bright, zippy, and a little nutty, the lemon tahini sauce for this recipe takes it from basic to mouthwatering. It's drizzled over three types of potatoes — purple, sweet, and red — along with cauliflower and Brussels sprouts.",
            "Smoked paprika adds a bold smokiness to these roasted Brussels sprouts and butternut squash. To make it a more hearty meal, feel free to add a can of drained chickpeas or marinated tofu in to the last 10 minutes of roasting.",
            "This accidentally vegan recipe is a French classic. \"The veggies are just bursting with flavor and the texture is perfect,\" says reviewer Buckwheat Queen. Serve with a slice of hearty bread for sopping up all the extra veggie juices.",
            "You'll have no problem getting your daily vegetable intake with this brightly colored and flavored dish. A trio of bell peppers are roasted along with zucchini, tomatoes, and onions. Serve over couscous or rice for a well-rounded meal.",
            "Bold in both appearance and taste, this summertime recipe is just perfect for using up vegetables from the farmers' market. \"Easy to make, inexpensive, and an instant hit with the family,\" says JayPee. \"Clean up took 1 minute.\"",
            "This scrumptious dinner for two can be whipped up in just over half an hour. Chickpeas, cauliflower, and tomatoes roast to perfection before getting drizzled with lime and topped with fresh cilantro. This dish can be eaten as is, or served with tortillas for some simple tacos.",
            "Root vegetables are the stars of this simple sheet pan dinner. Butternut squash, carrots, onions, and two types of potatoes are cooked up with chewy chickpeas for a satisfying vegan main dish."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Meat and Poultry",
            "Chicken",
            "Chicken Thigh Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "50 mins",
            "Prep": "30 mins",
            "Cook": "30 mins",
            "Total": "1 hr 50 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "648",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "33g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/268989/moroccan-chicken-thigh-sheet-pan-dinner/",
        "recipe_name": "Moroccan Chicken Thigh Sheet Pan Dinner",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/RIxwrr1DkEDMw_GxevvA7Io64Yc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1943x0:1945x2):format(webp)/5933746-b4c86c95fdc946d5a3984408d8caa511.jpg",
        "recipe_ingredients_formatted": [
            "1  lemon, zested and juiced",
            "2 tablespoons olive oil",
            "1 ½ teaspoons ras el hanout",
            "½ teaspoon salt",
            "4 (6 ounce) bone-in chicken thighs with skin",
            "1 medium sweet potato, peeled and cut into 1-inch chunks",
            "1 medium zucchini, cut into 1-inch chunks",
            "1 (15 ounce) can chickpeas, drained and rinsed",
            "1 (14 ounce) can quartered artichoke hearts, drained",
            "1 teaspoon ras el hanout",
            "½ teaspoon salt",
            "2 tablespoons olive oil",
            "¼ cup pomegranate seeds",
            "¼ cup chopped fresh parsley",
            "2 tablespoons shelled pistachios, coarsely chopped"
        ],
        "recipe_directions_formatted": [
            "Combine lemon juice, lemon zest, 2 tablespoons olive oil, 1 1/2 teaspoons ras el hanout, and 1/2 teaspoon salt in a resealable plastic bag. Place chicken thighs into the bag, making sure marinade gets under skin. Seal and refrigerate at least 30 minutes. Remove chicken from refrigerator 20 minutes before baking and let come to room temperature.",
            "Preheat the oven to 400 degrees F (200 degrees C).",
            "Combine sweet potato, zucchini, chickpeas and artichoke hearts in a bowl. Sprinkle with 1 teaspoon ras el hanout and 1/2 teaspoon salt. Drizzle with 2 tablespoons olive oil and stir to combine evenly.",
            "Remove chicken from marinade and place on a 13x18-inch rimmed sheet pan. Place vegetable mixture around chicken.",
            "Bake in the preheated oven, flipping vegetables halfway through, or until chicken has reached an internal temperature of 165 degrees F (74 degrees C), about 30 minutes.",
            "Remove from oven and garnish with pomegranate seeds, parsley, and pistachios before serving.",
            "To make cleanup easier, line the sheet pan with aluminum foil.",
            "Place pistachios into a small resealable storage bag and crush with a rolling pin or meat tenderizer.",
            "The sweet potato used for this recipe weighed about 14 ounces."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Everyday Cooking",
            "Sheet Pan Dinner Recipes"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/gallery/vegetarian-sheet-pan-dinners/",
        "recipe_name": "10 Vegetarian Sheet Pan Dinners",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/zEhWhy_3NJx4zoYk07iFg0x0N1o=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2):format(webp)/4536970-2b390fe677324d2c9bfb9300a0b137fe.jpg",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "Making vegetarian meals doesn't have to be complicated. Simply pull out your sheet pan, heat up the oven, and you're practically ready to whip up some delicious plant-based meals. You'll be rewarded with mouthwatering meals, like roasted leeks with eggs or sheet pan ratatouille, and almost no dishes leftover in the sink. Try one of these 10 vegetarian sheet pan dinners tonight.",
            "A world of root veggies star in this easy vegetarian sheet pan dinner. Carrots, potatoes (both sweet and russet), onions, and butternut squash are roasted to tender perfection with chewy chickpeas throughout.",
            "A flavorful dinner for two in just 35 minutes? Yes, please! Cauliflower, tomatoes, and chickpeas become perfectly crispy before getting hit with a drizzle of lime juice and sprinkling of fresh cilantro. Eat this recipe as is, or serve with warmed corn tortillas for easy tacos.",
            "Veggies like bell peppers, zucchini, and tomato get the Mediterranean treatment with a handful of salty feta and drizzle of rich olive oil. Reviewer MPEBLE says, \"Even better than I expected. The oil and spice ratio is just right — the vegetables are flavored sufficiently, but they aren't swimming in oil.\"",
            "Equally bright in color and flavor, this summery dish is the perfect way to use up farmers' market vegetables. \"Easy to make, inexpensive, and an instant hit with the family,\" says JayPee. \"Clean up took one minute.\"",
            "With a trio of bell peppers, plus zucchini, onion, and tomatoes, you'll have no problems meeting your daily vegetable goals with this dish. To make it an extra filling main dish, serve over noodles or rice for soaking up the veggie juices.",
            "This classic French dish just happens to be vegetarian-friendly. \"The veggies are just bursting with flavor and the texture is perfect,\" says Buckwheat Queen.",
            "Using three different types of potatoes — red, purple, and sweet — this recipe makes the perfect comforting dinner while still remaining healthy with the addition of Brussels sprouts and cauliflower. Don't skip the lemon-tahini sauce, it adds a bright nuttiness to the entire dish.",
            "Say goodbye to boring salads as a way to get your vegetable fix, and instead dig into this hearty veggie bowl. Roasted potatoes, garlic, and zucchini are layered with fresh arugula, tomatoes, and a zippy balsamic vinegar dressing.",
            "An entire head of cauliflower is used in this bold-flavored sheet pan dinner. The cauliflower's earthy taste pairs well with the carrot's sweetness, all of which are balanced out with a dash of salty olives and feta cheese.",
            "Eggs for dinner has never looked quite so fancy. Leeks and green onions get a quick roast in the oven before being topped with sunny side up eggs and a drizzle of tangy avocado vinaigrette."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Meat and Poultry",
            "Chicken",
            "Chicken Breast"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "1 hr 5 mins",
            "Total": "1 hr 20 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "795",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "57g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/221160/pan-roasted-chicken-with-lemon-garlic-brussels-sprouts-and-potatoes/",
        "recipe_name": "Pan-Roasted Chicken with Lemon-Garlic Brussels Sprouts and Potatoes",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/gccItf9XbNNo0VO9ZdsvN4DJu-o=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(639x0:641x2):format(webp)/7695129-e168c148866044e4b12df65178723fe9.jpg",
        "recipe_ingredients_formatted": [
            "4 slices bacon, chopped",
            "1 tablespoon olive oil",
            "1  lemon, thinly sliced",
            "5 tablespoons olive oil",
            "1  lemon, juiced",
            "4 cloves garlic, minced",
            "1 teaspoon kosher salt",
            "½ teaspoon ground black pepper",
            "½ pound Brussels sprouts, trimmed and halved",
            "8 small red potatoes, quartered",
            "4  bone-in, skin-on chicken breast halves"
        ],
        "recipe_directions_formatted": [
            "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until lightly browned but still soft, about 5 minutes. Drain the bacon slices on a paper towel-lined plate.",
            "Preheat an oven to 450 degrees F (230 degrees C).",
            "Coat a large baking dish or cast iron skillet with 1 tablespoon olive oil.",
            "Arrange lemon slices in a single layer on the bottom of the baking dish.",
            "Stir remaining 5 tablespoons olive oil, lemon juice, garlic, kosher salt, and black pepper together in a large bowl.",
            "Toss Brussels sprouts in lemon juice mixture to coat; transfer to the prepared baking dish with a slotted spoon, draining excess liquid back into the bowl.",
            "Place bacon on top of the Brussels sprouts.",
            "Toss potatoes in the same lemon juice mixture used for the Brussels sprouts.",
            "Remove potatoes with slotted spoon and arrange along the inside edge of the baking dish.",
            "Coat chicken breast halves thoroughly in the remaining lemon mixture.",
            "Place chicken breasts skin-side up in the skillet; pour any remaining lemon juice mixture over chicken.",
            "Bake in the preheated oven until chicken no longer pink at the bone and the juices run clear, about 60 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C)."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Everyday Cooking",
            "Sheet Pan Dinner Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "20 mins",
            "Total": "35 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "511",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "37g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/283077/easy-meaty-sheet-pan-meal/",
        "recipe_name": "Easy, Meaty Sheet Pan Meal",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/Y4iYqIQ-5dDDL0Vhk_iCxgwgmEc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1919x0:1921x2):format(webp)/8979545-2f4d817e7f1a432f9f4f48cca61fe95f.jpg",
        "recipe_ingredients_formatted": [
            "1 ½ pounds boneless, skinless chicken thighs",
            "1 pound tiny new potatoes, cut into 1-inch pieces",
            "2 cups cherry tomatoes",
            "2 teaspoons olive oil",
            "¼ teaspoon salt, or more to taste",
            "¼ teaspoon ground black pepper, or more to taste",
            "½ cup pesto",
            "1 tablespoon chopped fresh basil, or to taste"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 425 degrees F (220 degrees C). Line a 10x15-inch baking pan with aluminum foil.",
            "Arrange chicken, potatoes, and cherry tomatoes in a single layer on the prepared pan. Drizzle with oil and sprinkle with salt and pepper.",
            "Roast in the preheated oven until vegetables are tender and chicken is no longer pink in the centers and juices run clear, 20 to 30 minutes. An instant-read thermometer inserted into the chicken should read at least 175 degrees F (79 degrees C).",
            "Serve with pesto and sprinkle with basil.",
            "You can use 1 1/2 pounds of any boneless meat, 1 pound any prepped starchy vegetables, 2 cups any prepped non-starchy vegetables, 1/2 cup any prepared sauce or relish, and any fresh herbs you like. Just be sure to adjust the cooking time depending on the meat you choose.",
            "For Southwestern Beef, use a 1-inch-thick flat iron steak, frozen sweet corn kernels, red or orange bell peppers (cut into 1/2-inch strips), pico de gallo, and cilantro leaves.",
            "For Barbecue Pork, use pork tenderloin (trimmed), sweet potatoes (cut into 3/4-inch chunks), fresh green beans (trimmed), barbecue sauce, and sliced green onion."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Meat and Poultry",
            "Chicken",
            "Chicken Breast"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "28 mins",
            "Total": "43 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "671",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "26g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/261189/sheet-pan-dinner-with-chicken-and-veggies/",
        "recipe_name": "Sheet Pan Dinner with Chicken and Veggies",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/1zdPwm2lWEsWJhcSe2UHLNqWuCg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(935x0:937x2):format(webp)/9431182-514e3d2ae1814db7a49ea9c66e4e769f.jpg",
        "recipe_ingredients_formatted": [
            "1 cup mayonnaise",
            "1 (1 ounce) package ranch dressing mix",
            "2 large skinless, boneless chicken breasts, halved lengthwise",
            "olive oil, or as needed",
            "1 ½ pounds red potatoes, halved or quartered if large",
            "1 pound baby carrots",
            "salt and ground black pepper to taste",
            "¼ cup dry bread crumbs"
        ],
        "recipe_directions_formatted": [
            "Combine mayonnaise and ranch dressing mix in a gallon-sized resealable plastic bag to make the marinade. Place chicken in the bag, squish around to cover, and refrigerate while preparing the other ingredients.",
            "Preheat oven to 400 degrees F (200 degrees C). Grease a large rimmed baking sheet the size of your oven with olive oil.",
            "Place red potatoes and baby carrots along the outer edges of the baking sheet, leaving room in the middle for the chicken. Season with salt and pepper.",
            "Pour breadcrumbs into a bowl or onto a plate. Remove chicken from marinade and drain off excess marinade. Coat chicken in the breadcrumbs and place on the baking sheet with some room in between the pieces.",
            "Bake in the preheated oven until chicken is no longer pink in the center and the juices run clear, 25 to 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Turn on the oven's broiler and broil for an additional 3 to 5 minutes.",
            "My kids love squishing around the mayonnaise and dressing mix in the gallon-sized plastic bag. You can also use premade ranch dressing but you may want to thicken it up slightly with extra mayonnaise."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Main Dishes",
            "Chicken",
            "Pesto Chicken Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "45 mins",
            "Total": "55 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "780",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "57g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/274788/pesto-chicken-bake/",
        "recipe_name": "Pesto Chicken Bake",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/bVD0Gud8d07RWMxWXzoE1uixKjs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(595x0:597x2):format(webp)/8488251-7a475b69308143a19aa60b2995b77a7d.jpg",
        "recipe_ingredients_formatted": [
            "2 ½ pounds bone-in, skinless chicken thighs",
            "1 ½ pounds baby red potatoes",
            "1 pint cherry tomatoes",
            "½ cup pesto",
            "2 tablespoons water",
            "2 teaspoons olive oil",
            "salt and ground black pepper to taste"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 425 degrees F (220 degrees C).",
            "Combine chicken, potatoes, tomatoes, pesto, water, olive oil, salt, and pepper in a large roasting pan; mix well.",
            "Bake in the preheated oven until chicken is no longer pink at the bone and juices run clear, about 45 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).",
            "You can use Yukon potatoes instead of red, if you'd like."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Meat and Poultry",
            "Chicken",
            "Chicken Breast"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "1 hr",
            "Total": "1 hr 10 mins",
            "Servings": "3",
            "Yield": "3 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "408",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "27g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/261193/sheet-pan-chicken-meal/",
        "recipe_name": "Sheet Pan Chicken Meal",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/tOPhFRnyC2q2r8ijiAEytI7BSrI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(2015x0:2017x2):format(webp)/4581576-ac8af4270b76493faaab55579fc98292.jpg",
        "recipe_ingredients_formatted": [
            "3  skinless, boneless chicken breasts",
            "¾ pound fresh green beans, trimmed",
            "4  red potatoes, quartered",
            "½ (.7 ounce) package dry Italian-style salad dressing mix",
            "6 tablespoons butter, melted"
        ],
        "recipe_directions_formatted": [
            "Preheat oven to 350 degrees F (175 degrees C).",
            "Place chicken breasts in the middle of a rimmed sheet pan. Add green beans on one side and potatoes on the other. Pour melted butter over everything and sprinkle with Italian dressing mix. Cover with aluminum foil.",
            "Bake in the preheated oven until chicken is no longer pink in the center and the juices run clear, about 60 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Everyday Cooking",
            "Sheet Pan Dinner Recipes"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/gallery/sheet-pan-salmon-recipes/",
        "recipe_name": "7 Sheet Pan Salmon Recipes for Busy Weeknights",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/ncegkmkkmeE1M6H03qZdricnd0g=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(503x0:505x2):format(webp)/283432-everything-salmon-sheet-pan-dinner-e41c8bfa29484017a316bb10dea5866a.jpg",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "There's nothing like a one-pan meal to make hectic weeknights (or Sunday meal prep) so much simpler. These healthy salmon and vegetable dinners come together like a dream — just throw everything onto a sheet pan, season, and bake. From simple salmon bakes with roasted asparagus to deceptively easy, restaurant-worthy recipes that'll impress everyone at your table, you'll find a convenient new favorite in this collection of our best sheet pan salmon recipes.",
            "Delicate salmon with a sweet and spicy Dijon mustard glaze is topped with crunchy everything bagel seasoning in this 30-minute recipe from NicoleMcMom.",
            "Salmon and asparagus are simply seasoned with lemon juice, garlic, sea salt, and black pepper. Lemon rounds add a welcome burst of flavor and color.",
            "It couldn't be easier to make this basic sheet pan fish recipe with ingredients you probably already have on hand. This is a \"deliciously quick and simple dinner for any occasion,\" says recipe creator MAGGIE1205.",
            "Here's a healthy, easy, and absolutely delicious meal to make in just half an hour. This nutrient-packed dish is fantastic served with rice, according to recipe creator barbara.",
            "Use a simple formula to create your own twist on a simple sheet pan dinner. In this version, skin-on salmon is baked with za'atar-seasoned broccoli and topped with feta cheese.",
            "\"Earth (potatoes, onions, roasted peppers), Sea (fresh salmon) and Fire (your favorite oven) make this a winning recipe that you all will love to try,\" says recipe creator CynthiaRussell.",
            "Prep four whole meals quickly and easily before your busy week begins. Salmon is cooked with green beans, asparagus, and carrots in this satisfying sheet pan recipe.",
            "Try another one of our favorite Simple and Healthy Sheet Pan Fish Recipes. Plus, explore our entire collection of Sheet Pan Dinner Recipes."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Main Dishes",
            "Chicken",
            "Lemon Chicken Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "45 mins",
            "Total": "1 hr",
            "Servings": "6",
            "Yield": "1 roasted chicken"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "546",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "52g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/236306/roasted-chicken-with-lemon-and-rosemary/",
        "recipe_name": "Lemon-Roasted Chicken",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/mMOTagPROlpk55iF7hDm8hQGav0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/236306-roasted-chicken-with-lemon-and-rosemary-armag-2000-5d2f30a3d3c94f6fb8cc54436d565613.jpg",
        "recipe_ingredients_formatted": [
            "1 whole chicken, cut into 8 pieces",
            "1 onion, cut into wedges",
            "1 lemon, sliced",
            "8 cloves garlic",
            "4 sprigs fresh rosemary",
            "¼ cup olive oil",
            "½ teaspoon salt",
            "½ teaspoon ground black pepper"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 450 degrees F (230 degrees C).",
            "Combine chicken, onion, lemon slices, garlic, and rosemary together in a large bowl. Drizzle olive oil and sprinkle salt and black pepper over the chicken mixture; toss to coat. Spread chicken mixture out in the bottom of a baking dish.",
            "Bake in the preheated oven until no longer pink at the bone and the juices run clear, 45 to 50 minutes. An instant-read thermometer inserted into the thickest part of a thigh, near the bone, should read at least 165 degrees F (74 degrees C).",
            "The magazine version of this recipe roasts the chicken for 35 to 40 minutes."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Fruits and Vegetables",
            "Vegetables",
            "Cauliflower",
            "Roasted"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "25 mins",
            "Total": "35 mins",
            "Servings": "2",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "324",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "13g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/261608/easy-vegan-sheet-pan-roasted-cauliflower-tomatoes-and-garbanzo-beans/",
        "recipe_name": "Easy Vegan Sheet Pan Roasted Cauliflower, Tomatoes, and Garbanzo Beans",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/jaswEteH2X3Ay9KdYlwpEHNIfRg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1943x0:1945x2):format(webp)/9429086-f8d47a079f494d5082c151c571e3231d.jpg",
        "recipe_ingredients_formatted": [
            "cooking spray",
            "1 tablespoon olive oil",
            "2 cloves garlic, minced",
            "½ teaspoon salt",
            "¼ teaspoon ground black pepper",
            "4 cups sliced cauliflower",
            "2 cups cherry tomatoes",
            "1 (15 ounce) can garbanzo beans, drained",
            "1  lime, cut into wedges",
            "1 tablespoon chopped fresh cilantro"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 450 degrees F (230 degrees C). Line a baking sheet with aluminum foil and grease with cooking spray.",
            "Combine olive oil, garlic, salt, and pepper in a bowl. Add cauliflower, tomatoes, and garbanzo beans; toss until well coated. Spread in a single layer on the prepared baking sheet. Add lime wedges.",
            "Roast in the preheated oven until vegetables are caramelized, about 25 minutes. Remove lime wedges and top with fresh cilantro."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Everyday Cooking"
        ],
        "recipe_details_formatted": {
            "Additional Time": "15 mins",
            "Prep": "30 mins",
            "Cook": "1 hr",
            "Total": "1 hr 45 mins",
            "Servings": "8",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "229",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "17g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/261839/baked-chicken-thighs-coated-with-corn-flake-crumbs/",
        "recipe_name": "Baked Chicken Thighs Coated With Corn Flake Crumbs",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/4xliWlYmw0b49rEtojJK7uVa5fY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1618x0:1620x2):format(webp)/4992769-d0d2fe8ccb2a4ca6a10bb87c3117b50a.jpg",
        "recipe_ingredients_formatted": [
            "8  chicken thighs, trimmed of excess fat and skin",
            "1 ½ cups corn flake crumbs",
            "1 tablespoon teriyaki sauce",
            "1 tablespoon sriracha sauce",
            "1 tablespoon sweet paprika",
            "2 teaspoons rice vinegar",
            "2 teaspoons white sugar"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 400 degrees F (200 degrees C). Line a half-sheet pan with aluminum foil. Place a baking rack on top.",
            "Place corn flake crumbs in a bowl.",
            "Mix teriyaki sauce, Sriracha sauce, paprika, rice vinegar, and sugar together in a large bowl until sauce has a thick consistency.",
            "Place chicken thighs in the bowl with sauce. Tumble thighs together until completely coated. Smear sauce onto any bare spots and under any loose flaps of skin.",
            "Place 1 thigh into the bowl with corn flakes. Spoon crumbs on top using a tablespoon. Press crumbs onto thigh using the back of the spoon, pressing thigh down into crumbs to coat underside. Turn over and repeat pressing. Place onto the baking rack, skin-side up. Repeat with remaining thighs and crumbs, placing largest thighs in the corners of the rack to receive the most heat.",
            "Bake in the preheated oven for 30 to 40 minutes depending on the size of thighs. Reduce oven temperature to 325 degrees F (165 degrees C) and continue baking, 15 to 20 minutes. Turn thighs over to help undersides crisp up. Bake until no longer pink at the bone and juices run clear, 15 to 20 minutes more. An instant-read thermometer inserted near bone should read 165 degrees F (74 degrees C).",
            "Let thighs rest on the baking rack for at least 15 minutes before serving.",
            "The sauce is not a marinade, so don't let the thighs sit in it for very long, or else its salty ingredients will extract moisture that you want to remain in the thighs. Also, watery sauce won't hold the corn flake crumbs onto the thighs.",
            "Small thighs may take only 55 minutes, but very large thighs may take an hour and a quarter.",
            "Refrigerate any leftovers only after they've cooled significantly (to minimize condensation of steam). Place a double layer of paper towels under them.",
            "Simpler method: Line your pan with aluminum foil. Don't use a baking rack. Coat only the skin side of the thighs with corn flake crumbs. Bake them skin side up, without turning them over.",
            "Chicken finger variation: Use chicken breast cutlets sliced into 1-inch-wide fingers. Bake at 375 degrees F (190 degrees C) for 25 to 30 minutes."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Meat and Poultry",
            "Pork",
            "Pork Tenderloin Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "30 mins",
            "Total": "45 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "358",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "20g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/261598/easy-one-pan-pork-and-squash-dinner/",
        "recipe_name": "Easy One-Pan Pork and Squash Dinner",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/D8VilhmTAHHRCwENCgNOAyJ_A0Y=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1479x0:1481x2):format(webp)/5349289-6e33d5f936b4479d92186d1317c8b6a2.jpg",
        "recipe_ingredients_formatted": [
            "cooking spray",
            "3 tablespoons olive oil, divided",
            "2 tablespoons honey",
            "2 teaspoons salt, divided",
            "2 teaspoons dried sage, divided",
            "1 teaspoon ground black pepper, divided",
            "1 pork tenderloin",
            "5 cups (1-inch) cubes peeled, seeded butternut squash",
            "2 Granny Smith apples, cut into 1-inch wedges",
            "1 white onion, cut into 1/2-inch slices"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 425 degrees F (220 degrees C). Grease a rimmed 13x18-inch baking sheet with cooking spray.",
            "Whisk 1 tablespoon olive oil, honey, 1 teaspoon salt, 1 teaspoon sage, and 1/2 teaspoon pepper in a bowl.",
            "Place tenderloin on the prepared baking sheet; rub honey mixture onto pork.",
            "Mix butternut squash, apples, and onion in a bowl; drizzle with remaining 2 tablespoons olive oil, 1 teaspoon salt, 1 teaspoon sage, and 1/2 teaspoon pepper; toss until well coated. Place around pork tenderloin.",
            "Bake in the preheated oven until vegetables are tender and pork is cooked, 30 to 35 minutes; baste pork with honey mixture several times during roasting. An instant-read thermometer inserted into the center of the pork should read at least 145 degrees F (63 degrees C)."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Fruits and Vegetables",
            "Vegetables",
            "Squash"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "25 mins",
            "Cook": "45 mins",
            "Total": "1 hr 10 mins",
            "Servings": "8",
            "Yield": "8 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "273",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "7g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/268995/vegetarian-sheet-pan-dinner-with-chickpeas-and-veggies/",
        "recipe_name": "Vegetarian Sheet Pan Dinner with Chickpeas and Veggies",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/0ixjHmxVNVpwYn31o8FREyA0W8A=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(2303x0:2305x2):format(webp)/5934981-3a8060031b404c8981baed48c7a4be74.jpg",
        "recipe_ingredients_formatted": [
            "2 (15 ounce) cans chickpeas, rinsed and drained",
            "½  butternut squash - peeled, seeded, and cut into 1-inch pieces",
            "1  onion, diced",
            "1  sweet potato, peeled and cut into 1-inch cubes",
            "2 large carrots, cut into 1 inch pieces",
            "3 medium russet potatoes, cut into 1-inch pieces",
            "3 tablespoons vegetable oil",
            "1 teaspoon salt",
            "½ teaspoon ground black pepper",
            "1 teaspoon onion powder",
            "1 teaspoon garlic powder",
            "1 teaspoon ground fennel seeds",
            "1 teaspoon dried rubbed sage",
            "2  green onions, chopped (Optional)"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 350 degrees F (175 degrees C). Grease a large sheet pan.",
            "Place chickpeas, butternut squash, onion, sweet potato, carrots, and russet potatoes on the prepared sheet pan. Drizzle with vegetable oil and toss to coat.",
            "Combine salt, black pepper, onion powder, garlic powder, ground fennel seeds, and rubbed sage in a bowl. Sprinkle over vegetables on the sheet pan and toss to coat.",
            "Bake in the preheated oven for 25 minutes. Stir and bake until vegetables are soft and lightly browned and chickpeas are slightly crisp, 20 to 25 minutes more. Season with additional salt and black pepper to taste, and top with chopped green onion before serving."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Greek"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "25 mins",
            "Cook": "25 mins",
            "Total": "50 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "416",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "30g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/281413/easy-sheet-pan-greek-chicken/",
        "recipe_name": "Easy Sheet Pan Greek Chicken",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/luerLsoYP16B8T6DuUofkqgj5ps=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(608x0:610x2):format(webp)/8482428-a2612d3e9dab4939ac817c9698b4a8e3.jpg",
        "recipe_ingredients_formatted": [
            "4  skinless, boneless chicken breast halves",
            "1 ½ pounds yellow potatoes, cubed",
            "2 medium red bell peppers, seeded and chopped",
            "½ cup coarsely chopped red onion",
            "2 teaspoons minced garlic",
            "2 tablespoons olive oil",
            "2 medium lemons, cut into wedges",
            "1 tablespoon dried oregano",
            "freshly cracked salt and pepper to taste",
            "½ cup pitted Kalamata olives"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 400 degrees F (200 degrees C).",
            "Toss chicken, potatoes, bell peppers, onion, oil, and garlic together in a large bowl until well combined. Transfer mixture to a large sheet pan and spread into a single layer. Squeeze lemon wedges over top, then place spent wedges onto the sheet pan. Sprinkle oregano over top, then season with salt and pepper. Add Kalamata olives.",
            "Bake in the preheated oven until potatoes are fork-tender and chicken breasts are no longer pink in the center and the juices run clear, about 25 minutes. An instant-read thermometer inserted into the center of chicken breasts should read at least 165 degrees F (74 degrees C)."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Main Dishes",
            "Chicken",
            "Pesto Chicken Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "15 mins",
            "Total": "30 mins",
            "Servings": "8",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "284",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "32g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/266136/sheet-pan-chicken-with-mozzarella-pesto-and-broccoli/",
        "recipe_name": "Sheet Pan Chicken with Mozzarella, Pesto, and Broccoli",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/Dnuztgf3JTf8WM-NHbC3X9qFvJU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(825x0:827x2):format(webp)/9268543-9223a77a4af1493495ff0b470e33885d.jpg",
        "recipe_ingredients_formatted": [
            "2 pounds boneless chicken breasts",
            "2 teaspoons garlic salt",
            "ground black pepper to taste",
            "6 tablespoons pesto",
            "2 medium Roma (plum) tomatoes, thinly sliced",
            "1 ½ cups shredded mozzarella cheese",
            "1 head broccoli, cut into florets",
            "2 tablespoons olive oil",
            "salt to taste"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 425 degrees F (220 degrees C). Lightly grease a large sheet pan.",
            "Season chicken with garlic salt and pepper; place onto the prepared sheet pan. Spread pesto over chicken, then top with tomatoes and mozzarella.",
            "Toss broccoli and oil together in a bowl; season with salt and pepper. Scatter around chicken on the baking sheet.",
            "Bake in the preheated oven until broccoli is tender and chicken is no longer pink in the center and the juices run clear, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Everyday Cooking",
            "Sheet Pan Dinner Recipes"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/gallery/super-easy-sheet-pan-suppers/",
        "recipe_name": "22 Super-Easy Sheet Pan Suppers",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/SH3ULCORqBeIU4q7QDGX6WqrzTY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(621x0:623x2):format(webp)/as20-sheet-maple-roasted-chicken-thighs-photo-by-carson-downing-cropped-ea0a393e3b244c90bbdfc8cb8f94a175.jpg",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "A complete meal, prepared on one little ol' sheet pan. We're obsessed with this method! It's so easy: Arrange everything on the sheet pan, pop the pan in the oven — dinner's ready. You save time on the front and back ends with prep and clean-up. Check out our favorite sheet pan suppers for quick-and-easy dinners.",
            "So good, so easy. Grilled veggies are amazing with the beef. \"This is SO good, and easy to do,\" says RenoCarol. \"The grilled veggies are amazing with the beef. I served it as a beef/veggie dish, and added parmesan cheese rather than feta, since no one at our home likes feta. It was a total hit.\"",
            "\"Get a taste of island life with Jamaican jerk-seasoned shrimp, juicy pineapple, roasted veggies, and spicy jalapenos. Serve over salad greens or, for a heartier meal, with cooked brown rice.\" —Jamie",
            "There are so many ways to experiment with this sheet-pan method. This version calls for frozen, pre-cut broccoli and a little Italian dressing mix. \"This is one of the easiest and most requested recipes,\" says AmyZ. \"It's simple to make, and the ingredients are easy to find!\"",
            "\"I usually use chicken thighs and bratwurst, but Italian would be yummy, of course,\" says Kathy. And BYRDYGIRL raves: \"The flavors of this recipe meld together fantastically. It's easy to make, tastes delicious, and makes for great leftovers to take to work.\"",
            "So easy. Toss asparagus and cherry tomatoes in a little olive oil and salt. Bake it beside the salmon. \"Very good simple recipe,\" says M. Robinson. \"I sometimes add other ingredients, such as extra spices, or peppers. Very nice.\"",
            "For extra crispy-brown chicken and potatoes, place the sheet under a preheated broiler for about 5 minutes. Chef John's sauce-making suggestions are essential viewing. Enjoy it with this simple homemade Tzatziki Sauce. \"Loved it!\" says Debbie. \"Loved it so much I made it again the next day. Potatoes were great!\"",
            "An all-in-one vegan meal, this sheet pan dinner is loaded with veggies and chickpeas are added for protein. Keep it vegan, or try it with crumbled feta or slices of halloumi cheese for a delicious vegetarian twist.",
            "Quick and easy shrimp fajitas in one pan! \"Talk about a winning weeknight meal,\" says LazyFoodieGirl. \"I was amazed how EASY this was to do -- not to mention delicious! After long hours at work, I didn't have energy for too much prep or clean up. This satisfied all my needs.\"",
            "Choose your favorite sausages for this one. \"This was PHENOMINAL,\" raves Christina. \"Super simple to put together and the flavor was just awesome. One of the best recipes that I have tried from this site, hands down.\"",
            "This is the junction where easy meets impressive. \"We were so pleased with the outcome,\" says Jody. \"The pork was incredibly moist and tender, and the carrots and fennel complemented it beautifully.\"",
            "Arrange chicken breasts carrots, bell peppers, celery, green onion, and parsley on a baking sheet, drizzle with olive oil, and add simple seasonings. \"So easy and delicious,\" says Lisa. \"If you like fresh veggies don't worry about sautéing first, I baked mine in the oven with the chicken and they turned out perfect! I served it with black rice, which has a rich,nutty flavor that went well with the vegetable medley. \"",
            "\"Tart balsamic vinegar brightens up bell peppers, sweet tomatoes, and juicy chicken sausage for flavorful Italian fare. Bring it all together with toasted bread and fresh oregano.\" —Jamie",
            "Salmon fillets are baked to perfection with a colorful array of bell peppers. This super-easy sheet pan supper gets tons of flavor from a spicy lemon-garlic sauce.",
            "Here's a quick-and-easy way to make flavorful fajitas for a crowd. \"This turned out great, says Kelly. \"So easy for a dinner after work!\"",
            "This complete meal cooks on a single sheet pan and features panko- and Parmesan-crusted chicken thighs, baby potatoes, and green beans. \"Your entrée and sides are ready all at once,\" says fabeveryday. \"Perfect for busy nights when you need a hands-off meal.\"",
            "Cynthia explains it: \"Earth (potatoes, onions, roasted peppers), Sea (fresh salmon), and Fire (your oven) make this a winning recipe. This dish is amazingly easy to make and the end result will just make you look super good!\"",
            "Chef John advises, \"You'll need a large, heavy-duty roasting pan and a very hot oven for this delicious dish. The long oven time makes everything beautifully caramelized and the chicken fork tender.\"",
            "\"Broccoli, baby potatoes, and carrots are tossed in a mixture of olive oil, whole grain mustard, and Pecorino cheese, then baked alongside mild Italian sausage\" says Diana Moutsopoulos. Use almost any sausage you like in this recipe and feel free to use Parmesan instead of Pecorino for a similarly tasty result.",
            "\"A little maple syrup brings life to chicken thighs and caramelizes Brussels sprouts and sweet potato wedges. Dried cranberries and pecans add tartness and crunch.\" —Jamie",
            "Another easy and versatile vegan sheet pan dinner featuring heaps of vegetables. The five-star reviews say it all, like this one from Allrecipes home cook BeccaB: \"Loved it! Tasted great and made a quick, healthy weeknight dinner.\"",
            "Flank steak and slices of bell pepper onions are seasoned and cooked on a sheet pan. Thinly slice the steak and enjoy in warmed flour tortillas with all the fixings. Dinner's ready in less than 45 minutes.",
            "This simple, versatile one-pan meal features roasted red cabbage and sausage and is ready in about 30 minutes. \"It's a great way to use up wayward veggies,\" says theartofsavvy. \"Make the recipe your own by substituting favorite or seasonal vegetables any time of year.\"",
            "Your weeknight dinner routine is sorted with our recipe collections for sheet pan dinners and more:"
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Meat and Poultry",
            "Chicken",
            "Chicken Breast"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "45 mins",
            "Total": "1 hr",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "423",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "30g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/241287/baked-italian-chicken-dinner/",
        "recipe_name": "Baked Italian Chicken Dinner",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/Z8DTsLcIJLJSWunw9coUEmp51fM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/2142470-baked-italian-chicken-dinner-Rock_lobster-1x1-1-0a8088bf84384833a5abed2e1d0223cd.jpg",
        "recipe_ingredients_formatted": [
            "cooking spray",
            "1 pound skinless, boneless chicken breast, cut into cubes",
            "1 (10 ounce) package frozen broccoli",
            "4  potatoes, diced",
            "¼ cup butter, melted",
            "1 (.7 ounce) package Italian dressing mix"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 350 degrees F (175 degrees C). Spray a 13x9-inch baking dish with cooking spray.",
            "Layer chicken, broccoli, and potatoes evenly into the prepared baking dish in the order listed. Drizzle melted butter over the top. Sprinkle with Italian dressing mix.",
            "Bake in the preheated oven until chicken is cooked through and potatoes are tender, 45 to 60 minutes."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Fruits and Vegetables",
            "Vegetables",
            "Brussels Sprouts",
            "Roasted"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "40 mins",
            "Total": "55 mins",
            "Servings": "6",
            "Yield": "6 chicken thighs"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "265",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "15g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/262533/chicken-apple-and-brussels-sprout-sheet-pan-dinner/",
        "recipe_name": "Chicken, Apple, and Brussels Sprout Sheet Pan Dinner",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/7DvssrbPEzWA6ovgR8_bJrEnh1M=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2):format(webp)/9436935-401ef3666b3d488dbc188bfa1f806c56.jpg",
        "recipe_ingredients_formatted": [
            "2 cups Brussels sprouts, halved",
            "1  red apple, cut into 1-inch cubes",
            "1 (4 ounce) package pancetta",
            "2 tablespoons olive oil, divided",
            "1 teaspoon minced fresh rosemary",
            "6  skinless, boneless chicken thighs",
            "salt and ground black pepper to taste"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 425 degrees F (220 degrees C).",
            "Toss Brussels sprouts, apple, and pancetta with 1 tablespoon olive oil and rosemary in a bowl. Spread into a single layer on a sheet pan.",
            "Leave space on the pan for the chicken thighs. Toss chicken with the remaining 1 tablespoon oil in the same bowl; place on the sheet pan. Sprinkle salt and pepper on top.",
            "Bake in the preheated oven, stirring the Brussels sprouts mixture every 15 minutes, until chicken is no longer pink in the center and the juices run clear, 40 to 45 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
            "Use your favorite herb instead of rosemary, if desired."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Meat and Poultry",
            "Chicken",
            "Baked and Roasted"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "30 mins",
            "Total": "40 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "419",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "27g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/261609/basic-sheet-pan-chicken-sausage-and-roasted-cabbage/",
        "recipe_name": "Basic Sheet Pan Chicken Sausage and Roasted Cabbage",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/Vy7CTxKziReL6ezJfXBqPRMbMHQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(2469x0:2471x2):format(webp)/9434751-71b1f09391c64318be3bc418532993fb.jpg",
        "recipe_ingredients_formatted": [
            "cooking spray",
            "8 cups shredded cabbage",
            "1  apple, sliced",
            "1  white onion, sliced",
            "2 tablespoons olive oil",
            "1 ½ tablespoons white vinegar",
            "1 teaspoon salt",
            "½ teaspoon ground black pepper",
            "8 links chicken sausage"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 425 degrees F (220 degrees C). Grease a rimmed baking sheet with cooking spray.",
            "Combine cabbage, apple, onion, olive oil, vinegar, salt, and pepper in a large bowl; toss until well coated. Place in a single layer on the prepared baking sheet.",
            "Bake in the preheated oven until slightly tender, about 20 minutes. Toss cabbage mixture and place sausages on top. Bake until sausages are crispy and cabbage has caramelized, about 10 minutes more."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Everyday Cooking",
            "Sheet Pan Dinner Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "35 mins",
            "Prep": "20 mins",
            "Cook": "25 mins",
            "Total": "1 hr 20 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "466",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "32g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/283301/sheet-pan-roasted-chicken-thighs-with-brussels-sprouts/",
        "recipe_name": "Sheet Pan Roasted Chicken Thighs with Brussels Sprouts",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/_k1r2O1JTmlQIEKnsKxIXlXSN_A=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2):format(webp)/8717042-29c388133c6141a285843210350d328d.jpg",
        "recipe_ingredients_formatted": [
            "4 (5 ounce) skin-on, bone-in chicken thighs",
            "1 pound Brussels sprouts, halved",
            "½ cup dry white wine",
            "1 (3.5 ounce) link Italian sausage, sliced",
            "3 large shallots, sliced",
            "1 medium lemon, thinly sliced",
            "4 cloves garlic, sliced",
            "2 tablespoons olive oil, or as needed",
            "1 teaspoon chopped fresh rosemary, or to taste",
            "1 teaspoon fennel seeds, or to taste",
            "1 teaspoon chopped fresh thyme, or to taste",
            "1 teaspoon chopped fresh sage, or to taste",
            "sea salt and freshly ground black pepper to taste",
            "nonstick cooking spray"
        ],
        "recipe_directions_formatted": [
            "Clean and trim fat from chicken. Pat dry with paper towels. Place in a large bowl with Brussels sprouts, wine, sausage, shallots, lemon slices, garlic, oil, rosemary, fennel seeds, thyme, sage, salt, and pepper. Toss together with your hands and allow to marinate at room temperature, tossing occasionally, for at least 30 minutes.",
            "Preheat the oven to 475 degrees F (245 degrees C). Spray a baking pan with nonstick spray.",
            "Pour chicken and vegetable mixture onto the prepared baking pan. Arrange thighs, skin-side up, over mixture.",
            "Roast in the preheated oven until thighs are browned, crispy, and no longer pink in the centers, 25 to 30 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Let rest for 5 to 10 minutes before serving."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Fruits and Vegetables",
            "Vegetables",
            "Brussels Sprouts",
            "Roasted"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "30 mins",
            "Total": "50 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "462",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "26g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/280867/maple-roasted-chicken-thighs/",
        "recipe_name": "Maple-Roasted Chicken Thighs",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/8YfibwquiFjjszGDfpeuaGIH00s=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(2807x0:2809x2):format(webp)/8333673-d462a790352947869244355a281fcf52.jpg",
        "recipe_ingredients_formatted": [
            "2 tablespoons maple syrup",
            "1 tablespoon snipped fresh thyme",
            "2 tablespoons olive oil, divided",
            "¾ teaspoon salt, divided",
            "¾ teaspoon ground black pepper, divided",
            "1 pound sweet potatoes, peeled and cut into 1-inch wedges",
            "1 pound Brussels sprouts, trimmed and halved",
            "4  bone-in chicken thighs",
            "¼ cup chopped toasted pecans",
            "¼ cup chopped dried cranberries"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 425 degrees F (220 degrees C). Line a 10x15-inch baking pan with foil.",
            "Whisk together maple syrup, thyme, 1 teaspoon olive oil, 1/4 teaspoon salt, and 1/4 teaspoon pepper in a small bowl. Set aside.",
            "Toss together sweet potatoes, Brussels sprouts, 2 teaspoons olive oil, 1/4 teaspoon salt, and 1/4 teaspoon pepper in a large bowl. Set aside.",
            "Brush chicken with remaining 1 tablespoon olive oil; sprinkle with remaining 1/4 teaspoon salt and 1/4 teaspoon pepper. Arrange chicken, skin-side down, in the center of the prepared pan. Arrange sweet potato mixture around chicken.",
            "Roast in the preheated oven for 15 minutes. Turn chicken over; brush chicken, sweet potatoes, and Brussels sprouts with maple syrup mixture.",
            "Continue to roast until sweet potatoes are tender and chicken is no longer pink in the center and the juices run clear, about 15 minutes. An instant-read thermometer inserted into the center of chicken near the bone should read at least 165 degrees F (74 degrees C).",
            "Sprinkle with pecans and cranberries to serve."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Meat and Poultry",
            "Pork",
            "Pork Tenderloin Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "10 mins",
            "Prep": "15 mins",
            "Cook": "30 mins",
            "Total": "55 mins",
            "Servings": "6",
            "Yield": "6 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "354",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "28g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/256016/dijon-pork-with-apples-and-cabbage/",
        "recipe_name": "Dijon Pork with Apples and Cabbage",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/LTlzQ0jdSBmkMB4qexhYkELZl_E=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/4106919-dijon-pork-with-apples-and-cabbage-Allrecipes-Magazine-1x1-1-22147c7c2a8044f0a0509dadebb96197.jpg",
        "recipe_ingredients_formatted": [
            "½ head green or red cabbage, cored and cut into 1/2-inch-thick wedges",
            "2 large apples - cored and sliced into thin wedges",
            "5 tablespoons extra-virgin olive oil divided",
            "1 ½ teaspoons kosher salt, divided",
            "½ teaspoon black pepper, divided",
            "2 (16 ounce) pork tenderloins",
            "1 tablespoon coarse-grain Dijon-style mustard",
            "2 tablespoons white wine vinegar",
            "2 teaspoons honey",
            "1 teaspoon chopped fresh thyme leaves",
            "1 tablespoon chopped fresh parsley (Optional)"
        ],
        "recipe_directions_formatted": [
            "Preheat oven to 375 degrees F (190 degrees C). Place 1 rack in center position and another 4 inches from broiler. Spray a rimmed sheet pan with cooking spray.",
            "Toss together cabbage and apples with 3 tablespoons oil, 1/2 teaspoon salt, and 1/4 teaspoon pepper on prepared sheet pan and arrange in an even layer.",
            "Pat pork dry and season with remaining teaspoon salt and 1/4 teaspoon pepper. Whisk together remaining 2 tablespoons oil with mustard, vinegar, honey, and thyme in a small bowl. Spread over all sides of pork and set pork on top of cabbage and apples.",
            "Roast on center rack until an instant-read thermometer inserted into center of thickest part of each tenderloin registers 130 degrees F, about 25 minutes.",
            "Remove pan from oven and turn oven to broil. When broiler is hot, put pan on top rack and broil until pork has a golden-brown crust, thermometer registers 145 degrees F, and cabbage and apples have a light char, about 5 minutes. Cover pan loosely with foil and let pork rest 10 minutes before slicing. Serve pork warm with cabbage and apples, sprinkled with parsley (if using)."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Latin American",
            "Mexican",
            "Main Dishes",
            "Fajita Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "10 mins",
            "Total": "30 mins",
            "Servings": "8",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "100",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "14g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/258572/sheet-pan-shrimp-fajitas/",
        "recipe_name": "Sheet Pan Shrimp Fajitas",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/w184htkYBdkabgDA5uA4B8Bst1c=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1222x0:1224x2):format(webp)/4545509-df766af6651c44c28839d8d110b2eb75.jpg",
        "recipe_ingredients_formatted": [
            "1 (1 ounce) package fajita seasoning",
            "1 tablespoon olive oil",
            "1 ½ pounds raw shrimp, peeled and deveined",
            "1  red bell pepper, sliced into strips",
            "1  yellow bell pepper, sliced into strips",
            "1  red onion, sliced into strips",
            "1  jalapeno pepper, sliced into rings"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 450 degrees F (230 degrees C).",
            "Mix fajita seasoning and olive oil together in a large bowl. Add shrimp; toss to coat.",
            "Lay out seasoned shrimp in a single layer on a baking sheet. Add bell peppers, red onion, and jalapeño; mix with shrimp and spread out evenly.",
            "Roast in the preheated oven until shrimp are opaque, 8 to 10 minutes. Transfer shrimp to a serving plate.",
            "Broil pepper mixture until lightly blackened, 2 to 3 minutes. Transfer to the serving plate with shrimp."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Meat and Poultry",
            "Chicken",
            "Baked and Roasted",
            "Thighs"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "40 mins",
            "Cook": "35 mins",
            "Total": "1 hr 15 mins",
            "Servings": "6",
            "Yield": "6 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "281",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "16g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/256529/stuffed-chicken-thighs-with-roasted-potatoes-and-carrots/",
        "recipe_name": "Stuffed Chicken Thighs with Roasted Potatoes and Carrots",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/QWXgxFaCVCHLsVH_t3zWCocwBzY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(829x0:831x2):format(webp)/9396129-dca78f10284e46359331aa147c3b98c6.jpg",
        "recipe_ingredients_formatted": [
            "cooking spray",
            "6  skinless, boneless chicken thighs",
            "salt and ground black pepper to taste",
            "1  egg",
            "¾ cup shredded mozzarella cheese, divided",
            "1 small onion, minced",
            "1  Roma tomato, seeded and diced",
            "10  black olives, pitted and minced",
            "½ cup seasoned bread crumbs",
            "6  toothpicks",
            "1 pound red potatoes, scrubbed and halved",
            "1 pound carrots, peeled and cut into 3-inch pieces",
            "olive oil, or to taste"
        ],
        "recipe_directions_formatted": [
            "Preheat oven to 350 degrees F (175 degrees C). Line a rimmed baking sheet with aluminum foil; grease with cooking spray.",
            "Spread chicken thighs open on a flat work surface. Pound to an even thickness with the flat side of a meat mallet. Season with salt and pepper.",
            "Beat egg with a fork in large bowl. Stir in 1/2 cup mozzarella cheese, onion, tomato, and black olives. Mix in enough bread crumbs to bind the filling together.",
            "Put a spoonful of the filling in the center of each chicken thigh. Fold chicken over filling, tucking in any loose ends. Secure chicken thighs with toothpicks; arrange on the prepared baking sheet. Sprinkle remaining 1/4 cup mozzarella cheese over chicken thighs.",
            "Arrange potatoes and carrots around chicken thighs. Drizzle olive oil over vegetables; season with salt and pepper.",
            "Bake in the preheated oven until chicken juices run clear and vegetables are tender, 35 to 40 minutes. An instant-read thermometer inserted into the center of the chicken should read at least 165 degrees F (74 degrees C)."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "Asian",
            "Korean"
        ],
        "recipe_details_formatted": {
            "Additional Time": "1 hr",
            "Prep": "15 mins",
            "Cook": "10 mins",
            "Total": "1 hr 25 mins",
            "Servings": "6",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "339",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "26g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/281136/easy-sheet-pan-beef-bulgogi/",
        "recipe_name": "Easy Sheet Pan Beef Bulgogi",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/S9RnkJrhWkS_UjMsVQHDU5W401o=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1511x0:1513x2):format(webp)/9428300-6e881e426d03468597d17cd6c19c8a2c.jpg",
        "recipe_ingredients_formatted": [
            "1 ½ pounds flat iron steak",
            "¼ cup soy sauce",
            "1 tablespoon brown sugar",
            "1 tablespoon fish sauce",
            "1 tablespoon minced ginger",
            "1 tablespoon sesame oil",
            "1 tablespoon chile paste",
            "2 teaspoons sesame seeds",
            "2 cloves garlic, minced",
            "cooking spray",
            "1  onion, sliced",
            "1 (8 ounce) package sugar snap peas",
            "2 tablespoons olive oil, or as needed",
            "1 pinch salt and ground black pepper to taste",
            "1 bunch green onions, thinly sliced on the diagonal"
        ],
        "recipe_directions_formatted": [
            "Slice steak across the grain as thinly as possible. Place soy sauce, brown sugar, fish sauce, ginger, sesame oil, chile paste, sesame seeds, and garlic in a large bowl; mix well. Add steak and marinate in the refrigerator for 1 hour to overnight.",
            "Preheat the oven to 450 degrees F (230 degrees C). Remove steak from the refrigerator and bring to room temperature.",
            "Spray a sheet pan with cooking spray. Arrange onion and sugar snap peas on one side of the prepared pan. Drizzle with enough olive oil to coat and season with salt and pepper. Gently shake off excess marinade on steak and place on the other side of the prepared pan.",
            "Bake in the preheated oven until steak is slightly charred on the edges, 10 to 12 minutes. Garnish with green onions."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Everyday Cooking",
            "Sheet Pan Dinner Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "15 mins",
            "Prep": "15 mins",
            "Cook": "1 hr",
            "Total": "1 hr 30 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "451",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "26g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/26611/sheet-pan-ground-beef-potato-and-carrot-dinner/",
        "recipe_name": "Sheet Pan Ground Beef, Potato, and Carrot Dinner",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/57-QQzCzL92L8Cg4D9MwAAs6JD0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/5360416-9f70c832370e4fbf8a55d9f311f29aeb.jpg",
        "recipe_ingredients_formatted": [
            "1 pound ground beef",
            "5  potatoes, peeled and cut into steak fries",
            "4 large carrots, peeled and sliced lengthwise",
            "1  onion, peeled and sliced into rings",
            "salt to taste",
            "ground black pepper to taste",
            "garlic salt to taste"
        ],
        "recipe_directions_formatted": [
            "Preheat oven to 400 degrees F (200 degrees C). Line a sheet pan with aluminum foil.",
            "Shape the ground beef into patties and place in pan. Layer the vegetables on top of the beef patties, starting with the potatoes, then carrots and finally onions. Season with salt, pepper and garlic salt to taste.",
            "Cover with aluminum foil and seal edges. Bake in the preheated oven until beef is no longer pink and vegetables are tender, about 1 hour."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Latin American",
            "Mexican",
            "Main Dishes",
            "Fajita Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "5 mins",
            "Prep": "20 mins",
            "Cook": "15 mins",
            "Total": "40 mins",
            "Servings": "6",
            "Yield": "6 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "240",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "17g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/283433/sheet-pan-beef-fajitas/",
        "recipe_name": "Sheet Pan Beef Fajitas",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/FWZQFySxNN_O5UAZ-2SxHYvZrzo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(751x0:753x2):format(webp)/9053355_sheet-pan-beef-fajitas_allrecipes-37d056e6320f4768b7e6e0c699675354.jpg",
        "recipe_ingredients_formatted": [
            "2 medium bell peppers, sliced",
            "1 medium onion, sliced",
            "1 tablespoon olive oil, divided",
            "1 ½ teaspoons salt, divided",
            "1 teaspoon chili powder, divided",
            "¾ teaspoon garlic powder",
            "¾ teaspoon ground black pepper, divided",
            "½ teaspoon ground cumin, divided",
            "1 (1 1/2-pound) flank steak",
            "2 medium limes, quartered",
            "6 (6 inch) flour tortillas, warmed"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 450 degrees F (230 degrees C). Line a sheet pan with foil.",
            "Combine bell peppers, onion, 2 teaspoons oil, 3/4 teaspoon salt, 1/2 teaspoon chili powder, garlic powder, 1/4 teaspoon pepper, and 1/4 teaspoon cumin on the prepared pan; toss to coat. Spread veggie mixture around the sides of the pan creating a space in the center.",
            "Place flank steak in center of pan and brush with remaining 1 teaspoon oil. Sprinkle steak with remaining salt, chili powder, pepper, and cumin and rub to evenly coat.",
            "Bake in the preheated oven until veggies are tender and browned around the edges and steak is beginning to firm and is hot and slightly pink in the center, 12 to 14 minutes, or to desired degree of doneness. An instant-read thermometer inserted into the center of the steak should read 140 degrees F (60 degrees C) for medium.",
            "Transfer steak to a cutting board and rest, 5 to 10 minutes.",
            "Thinly slice steak and return to the sheet pan. Add lime wedges and serve with tortillas."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Fruits and Vegetables",
            "Vegetables",
            "Brussels Sprouts",
            "Roasted"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "5 mins",
            "Cook": "25 mins",
            "Total": "30 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "143",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "2g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/263602/sheet-pan-vegan-roasted-brussels-sprouts-and-butternut-squash/",
        "recipe_name": "Sheet Pan Vegan Roasted Brussels Sprouts and Butternut Squash",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/L90FdOkvPqzQDqCcuZZcqhNKYfM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1943x0:1945x2):format(webp)/9429080-705a0d87be92477aa27da19af6761a6a.jpg",
        "recipe_ingredients_formatted": [
            "2 cups Brussels sprouts, halved",
            "2 cups cubed butternut squash",
            "3 tablespoons olive oil",
            "1 teaspoon garlic powder",
            "½ teaspoon smoked paprika",
            "½ teaspoon sea salt",
            "¼ teaspoon ground black pepper"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 425 degrees F (220 degrees C). Line a baking sheet with parchment paper.",
            "Place Brussels sprouts and butternut squash in a single layer on the baking sheet. Drizzle with olive oil and sprinkle with garlic powder, smoked paprika, salt, and black pepper.",
            "Roast in the preheated oven until golden and crispy, about 25 minutes."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Everyday Cooking",
            "Sheet Pan Dinner Recipes"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/gallery/sheet-pan-shrimp-dinners/",
        "recipe_name": "7 Quick and Easy Sheet Pan Shrimp Dinners",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/z0GRSEJ2K6ww-PDkztF2aVMNS2Q=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(621x0:623x2):format(webp)/as20-sheet-sweet-and-spicy-jerk-shrimp-photo-by-carson-downing-resized-63f9c259348648d1a35ae9cfd39faa75.jpg",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "These family-pleasing shrimp sheet pan dinners are simple and easy to clean up. Plus, these low-mess meals are on the table quick, making them a great choice for busy weeknights.",
            "This simple shrimp sheet pan dinner utilizes many ingredients you likely already have on hand, and it receives rave reviews. Many of the reviewers cut the amount of salt in half. MartyD says this is \"perfect for a fast meal where you don't want to sacrifice flavor.\"",
            "This sweet and spicy shrimp dish is bright in colors and flavor. Sweet pineapple is paired with spicy jerk seasoned shrimp and sliced jalapenos. Reviewer Anne called the dish \"delicious and easy to put together.\" CaroleD served it over cauliflower rice instead of brown rice, \"perfect if you are avoiding rice carbs.\"",
            "You don't need a hot sizzling pan to make fajitas at home, this version just uses a sheet pan and your oven. LazyFoodiegirl was \"amazed at how easy this was to do — not to mention delicious.\" Reviewer mj45 says, \"Make as written first, very good. The next time you make it jazz it up any way you like.\" Add lime, serve with guacamole, and make any weeknight into fajita night.",
            "This gluten free dish combines shrimp, sausage, corn, potatoes, and loads of veggies for a complete and simple meal. Reviewer MaryLou and her family thought it was delicious, \"Followed all directions but added mussels and scallops to the shrimp mixture with a little more olive oil and creole seasoning.\" For the spice averse, it's easy to adjust the spices to your liking.",
            "This recipe is all about versatility, allowing you to roast just about any vegetable alongside the shrimp, just make sure to cut the pieces evenly. Reviewer SusanHW calls this a \"great basic recipe that is easily personalized based on your taste and ingredients on hand.\"",
            "Shrimp, bell peppers, and red onions are tossed with olive oil and fajita seasonings and baked for about 10 minutes. Fill up warm flour tortillas with the shrimp and vegetables and add avocado slices, chopped cilantro, and your favorite toppings. \"The best 20-minute meal ever,\" says Jrrahurn.",
            "If you are looking for a fun project to impress your family or friends, try your hand at this seafood boil. Clams, shrimp, crab, and lobster mingle on the sheet pan with sausage and corn, covered in a delicious garlic butter sauce with a kick."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Meat and Poultry",
            "Chicken",
            "Baked and Roasted",
            "Oven Fried"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "1 hr",
            "Total": "1 hr 15 mins",
            "Servings": "6",
            "Yield": "6 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "497",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "24g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/77489/crispy-rosemary-chicken-and-fries/",
        "recipe_name": "Crispy Rosemary Chicken and Fries",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/IBsbs4DexohSU9dZg_S2E2u1PQg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/483274-85387faa86c2402bbd2be54d109bd077.jpg",
        "recipe_ingredients_formatted": [
            "8  chicken thighs",
            "6 small red potatoes, quartered",
            "½ cup extra-virgin olive oil, or as needed",
            "1 tablespoon chopped fresh rosemary",
            "1 ½ teaspoons chopped fresh oregano",
            "1 ½ teaspoons garlic powder",
            "salt and pepper to taste"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 375 degrees F (190 degrees C).",
            "Place chicken and potatoes into a large bowl. Pour olive oil over them, and stir to coat. Scatter the chicken and potato pieces in a large baking dish, or cookie sheet with sides. Sprinkle with rosemary, oregano, garlic powder, salt and pepper.",
            "Bake for 1 hour in the preheated oven, uncovered. Baste during the last 15 minutes for extra crispness."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Side Dish",
            "Vegetables",
            "Tomatoes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "30 mins",
            "Cook": "35 mins",
            "Total": "1 hr 5 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "120",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "2g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/269330/sheet-pan-roasted-mediterranean-vegetables/",
        "recipe_name": "Sheet Pan Roasted Mediterranean Vegetables",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/lWziSiNNhT5XbEpuOwq-_uZZOWM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/6512193-sheet-pan-roasted-mediterranean-vegetables-France-C-4x3-1-de4b2fe506dd4b8a8fb23cb99ff5a4f2.jpg",
        "recipe_ingredients_formatted": [
            "12  cherry tomatoes, halved",
            "1  red bell pepper, chopped",
            "1  yellow bell pepper, chopped",
            "1  green bell pepper, chopped",
            "2  zucchini, sliced",
            "2  red onions, quartered",
            "2  cloves garlic, crushed and peeled",
            "2 tablespoons olive oil",
            "1 teaspoon chopped fresh basil",
            "ground black pepper to taste"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 350 degrees F (175 degrees C).",
            "Place cherry tomatoes, bell peppers, zucchini, red onions, and garlic on a large, rimmed baking sheet. Drizzle and toss with olive oil. Season with basil and pepper.",
            "Bake in the preheated oven until vegetables are lightly browned and easily pierced with a fork, 35 to 40 minutes."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Seafood",
            "Shellfish",
            "Shrimp"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "12 mins",
            "Total": "22 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "300",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "31g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/261600/sheet-pan-lemon-butter-garlic-shrimp-with-asparagus/",
        "recipe_name": "Sheet Pan Lemon Butter Garlic Shrimp with Asparagus",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/-Od-D3FARarJPhW09BMv41b9vPs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1433x0:1435x2):format(webp)/9427946-5c7a5bb30ba14aa38bb3e51d8e4f67eb.jpg",
        "recipe_ingredients_formatted": [
            "cooking spray",
            "1 pound fresh asparagus, trimmed",
            "2 tablespoons olive oil, divided",
            "4 cloves garlic, minced",
            "salt, divided",
            "1 pinch ground black pepper, divided",
            "1 ½ pounds uncooked medium shrimp, peeled and deveined",
            "1 teaspoon paprika",
            "3 tablespoons butter, cubed",
            "3 tablespoons lemon juice"
        ],
        "recipe_directions_formatted": [
            "Preheat oven to 400 degrees F (200 degrees C). Line a rimmed 9x12-inch baking pan with parchment paper and grease with cooking spray.",
            "Place asparagus on the prepared baking pan and drizzle with 1 tablespoon olive oil. Sprinkle with garlic, 1 teaspoon salt, and 1/2 teaspoon pepper; toss until well coated. Arrange asparagus in a single layer.",
            "Bake in the preheated oven until slightly tender, about 6 minutes.",
            "Remove from oven and place shrimp on one side of the pan. Drizzle with remaining 1 tablespoon olive oil, 1 teaspoon salt, 1/2 teaspoon pepper, and smoked paprika; toss until well coated. Place shrimp in a single layer next to the asparagus. Top asparagus and shrimp with cubed butter.",
            "Roast in the preheated oven until shrimp is opaque, about 6 minutes.",
            "Remove pan from oven and drizzle with lemon juice."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Seafood",
            "Shellfish",
            "Shrimp"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "15 mins",
            "Total": "35 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "455",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "31g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/280868/sweet-and-spicy-jerk-shrimp/",
        "recipe_name": "Sweet and Spicy Jerk Shrimp",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/ux34veOwEJKi9eLlh1wtjLwKDOM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(2807x0:2809x2):format(webp)/8333713-357cf18415df4e75a94d96bcc0e0340d.jpg",
        "recipe_ingredients_formatted": [
            "1 ½ pounds large shrimp in shells",
            "1 (20 ounce) can pineapple slices packed in 100% juice, drained, and cut into 2-inch pieces",
            "2  red bell peppers, cut into thin strips",
            "1 large red onion, sliced",
            "1  jalapeno pepper - halved lengthwise, seeded, and sliced",
            "2 tablespoons olive oil",
            "1 tablespoon Jamaican jerk seasoning",
            "½ cup chopped fresh cilantro",
            "2 cups hot cooked brown rice",
            "1  lime, cut into wedges"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 425 degrees F (220 degrees C). Line two 10x15-inch baking pans with foil.",
            "Peel and devein shrimp, leaving tails intact if desired. Rinse shrimp and pat dry.",
            "Gently toss shrimp together with pineapple, bell peppers, red onion, jalapeno, oil, and jerk seasoning in a large bowl. Divide mixture between the prepared pans.",
            "Roast in the preheated oven until shrimp are opaque, about 15 minutes.",
            "Sprinkle with cilantro and serve with brown rice and lime wedges."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Trusted Brands: Recipes and Tips",
            "Hillshire Farm®"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "25 mins",
            "Total": "45 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "435",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "14g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/269230/sheet-pan-smoked-sausage-apple-and-root-veggie-dinner/",
        "recipe_name": "Sheet Pan Smoked Sausage, Apple, and Root Veggie Dinner",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/XiCubbXU8SqdZ3eHuaPUV3UYV_4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/6007076-f26081359a7b47448e15cf2293d1d37e.jpg",
        "recipe_ingredients_formatted": [
            "8 ounces baby carrots",
            "8 ounces Brussels sprouts, halved lengthwise",
            "1 small red onion, peeled and cut into 8 wedges",
            "3 tablespoons olive oil",
            "2 teaspoons chopped fresh rosemary",
            "1 teaspoon kosher salt",
            "½ teaspoon black pepper",
            "1 (12 ounce) package Hillshire Farm® Rope Smoked Sausage, cut in 1/2\" bias-cut slices",
            "1 medium Honeycrisp apple, cut into 12 wedges",
            "1  lemon, halved",
            "2 tablespoons chopped parsley"
        ],
        "recipe_directions_formatted": [
            "Place a large baking pan in oven. Preheat oven to 450 degrees F.",
            "Toss carrots, Brussels sprouts, and onion with oil, rosemary, salt, and pepper in a large bowl. Arrange vegetable mixture and sausage on the preheated pan in a single layer. Bake in the preheated oven until just tender, about 20 minutes.",
            "Preheat broiler to high. Add apple to pan; broil until apple is tender and vegetables are slightly caramelized, 5 to 6 minutes. Remove pan from oven. Squeeze lemon over pan and sprinkle with parsley."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Everyday Cooking",
            "Sheet Pan Dinner Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "20 mins",
            "Total": "30 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "398",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "31g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/283432/everything-salmon-sheet-pan-dinner/",
        "recipe_name": "Everything Salmon Sheet Pan Dinner",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/Wr4lIoEVCxIVT3Yixxbz7c1tn1M=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(824x0:826x2):format(webp)/9053350_everything-salmon-sheet-pan-dinner_allrecipes-1a0163a184a94ae2bc03ef3944cc1612.jpg",
        "recipe_ingredients_formatted": [
            "cooking spray",
            "2 medium sweet potatoes, sliced into 1/4-inch wedges",
            "1 tablespoon olive oil",
            "½ teaspoon kosher salt, divided",
            "¼ teaspoon ground black pepper, divided",
            "¼ cup Dijon mustard",
            "2 tablespoons honey",
            "¼ teaspoon cayenne pepper",
            "5 cups broccoli florets",
            "4 (5 ounce) salmon fillets",
            "2 tablespoons everything bagel seasoning",
            "2 teaspoons soy sauce"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 425 degrees F (220 degrees C). Line a large, rimmed baking sheet with foil and coat lightly with cooking spray.",
            "Toss sweet potatoes with 2 teaspoons oil, 1/4 teaspoon salt, and 1/8 teaspoon pepper in medium bowl. Place on one half of the prepared baking sheet.",
            "Bake in the preheated oven for 5 minutes.",
            "While the potatoes are cooking, stir together Dijon, honey, and cayenne in a small bowl. Toss broccoli with remaining oil, salt, and pepper in a separate bowl.",
            "Remove potatoes from the oven. Add salmon to the other half of the baking sheet. Place 2 teaspoons of the mustard mixture on each salmon filet; brush evenly to coat, then sprinkle evenly with bagel seasoning. Add broccoli to the sweet potatoes. Return to the oven and bake until salmon flakes easily with a fork and the veggies are golden, about 12 minutes.",
            "Stir soy sauce into the remaining mustard mixture and drizzle over veggies.",
            "Please note differences in ingredient amounts and total time when following the magazine version of this recipe."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Seafood",
            "Shellfish",
            "Shrimp"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "20 mins",
            "Total": "35 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "208",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "20g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/269152/shrimp-and-vegetable-sheet-pan-dinner/",
        "recipe_name": "Shrimp and Vegetable Sheet Pan Dinner",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/wtXxrEwyPnafHWvedByEqe9YnbI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1059x1124:1061x1126):format(webp)/8301499-shrimp-and-vegetable-sheet-pan-dinner-kk-nelson-4x3-1-ec3018b7c8b9416e9b220abb91ca5a48.jpg",
        "recipe_ingredients_formatted": [
            "1  red onion, coarsely chopped",
            "1  red bell pepper, chopped",
            "1 cup sliced fresh mushrooms",
            "1  zucchini, chopped",
            "3 tablespoons olive oil, divided",
            "salt and freshly ground black pepper to taste",
            "¼ teaspoon paprika",
            "1 pound fresh shrimp, peeled and deveined",
            "1 teaspoon lemon zest",
            "½ teaspoon garlic powder"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 425 degrees F (220 degrees C).",
            "Combine red onion, bell pepper, mushrooms, zucchini, 2 tablespoons olive oil, salt, pepper, and paprika on a sheet pan and toss well to combine.",
            "Roast in the preheated oven until vegetables are softened, about 15 minutes.",
            "While vegetables are roasting, combine shrimp, 1 tablespoon olive oil, lemon zest, garlic powder, salt, and pepper in a bowl. Toss to combine.",
            "Remove roasted vegetables from the oven and add shrimp to sheet pan, spreading everything out evenly in one layer. Return to oven and bake until shrimp are pink and cooked through, 5 to 7 minutes."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Everyday Cooking",
            "Sheet Pan Dinner Recipes"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/gallery/healthy-sheet-pan-recipes-for-winter/",
        "recipe_name": "12 Simple and Healthy Sheet Pan Dinners for Winter",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/8orZGvj9x9tz2azl5g6Rkgg7FUE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(932x0:934x2):format(webp)/dj22-meanwhile-meals-mediterranean-chicken-sheet-pan-dinner-photo-by-brie-passano-9de6b38b162b46bcbc8e690698204051.jpg",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "These winter-perfect, sheet pan recipes feature healthy, flavorful, seasonally-appropriate ingredients, and simple preparations. These one-dish wonders are made on baking sheets, so you'll get plenty of heartiness and healthy ingredients with very little cleanup required.",
            "\"Adding chickpeas to root vegetables on a sheet pan makes for an easy dinner! Make sure to cut all the vegetables the same size or they won't cook properly!\" recipe creator Kim says. This recipe calls for onion powder, fennel, garlic powder, and sage, but feel free to sub in whichever spice blend you prefer.",
            "This oven-baked dinner features chicken thighs, baby potatoes, Kalamata olives, peppers, Mediterranean herbs, a sprinkle of feta cheese, and a hearty squeeze of lemon juice. For a lighter variation on the original, use skinless thighs.",
            "This easy dish delivers massive flavor with a handful of ingredients and in only a few short steps. Serving it over a scoop of quinoa or farro makes for an ideal plant-based winter entree.",
            "This bright chicken and veggie dish is a complete meal made on one baking sheet. \"Clementine and sage are the main flavor components in this dish, but can be subbed for other citrus, herbs, or spices to change it up,\" says Sarabeth Elyse, the recipe submitter.",
            "This clever sheet pan recipe reimagines chili, which generally resembles a soup or a stew. Here, in sheet pan form, it features well-seasoned ground turkey with plenty of vegetables and toasty cornbread \"dumplings.\" It's far speedier (and healthier) than a classic chili, but it still packs the chili flavors that you know and love.",
            "\"Spice up chicken dinners with a touch of harissa. The North African red pepper sauce adds depth and kick to this one-pan meal perfect for weeknights,\" says Juliana Hale of this vibrant sheet pan feast, which includes carrots and cauliflower as nutritious sides for the spicy baked chicken.",
            "Lately, cauliflower has been one of the hottest recipe ingredients going, and this simple recipe lets the cauliflower shine while introducing flavors of lemon and curry powder.",
            "Cheese can certainly be part of a healthy diet, and this recipe uses a little grated Parmesan to great effect by combining it with Panko for a light layer of breading that makes this oven-baked chicken crispy. The recommended sauce includes mayo and ketchup, but if you'd prefer a plant-based alternative, try marinara or salsa.",
            "This sheet pan spin on Korean bulgogi delivers massive flavor, thanks to a soy-ginger-sesame marinade for the steak and the inclusion of sweet snap peas and green onions. \"A super hot oven delivers a delicious way to cook up a weeknight meal. For best results, you'll want some meat with marbling. Serve over rice,\" says recipe creator FrackFamily5.",
            "Salmon has a richness that makes it feel more winter-appropriate than many other fish, and this recipe features a sweet-and-spicy marinade and roasted red and yellow peppers. \"An easy recipe for a quick dinner for weeknights with salmon, bell peppers, parsley, and lemon that is ready in about 30 minutes. I usually serve it with rice,\" says recipe writer barbara.",
            "If you're craving a healthier (and homemade) twist on classic Chinese takeout, try this crowd pleasing recipe by Bibi, who tells us: \"In order to make it sheet pan friendly, the chicken is not breaded or fried. Add as much of the delicious sauce as you like, and if there is any left over, store the sauce in the fridge in a sealed container for up to one week. It's also a great dipping sauce for Asian-style appetizers. Serve over hot steamed rice.\"",
            "Made with refrigerated crescent roll dough, these pizza-like flatbreads feature a smear of cream cheese and a layer of Cheddar on top. That said, the toppings consist of healthy veggies like cauliflower, broccoli, and bell peppers, which provide a welcome balance.",
            "Recipe creator SlimCookins calls this flatbread topped with butternut squash, red onion, and herbs \"a colorful and flavorful twist\" on a typical veggie pizza. By way of advice, SlimCookins also says that \"dusting the baking sheet with cornmeal prevents dough from sticking and gives it a lil' crunch.\"",
            "Bowl-style dining is a massive hit for excellent reason: It makes eating your healthy vegetables, proteins, and grains very simple and straightforward. This bowl features healthy plant-based ingredients like cannellini beans, zucchini, arugula, and grape tomatoes, plus plenty of herbs and some toasted pine nuts for crunch.",
            "Meatloaf isn't often associated with healthy eating, but this recipe replaces the standard ground beef with ground turkey, which has less saturated fat, but still gives the meatloaf delicious flavor and texture."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Cuisine",
            "European",
            "Greek"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "1 hr",
            "Total": "1 hr 10 mins",
            "Servings": "4",
            "Yield": "4 to 6 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "551",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "35g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/242402/greek-lemon-chicken-and-potato-bake/",
        "recipe_name": "Greek Lemon Chicken and Potato Bake",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/HPhmVFLJDC8opKEhEfpCoodQ0Tc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/2390152-0c160428659a482ea7b94e38e6b21295.jpg",
        "recipe_ingredients_formatted": [
            "4  chicken leg quarters",
            "1 (24 ounce) bag small potatoes",
            "½ cup olive oil",
            "2  lemons, juiced, divided",
            "2 tablespoons dried basil",
            "2 tablespoons dried oregano",
            "1 tablespoon salt",
            "1 tablespoon ground black pepper",
            "2 tablespoons lemon and herb seasoning",
            "1 (12 ounce) package fresh green beans"
        ],
        "recipe_directions_formatted": [
            "Preheat oven to 425 degrees F (220 degrees C). Grease a large baking sheet with sides.",
            "Place chicken quarters on prepared baking sheet. Stir potatoes, olive oil, juice of 1 lemon, basil, oregano, salt, pepper, and lemon herb seasoning together in a large bowl to coat potatoes. Arrange potatoes around chicken on baking sheet. Pour about 3/4 of oil mixture over chicken, reserving remaining oil; drizzle remaining lemon juice over chicken and potatoes.",
            "Bake in the preheated oven for about 30 minutes; shake baking sheet to loosen potatoes, then continue baking for 15 minutes. Place green beans in reserved oil mixture; toss to coat. Remove chicken mixture from oven; pour green bean mixture over chicken and potatoes.",
            "Return pan to the oven; bake until green beans are tender with a bite, chicken is no longer pink at the bone and juices run clear, about 15 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).",
            "Browse our collection of Tzatziki Sauce Recipes.",
            "Nutrition data for this recipe includes the full amount of herb-seasoned olive oil. The actual amount of oil consumed will vary."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Meat and Poultry",
            "Chicken",
            "Chicken Breast"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "30 mins",
            "Cook": "20 mins",
            "Total": "50 mins",
            "Servings": "6",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "535",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "45g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/274966/sheet-pan-parmesan-chicken-and-veggies/",
        "recipe_name": "Sheet Pan Parmesan Chicken and Veggies",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/X3urkJbrg3mbkpwr0nATOcit3nM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/274966-sheet-pan-parmesan-chicken-and-veggies-ddmfs-1x1-0154-34f84c0786f0450bae0d50f14d07c7fc.jpg",
        "recipe_ingredients_formatted": [
            "1 tablespoon dried oregano",
            "1 tablespoon dried parsley",
            "1 teaspoon paprika",
            "½ teaspoon garlic powder",
            "¼ teaspoon seasoned salt, or to taste",
            "¼ teaspoon ground black pepper, or to taste",
            "½ pound fresh green beans, trimmed",
            "1 small red potato, diced",
            "1  sweet bell pepper, chopped",
            "1 cup broccoli florets, chopped",
            "1 tablespoon minced garlic",
            "3 tablespoons olive oil",
            "⅓ cup all-purpose flour",
            "4 tablespoons butter, melted",
            "1 cup panko bread crumbs",
            "1 cup freshly grated Parmesan cheese, divided",
            "1 ½ pounds skinless, boneless chicken breasts, pounded flat and excess fat removed"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 400 degrees F (200 degrees C). Line a sheet pan with parchment paper.",
            "Combine oregano, parsley, paprika, garlic powder, seasoned salt, and pepper in a small bowl.",
            "Place green beans, potato, bell pepper, broccoli, and garlic onto the prepared sheet pan. Drizzle with olive oil and sprinkle with 1/2 of the seasoning mix; toss to coat.",
            "Place flour into a bowl. Place melted butter into a second bowl. Mix panko, 2/3 cup Parmesan cheese, and the remaining seasoning mix together in a third bowl.",
            "Slice chicken into 1 1/4-inch strips, then coat in flour. Dredge floured strips in melted butter, dripping excess butter back into the bowl. Press into Parmesan-panko mixture until heavily coated on both sides.",
            "Push veggies to one half of the sheet pan. Place coated chicken strips onto the other side. Sprinkle any remaining Parmesan-panko mixture over chicken, pressing to adhere.",
            "Bake in the preheated oven for 10 minutes. Flip chicken strips and stir veggies, then continue to bake until chicken juices run clear and veggies are crisp-tender, 10 to 15 more minutes. An instant-read thermometer inserted into the center of the chicken should read at least 165 degrees F (74 degrees C).",
            "Meanwhile, make the dipping sauce: Whisk mayonnaise, ketchup, garlic powder, and Worcestershire sauce together in a small bowl.",
            "Remove chicken and veggies from the oven. Toss veggies with remaining 1/3 cup Parmesan cheese. Serve with dipping sauce.",
            "You can use mini sweet peppers in place of the regular bell pepper. To save time, use chicken tenders instead of boneless chicken breasts."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Main Dishes",
            "Seafood Main Dishes",
            "Salmon",
            "Baked Salmon Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "10 mins",
            "Total": "30 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "337",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "19g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/262162/sheet-pan-salmon-and-bell-pepper-dinner/",
        "recipe_name": "Sheet Pan Salmon and Bell Pepper Dinner",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/IaIPtOBY2wrpOYHMzlLoq4P1A8Q=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1219x734:1221x736):format(webp)/9237989-sheet-pan-salmon-and-bell-pepper-dinner-Susan-Williams-Valenzuela-4x3-1-dd4b74fb0444414796873dc446918dec.jpg",
        "recipe_ingredients_formatted": [
            "2 tablespoons olive oil",
            "4 (3 ounce) fillets salmon fillets",
            "2  red bell peppers, chopped",
            "1  yellow bell pepper, chopped",
            "1  onion, sliced"
        ],
        "recipe_directions_formatted": [
            "Preheat oven to 400 degrees F (200 degrees C). Grease a sheet pan with 2 tablespoons olive oil.",
            "Place salmon fillets, red and yellow bell peppers, and onion on the prepared sheet pan.",
            "Combine lemon juice, 3 tablespoons olive oil, water, maple syrup, garlic, salt, red pepper flakes, cumin, and parsley in a small bowl. Drizzle 2/3 of the sauce over the ingredients on the sheet pan.",
            "Bake in the preheated oven until salmon is cooked through and flakes easily with a fork, 10 to 15 minutes.",
            "Serve with lemon slices and remaining sauce."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Seafood",
            "Shellfish",
            "Shrimp"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "30 mins",
            "Cook": "30 mins",
            "Total": "1 hr",
            "Servings": "6",
            "Yield": "6 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "333",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "19g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/268843/sheet-pan-shrimp-and-sausage-bake/",
        "recipe_name": "Sheet Pan Shrimp and Sausage Bake",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/Ph69MarGsZOSYdeAbWaCGBa_8yk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(2153x1405:2155x1407):format(webp)/268843-SheetPanShrimpandSausageBake-ddmfs-3x4-7095-01767b1144be4d2b9432fba07200661e.jpg",
        "recipe_ingredients_formatted": [
            "cooking spray",
            "1 pound baby Yukon Gold potatoes, quartered",
            "4 ears corn, husked",
            "4 tablespoons olive oil, divided",
            "3 tablespoons Creole seasoning",
            "1  lemon, juiced",
            "1 tablespoon minced garlic",
            "2 teaspoons Italian seasoning",
            "1 teaspoon paprika, divided",
            "½ teaspoon red pepper flakes",
            "1 pinch salt and ground black pepper",
            "1  red bell pepper, cut into 2-inch pieces",
            "1  yellow bell pepper, cut into 2-inch pieces",
            "1  orange bell pepper, cut into 2-inch pieces",
            "1 ½ cups cherry tomatoes, halved",
            "1  onion, cut into 2-inch pieces",
            "4  andouille sausages, sliced",
            "1  lemon, cut into wedges",
            "1 pound uncooked medium shrimp, peeled and deveined",
            "½ teaspoon Creole seasoning",
            "2 tablespoons chopped fresh parsley, or to taste",
            "finely chopped green onion, or to taste"
        ],
        "recipe_directions_formatted": [
            "Gather all ingredients.Preheat the oven to 425 degrees F (220 degrees C). Spray a large sheet pan with cooking spray.",
            "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, 10 to 12 minutes.",
            "Add corn and boil for an additional 5 minutes. Drain. Cut corn into thirds.",
            "Meanwhile, combine 3 tablespoons olive oil, 3 tablespoons Creole seasoning, juice from 1 lemon, garlic, Italian seasoning, 1/2 teaspoon paprika, red pepper flakes, salt, and pepper in a small bowl. Mix well to combine and set seasoning mixture aside.",
            "Combine boiled potatoes and corn, all the bell peppers, cherry tomatoes, onion, and sausage slices in a large bowl. Add seasoning mixture and mix evenly.",
            "Spread potato mixture onto a sheet pan in a single layer. Place lemon wedges evenly on all sides of the sheet pan.",
            "Bake in the preheated oven for 8 minutes.",
            "Meanwhile, combine shrimp, 1 tablespoon olive oil, 1/2 teaspoon paprika, and 1/2 teaspoon Creole seasoning in a bowl. Marinate for a few minutes.",
            "Add shrimp to the sheet pan with the potato mixture after 8 minutes of baking and mix to combine.",
            "Return sheet pan to the oven and cook until shrimp are opaque, 6 to 8 minutes. Remove lemon wedges and garnish with parsley and green onions."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Meat and Poultry",
            "Chicken",
            "Chicken Thigh Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "40 mins",
            "Total": "55 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "533",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "23g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/268999/mediterranean-chicken-sheet-pan-dinner/",
        "recipe_name": "Mediterranean Chicken Sheet Pan Dinner",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/Z8JXprzPWKf_Uab327fAZ2DQ4KA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/268999-ddmfs-mediterranean-chicken-sheet-pan-dinner-4X3-0038-4b58f57d84cc403e9c5f5e0f7ff88fb3.jpg",
        "recipe_ingredients_formatted": [
            "¼ cup extra-virgin olive oil",
            "lemon, juiced",
            "2 tablespoons balsamic vinegar",
            "1 teaspoon dried tarragon",
            "1 teaspoon dried oregano",
            "1 teaspoon paprika",
            "1 teaspoon salt",
            "½ teaspoon black pepper",
            "4  chicken thighs with skin",
            "1 small red onion, sliced into petals",
            "8  mini bell peppers, halved lengthwise and seeded",
            "1 pound baby potatoes, halved",
            "1  lemon, sliced",
            "¼ cup crumbled feta cheese",
            "¼ cup fresh parsley, chopped",
            "8  pitted kalamata olives"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 425 degrees F (220 degrees C). Line a large rimmed baking sheet with aluminum foil.",
            "Whisk olive oil, juice of 1 lemon, vinegar, tarragon, oregano, paprika, salt, and pepper together in a large bowl.",
            "Add chicken thighs, onion, baby bell peppers, and potatoes. Stir until everything is evenly coated.",
            "Transfer vegetable-chicken mixture to the prepared baking sheet and spread in an even layer. Scatter lemon slices over the vegetables, making sure to leave the chicken uncovered so that the skin will brown.",
            "Bake in preheated oven for about 40 minutes. Remove from oven and top with feta, parsley, and olives.",
            "Please note differences in the recipe name, as well as the cook time when using the magazine version of this recipe."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Main Dishes",
            "Seafood Main Dishes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "1 hr",
            "Prep": "30 mins",
            "Cook": "30 mins",
            "Total": "2 hrs",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "770",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "65g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/281435/sheet-pan-seafood-boil/",
        "recipe_name": "Sheet Pan Seafood Boil",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/RMb0HnIccYQmph90VVZsbdWJJp8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/9436534-251ed16f916640b0b63538446cdcc70b.jpg",
        "recipe_ingredients_formatted": [
            "1 (16 ounce) package littleneck clams",
            "¾ cup unsalted butter",
            "2 heads  garlic, chopped",
            "1 tablespoon Cajun seasoning",
            "1 tablespoon lemon and herb seafood seasoning",
            "½ tablespoon cayenne pepper",
            "1 pound uncooked medium shrimp, peeled and deveined",
            "1 pound Snow Crab legs",
            "2  lobster tails, split in half lengthwise",
            "4  andouille sausage links, cut into quarters",
            "3 ears corn, cut into chunks"
        ],
        "recipe_directions_formatted": [
            "Remove grit from clams by soaking in salt water for 20 minutes. Repeat this step twice. Scrub shells clean.",
            "Preheat the oven to 400 degrees F (200 degrees C).",
            "Melt butter in a medium saucepan over low heat with garlic, Cajun seasoning, seafood seasoning, and cayenne until garlic is fragrant, 1 to 2 minutes. Remove from heat.",
            "Place clams, shrimp, crab, and lobster on a sheet pan. Add sausage and corn. Pour seasoned butter over and mix to ensure all is covered.",
            "Bake in the preheated oven until shrimp just turns opaque, clams open, and sausage is browned, 25 to 30 minutes."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Mexican",
            "Main Dishes",
            "Fajita Recipes",
            "Chicken"
        ],
        "recipe_details_formatted": {
            "Additional Time": "30 mins",
            "Prep": "20 mins",
            "Cook": "15 mins",
            "Total": "1 hr 5 mins",
            "Servings": "8",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "200",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "19g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/255038/sheet-pan-chicken-fajitas/",
        "recipe_name": "Sheet Pan Chicken Fajitas",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/EuCEj_Gt4_LyhUXiHot9gNRaec4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/255038_Sheet-Pan-Chicken-Fajitas_ddmfs_4x3_1296-1c51ed33280e4d3888a4f092dd170aba.jpg",
        "recipe_ingredients_formatted": [
            "⅓ cup vegetable oil",
            "2 teaspoons chili powder",
            "1 teaspoon dried oregano",
            "½ teaspoon garlic powder",
            "½ teaspoon onion powder",
            "½ teaspoon ground cumin",
            "½ teaspoon salt",
            "¼ teaspoon ground black pepper",
            "1 pinch ground cayenne pepper",
            "1 ½ pounds chicken tenders, quartered",
            "4 cups sliced bell peppers, any color",
            "1  onion, sliced",
            "¼ cup chopped fresh cilantro",
            "½  lime, juiced"
        ],
        "recipe_directions_formatted": [
            "Gather all ingredients.",
            "Combine oil, chili powder, oregano, garlic powder, onion powder, cumin, salt, black pepper, and cayenne pepper in a large resealable plastic bag. Add chicken tenders, bell peppers, and onion; seal the bag and shake to mix. Marinate in the refrigerator, 30 minutes to 2 hours.",
            "Preheat the oven to 400 degrees F (200 degrees C). Line a rimmed sheet pan with aluminum foil.",
            "Spread chicken mixture onto the prepared pan.",
            "Roast in the preheated oven, stirring halfway, until chicken is no longer pink and bell peppers are softened, 15 to 20 minutes. An instant-read thermometer inserted into the center of chicken should read at least 165 degrees F (74 degrees C).",
            "Sprinkle cilantro and pour lime juice over chicken mixture; stir to distribute.",
            "You can use a variety of bell peppers and spicy peppers.",
            "You can grease the sheet pan with nonstick cooking spray instead of lining it with aluminum foil.",
            "The magazine version of this recipe uses 1 teaspoon each chili powder, salt, and cumin and adds 2 jalapeño peppers, thinly sliced."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Side Dish",
            "Vegetables",
            "Roasted Vegetable Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "30 mins",
            "Cook": "1 hr 30 mins",
            "Total": "2 hrs",
            "Servings": "24",
            "Yield": "24 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "72",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "2g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/21009/sheet-pan-roasted-vegetables/",
        "recipe_name": "Sheet Pan Roasted Vegetables",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/hWtQ5chBCp5WXvE6qIiDS3hr4KE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2):format(webp)/9431233-28b51f252d614210a439258e4a95c047.jpg",
        "recipe_ingredients_formatted": [
            "8  zucchini, peeled and chopped",
            "1  eggplant, peeled and diced",
            "8  carrots, diced",
            "16  cherry tomatoes",
            "2  red onions, sliced",
            "1  red bell pepper, sliced",
            "1  yellow bell pepper, sliced",
            "½ cup olive oil",
            "1 teaspoon dried rosemary",
            "1 teaspoon dried thyme",
            "2  bay leaves, crushed",
            "1 teaspoon dried oregano",
            "2 cloves garlic, minced",
            "2 tablespoons fresh lemon juice",
            "1 teaspoon grated lemon zest",
            "salt and pepper to taste"
        ],
        "recipe_directions_formatted": [
            "In a large bowl mix the zucchini, eggplant, carrots, tomatoes, onions and peppers with the oil, rosemary, thyme, bay leaves, oregano, garlic, lemon juice, lemon zest, salt and pepper. Cover and chill for at least 2 hours, and preferably overnight.",
            "Preheat oven to 400 degrees F (200 degrees C).",
            "On a large roasting pan, roast the vegetables, uncovered, for 20 minutes, or until the tomatoes have split and the edges of some of the vegetables are starting to crisp. Remove from the oven and stir before returning to the oven for another 20 minutes. At this time reduce heat to 200 degrees F (95 degrees C) and continue cooking until vegetables are tender, turning every 20 minutes."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Everyday Cooking",
            "Sheet Pan Dinner Recipes"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/gallery/the-best-sheet-pan-chicken-dinners/",
        "recipe_name": "14 Simple Sheet Pan Chicken Dinners",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/8A22l-nQPKrffvS3GS-W8OW9wfs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(324x0:326x2):format(webp)/1115264-4dd47e322d3f415fa1565cf3ff950c6a.jpg",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "We cannot get enough of these sheet-pan suppers: Simple preparations, complete meals cooked on one sheet for easy clean-ups, they save the day on busy weeknights. These top-rated sheet-pan recipes get the job done with chicken in the starring role, ably accompanied by the kind of tasty vegetables that chicken loves best: potatoes, broccoli, peppers, Brussels sprouts, cauliflower, green beans, and more.",
            "This easy sheet-pan dinner features herb-roasted vegetables and boneless, skinless chicken breasts. \"Baked EXTRA CRISPY Parmesan chicken and veggies—dinner made on one pan and packed with flavor!\" says chpmnk42.",
            "Browned Italian sausage and chicken thighs with sweet peppers, red onions, and Yukon Gold potatoes are doused in olive oil and tossed with dried herbs before hitting a very hot oven. Chef John says, \"You'll need a large, heavy-duty roasting pan (or a couple of smaller ones) and a very hot oven for this delicious dish. The long oven time makes everything beautifully caramelized and the chicken fork tender.\" Meanwhile, ccok4fun raves about it: \"This recipe is amazing! I highly recommend watching the video. Next time I'll use more veggies & potatoes because they are just delicious!\"",
            "Chicken breasts are baked on a bed of fresh carrots, bell peppers, and celery. \"Easy prep, great weeknight meal,\" says says cindaZ. \"Good combo of flavors served the vegs over white rice.\"",
            "\"Rosemary, garlic, and oregano create a mouth-watering aroma, says SANDY WITEK. \"The potatoes are crispy like french fries, just serve with ketchup. Kids just love this! This one-pan meal is in the oven in 15 minutes. Note: If using dried herbs in place of fresh, use 1/3 the amount.\"",
            "Here's a super-easy baked chicken main dish with potatoes, broccoli, and Italian dressing mix. So simple! \"Loved this! Per other reviews, I did add a little more butter and the potatoes and chicken were nicely cooked and moist by the end, and the broccoli was just perfect,\" says reviewer Kelsey Macomber.",
            "A sheet pan full of fajitas combines chicken, peppers, onions, and a mix of seasonings. \"I thought the seasoning level was perfect and it was really easy to throw everything together on a pan,\" says Rachel Lehman.",
            "\"The perfect balance of sweet and savory, with crispy-skinned, juicy chicken thighs, crisp-tender veggies, and a tangy sauce,\" says NicoleMcmom. \"Plus it's super affordable and requires minimal cleanup. Want to serve your family a well rounded, nutritious meal but running short on time? This easy sheet pan dinner is the answer.\"",
            "Here's a real time-saver for weeknights: an easy sheet-pan dinner of chicken thighs, apples, pancetta, and Brussels sprouts tossed in olive oil and herbs. \"If you're looking for the easiest dinner imaginable, sheet pan recipes are the perfect thing for you,\" says My Stir Crazy Kitchen. \"This one is not only easy to cook, but even easier to clean! Serve it alone or with rice/salad.\"",
            "\"Spice up chicken dinners with a touch of harissa, the North African red pepper sauce,\" says the Betty Soup. \"It adds depth and kick to this one-pan meal of chicken thighs, carrots, and cauliflower. Perfect for weeknights.\"",
            "This one-pan Greek chicken is roasted on a sheet pan with potatoes and green beans. \"Probably the best tasting chicken I ever made,\" says Marcelle Broussard. \"The chicken makes a lot of drippings because you leave skin on. I did take kitchen scissors and cut off all visible fat. We loved it, and it is even good heated up next day or cold.\"",
            "\"Prepared pesto is all you need to turn plain chicken and potatoes into a flavorful dinner,\" says France C. \"Serve with a side salad for a complete meal.\"",
            "\"Inspired by the flavors of our favorite Asian takeout, here's a recipe that uses canned pineapple tidbits, with the usual veggies,\" says Bibi. \"In order to make it sheet-pan friendly, the chicken is not breaded or fried. Add as much of the delicious sauce as you like, and if there is any left, store the sauce in the fridge in a sealed container, up to one week. It's also a great dipping sauce for Asian-style appetizers. Serve over hot steamed rice.\"",
            "\"This complete Greek-inspired chicken dinner is made simply and easily on one pan with the chicken, veggies, and potatoes cooking together,\" says fabeveryday. \"Perfect for busy weeknights!\"",
            "Chicken thighs and sausage mix it up with Brussels sprouts and seasonings in this simple and satisfying meal. \"An easy sheet pan dinner, full of flavor that can be easily customized to your tastes,\" says Jewelzee. \"The secret is roasting at a high temperature, allowing the water to steam out, leaving all that concentrated, yummy flavor.\"",
            "With all of our delicious recipes for dinners made in a flash thanks to your oven and a sheet pan, you'll be set every night of the week! Try this salmon sheet pan dinner, pictured, or browse these collections:"
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Everyday Cooking",
            "Sheet Pan Dinner Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "5 mins",
            "Cook": "25 mins",
            "Total": "30 mins",
            "Servings": "4 servings",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "394",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "29g"
        },
        "recipe_card-href": "https://www.allrecipes.com/sheet-pan-salmon-and-potatoes-recipe-7375072",
        "recipe_name": "Sheet Pan Salmon and Potatoes",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/JieTUmh2Ca2WFjCDI4tKYrzLrqs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/7375072_Sheet-Pan-Salmon-and-Potatoes_thedailygourmet_4x3-e483d193f84b4856b576c2a5990a62d2.jpg",
        "recipe_ingredients_formatted": [
            "2 tablespoons Montreal steak seasoning",
            "1 tablespoon brown sugar",
            "1/2 teaspoon ground cumin",
            "1/4 teaspoon ground coriander",
            "1 tablespoon olive oil",
            "12 ounces baby gold  potatoes, halved",
            "12 ounces frozen French green beans",
            "1 pound salmon filet, with skin on"
        ],
        "recipe_directions_formatted": [
            "Heat oven to 425 degrees F (220 degrees C). Line a rimmed baking sheet with aluminum foil or parchment.",
            "Whisk steak seasoning, brown sugar, cumin, and coriander together in a large bowl. Set half of seasoning mix aside in a small bowl.",
            "Add potatoes and green beans to the large bowl with seasoning mix. Add olive oil and toss to coat. Spread potatoes and green beans in a single layer on the prepared baking sheet.",
            "Lay salmon, skin side down, over vegetables on the baking sheet. Rub remaining seasoning onto the salmon. Bake until potatoes are tender and fish flakes easily with a fork, about 25 minutes."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Everyday Cooking",
            "Sheet Pan Dinner Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "40 mins",
            "Total": "50 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "863",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "49g"
        },
        "recipe_card-href": "https://www.allrecipes.com/sheet-pan-tilapia-and-potatoes-recipe-7498856",
        "recipe_name": "Sheet Pan Tilapia and Potatoes",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/JatkP1VQF9JUXELCwOdNqsNj7Tg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/7498856sheet-pan-tilapia-and-potatoes-recipe-TammyLynn4x3-1a2b10b314544a3d8c2e6212f5ab9bce.jpg",
        "recipe_ingredients_formatted": [
            "nonstick cooking spray",
            "8 red potatoes, cut into chunks",
            "1 yellow bell pepper, cut into 1-inch pieces",
            "4 cloves garlic, minced",
            "1 tablespoon olive oil",
            "1 teaspoon salt, divided",
            "1/2 teaspoon freshly ground black pepper",
            "2 cups cherry tomatoes, halved",
            "4 (4 ounce) tilapia filets",
            "1 teaspoon lemon zest",
            "1 lemon, cut into wedges"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 425 degrees F (220 degrees C). Spray a baking dish with nonstick cooking spray.",
            "Place potatoes, bell pepper, garlic, oil, and 1/2 teaspoon salt in the prepared dish; toss to coat.",
            "Bake in the preheated oven for 30 minutes. Add tomatoes. Place tilapia filets on top of vegetables and sprinkle with remaining salt, pepper, and lemon zest. Continue to bake until fish flakes easily with a fork, about 10 minutes.",
            "Squeeze lemon juice over fish and serve."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Everyday Cooking",
            "Sheet Pan Dinner Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "30 mins",
            "Total": "50 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "556",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "38g"
        },
        "recipe_card-href": "https://www.allrecipes.com/mediterranean-turkey-meatball-sheet-pan-dinner-recipe-7562426",
        "recipe_name": "Mediterranean Turkey Meatball Sheet Pan Dinner",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/lJqADa3YAGhvYWLz0WqAehXyHrA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/7562426_Mediterranean-Turkey-Meatball-Sheet-Pan-Dinner_Bibi_4x3-2b60f8d2e5e846dfb0026c1d560a5856.jpg",
        "recipe_ingredients_formatted": [
            "2 tablespoons minced fresh flat-leaf parsley",
            "1 tablespoon minced fresh rosemary",
            "1 tablespoon minced fresh oregano",
            "1 tablespoon minced fresh dill",
            "1 tablespoon minced fresh mint",
            "1 teaspoon kosher salt, or to taste",
            "1/2 teaspoon freshly ground black pepper",
            "2/3 cup plain breadcrumbs",
            "1/3 cup minced shallot",
            "1 clove garlic, minced",
            "1/2 lemon, zested",
            "1 large egg, lightly beaten",
            "2 tablespoons olive oil",
            "1 pound ground turkey",
            "Olive oil nonstick cooking spray",
            "1/2 lemon, juiced",
            "1/2 red or yellow bell pepper, sliced",
            "1/2 green bell pepper, sliced",
            "1/2 small red onion, sliced",
            "1 zucchini, sliced",
            "1/2 cup crumbled feta cheese",
            "1/2 cup chopped tomatoes",
            "2 tablespoons sliced black or Kalamata olives"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 400 degrees F (200 degrees C). Line a sheet pan with foil or parchment paper.",
            "In a large bowl, combine parsley, rosemary, oregano, dill, mint, salt, and pepper. Stir to combine. Set aside 2 tablespoons of herbs to use with vegetables later in the recipe.",
            "To the large bowl, add breadcrumbs, shallot, garlic, and lemon zest; stir to combine. Whisk beaten egg with 1 tablespoon olive oil, and stir into the breadcrumb mixture. Add ground turkey.",
            "Mix all ingredients well using your hands. If meatballs seem too wet, work in another tablespoon of bread crumbs. Form into 18 (1 1/4-inch) meatballs and place on the prepared pan. Spray meatballs with olive oil spray.",
            "Bake in the preheated oven for 15 minutes.",
            "Meanwhile, combine lemon juice, reserved 2 tablespoons herb mixture, and remaining 1 tablespoon olive oil, and toss with red pepper, green pepper, red onion, and zucchini slices.",
            "Remove meatballs from the oven; distribute vegetables around the meatballs on the pan.",
            "Return the pan to the oven; continue baking until vegetables are tender and meatballs are no longer pink in the center, about 15 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).",
            "Sprinkle with crumbled feta cheese, chopped tomatoes, and olives. Serve warm."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Meat and Poultry",
            "Beef",
            "Steaks"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "1 hr 6 mins",
            "Total": "1 hr 46 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "592",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "41g"
        },
        "recipe_card-href": "https://www.allrecipes.com/sheet-pan-steak-recipe-7693579",
        "recipe_name": "Sheet Pan Steak",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/pMA6Zcr4cK-JUrTqP1nt40NaD4k=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/7693579_Sheet-Pan-Steak_TheDailyGourmet_4x3-883889759f8a4118b0eeff3898ed065d.jpg",
        "recipe_ingredients_formatted": [
            "1 pound tenderized round steak",
            "1 (1.06 ounce) package Brazilian steakhouse marinade mix, such as McCormick® Grill Mates® Brazilian Steakhouse Marinade",
            "1/4 cup oil",
            "1/4 cup water",
            "1 tablespoon red wine vinegar",
            "3 cups baby potatoes, halved",
            "1 pound French green beans, trimmed",
            "1 (1.25 ounce) package toasted onion & garlic potato seasoning, such as McCormick® Toasted Onion & Garlic Potato Seasoning",
            "2 tablespoons oil"
        ],
        "recipe_directions_formatted": [
            "Place steak in a resealable plastic bag. Whisk together marinade mix, 1/4 cup oil, water, and red wine vinegar in a small bowl; pour into the bag. Reseal the bag, pressing out excess air, and squeeze bag to coat steak. Marinate steak in the refrigerator for a minimum of 30 minutes or up to overnight.",
            "Preheat the oven to 325 degrees F (165 degrees C). Line a baking sheet with foil.",
            "Place baby potatoes, green beans, and 2 tablespoons oil in a large resealable plastic bag; toss well to coat. Sprinkle in potato seasoning, reseal the bag, and toss again.",
            "Spread vegetables in a single layer on the prepared sheet; add steak on top of vegetables.",
            "Bake in the preheated oven until potatoes are tender and steaks are firm and reddish-pink and juicy in the center, about 1 hour. Turn on the broiler, and broil steak for 3 minutes. Turn steak over and broil 3 minutes more. An instant-read thermometer inserted into the center should read at least 130 degrees F (54 degrees C). Serve immediately."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Latin American",
            "Mexican",
            "Main Dishes",
            "Fajita Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "20 mins",
            "Total": "35 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "1074",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "54g"
        },
        "recipe_card-href": "https://www.allrecipes.com/sheet-pan-steak-and-shrimp-fajitas-recipe-8305215",
        "recipe_name": "Sheet Pan Steak and Shrimp Fajitas",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/5kzTvy0nn68tPwoDxRKuF6rBvQw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/8305215_Sheet-Pan-Steak-and-Shrimp-Fajitas_Bibi_4x3-c329f2e4d14b48728cd79a21fcafc534.jpg",
        "recipe_ingredients_formatted": [
            "2 teaspoons chili powder",
            "1 teaspoon smoked paprika",
            "1 teaspoon Mexican oregano",
            "1 teaspoon salt, or to taste",
            "1/2 teaspoon ground cumin",
            "1/2 teaspoon garlic powder",
            "1/4 teaspoon cayenne pepper, or to taste",
            "1 green bell pepper, thinly sliced",
            "1 red bell pepper, thinly sliced",
            "1 onion, thinly sliced",
            "3 tablespoons olive oil, divided",
            "1 pound sirloin steak, sliced 1/4-inch thick across the grain",
            "16 medium shrimp, peeled and deveined",
            "1 lime, halved",
            "1/2 cup fresh cilantro sprigs",
            "8 (8-inch) flour tortillas"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 425 degrees F (220 degrees C). Line 2 sheet pans with parchment paper or aluminum foil.",
            "Combine chili powder, smoked paprika, oregano, salt, cumin, garlic powder, and cayenne in a small bowl.",
            "In a large bowl, combine green bell pepper, red bell pepper, and onion with 1 1/2 tablespoons olive oil and 1/2 of dry seasoning mixture. Toss until evenly coated with seasoning mixture and spread out in a single layer on one of the prepared pans.",
            "Meanwhile, in the same large bowl, toss steak and shrimp with remaining 1 1/2 tablespoons olive oil; add remaining seasoning and toss again. Place steak on one side of second prepared pan, with shrimp on the other side of pan.",
            "Place steak and shrimp on a rack below vegetables and roast both pans for 10 minutes. After 10 minutes, swap rack positions of the pans, bringing the lower pan up, and placing the other pan on the rack below. Continue roasting until shrimp is pink and tightly curled, steak is cooked to medium, and vegetables are tender, about 5 minutes more. An instant read thermometer inserted in center of steak should read 140 degrees F (60 degrees C) . If steak or vegetables require more time, remove shrimp to a plate and keep warm, while other ingredients continue cooking. Squeeze juice of half a lime over contents of each sheet pan.",
            "To serve: Place a few steak strips, onion and pepper strips, 2 shrimp, and some cilantro on each tortilla. Roll up tortillas and contents jelly-roll fashion, and enjoy!"
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Meat and Poultry",
            "Chicken",
            "Chicken Thigh Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "5 mins",
            "Prep": "30 mins",
            "Cook": "1 hr 10 mins",
            "Total": "1 hr 45 mins",
            "Servings": "6",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "664",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "34g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/255936/chicken-sausage-peppers-and-potatoes/",
        "recipe_name": "Chicken, Sausage, Peppers, and Potatoes",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/iH4hAaHnQQZ-mYRpDsOrUFwHA14=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(374x0:376x2):format(webp)/4086481-chicken-sausage-peppers-and-potatoes-Chef-John-1x1-1-7b01cd012e2e45aa95ba202f2f59e846.jpg",
        "recipe_ingredients_formatted": [
            "2 tablespoons olive oil, divided",
            "4  large links hot Italian sausage",
            "6  bone-in, skin on chicken thighs",
            "½ pound assorted sweet peppers, seeded",
            "4 large Yukon Gold potatoes, quartered",
            "1 small red onion, sliced",
            "½ medium yellow onion, sliced",
            "2 teaspoons dried Italian herbs",
            "2 teaspoons kosher salt",
            "freshly ground black pepper to taste",
            "1 tablespoon chopped fresh Italian parsley"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 450 degrees F (230 degrees C).",
            "Heat 1 tablespoon oil in a skillet over medium heat. Add sausage links and cook until browned and fat begins to render, about 3 minutes per side. While they cook, lightly pierce sausages in several places with the tip of a sharp knife to release fats and juices. Remove from the heat and place on a cutting board to cool slightly, 3 to 5 minutes.",
            "Cut cooled sausages into 2-inch slices; return to the skillet along with any accumulated juices from the cutting board.",
            "Cut two slashes down to the bone on the skin side of each chicken thigh. Halve or quarter any large peppers.",
            "Place chicken and peppers into a large mixing bowl with onions, sausage and juices, Italian herbs, salt, and pepper. Drizzle with remaining 1 tablespoon oil and mix with your hands until all ingredients are coated in oil, 3 to 4 minutes.",
            "Transfer mixture to a large, heavy-duty roasting pan. Evenly space chicken thighs with the skin facing up and position potatoes near the top.",
            "Roast in the preheated oven until chicken is cooked through and everything is caramelized, about 1 hour. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Sprinkle with chopped fresh Italian parsley."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Meat and Poultry",
            "Chicken",
            "Chicken Breast"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "30 mins",
            "Total": "50 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "485",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "29g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/236110/baked-chicken-breasts-and-vegetables/",
        "recipe_name": "Baked Chicken Breasts and Vegetables",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/w57FtT-2QLoxydhDO7J2Yl_FkGw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/1959478-baked-chicken-breasts-and-vegetables-William-Hooper-1x1-1-246b3f625c744d13aeb54b9d2aa7b446.jpg",
        "recipe_ingredients_formatted": [
            "4  skinless, boneless chicken breast halves",
            "8  carrots, sliced into 1/2-inch rounds",
            "8 stalks celery, chopped",
            "8  green onions, chopped",
            "4  green bell peppers, sliced",
            "¼ cup chopped fresh flat-leaf parsley",
            "½ cup olive oil",
            "1 teaspoon Italian seasoning",
            "1 teaspoon chili powder",
            "1 teaspoon lemon pepper",
            "1 teaspoon salt",
            "4 pinches freshly ground black pepper, or to taste"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 375 degrees F (190 degrees C).",
            "Arrange chicken breasts on a baking sheet; spread carrots, celery, green onion, bell pepper, and parsley around chicken. Drizzle olive oil over chicken and vegetables; season with Italian seasoning, chili powder, lemon pepper, salt, and black pepper.",
            "Bake in the preheated oven until chicken is no longer pink in the center and juices run clear, about 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Main Dishes",
            "Seafood Main Dishes",
            "Salmon",
            "Baked Salmon Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "20 mins",
            "Total": "35 mins",
            "Servings": "2",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "386",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "40g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/71387/best-salmon-bake/",
        "recipe_name": "Best Salmon Bake",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/DO_HxLYzpuI7Ixbrl-16j77n-OA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1999x0:2001x2):format(webp)/71387-best-salmon-bake-DDMFS-4x3-91f1e33eb94440b3af4b6cf2b51d7605.jpg",
        "recipe_ingredients_formatted": [
            "1 (1 pound) salmon fillet, halved",
            "1 small tomato, chopped",
            "5  green onions, chopped",
            "¼ teaspoon salt",
            "¼ teaspoon pepper"
        ],
        "recipe_directions_formatted": [
            "Gather all ingredients.",
            "Preheat the oven to 350 degrees F (175 degrees C).",
            "Place salmon on a lightly oiled sheet pan or in a shallow baking dish, folding under thin outer edges of fillets for even cooking.",
            "Top salmon with chopped tomatoes and green onions, and season with salt and pepper.",
            "Cook salmon in the preheated oven, uncovered, until fish flakes easily with a fork, about 20 minutes."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Main Dishes",
            "Chicken",
            "Lemon Chicken Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "50 mins",
            "Total": "1 hr",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "1139",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "80g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/242352/greek-lemon-chicken-and-potatoes/",
        "recipe_name": "Greek Lemon Chicken and Potatoes",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/wO1j4mrrN54DTP8dV9mSbp_BQ7A=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/4539284_original-2000-09b01bd66782408a9735eda9256b7d40.jpg",
        "recipe_ingredients_formatted": [
            "4 pounds skin-on, bone-in chicken thighs",
            "3  russet potatoes, peeled and quartered",
            "½ cup fresh lemon juice",
            "½ cup olive oil",
            "6 cloves garlic, minced",
            "1 tablespoon dried oregano",
            "1 tablespoon kosher salt",
            "1 teaspoon dried rosemary",
            "1 teaspoon freshly ground black pepper",
            "1 pinch cayenne pepper",
            "1 cup chicken broth, divided",
            "1 teaspoon chopped fresh oregano, or to taste"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 425 degrees F (220 degrees C). Lightly oil a large roasting pan.",
            "Place chicken and potatoes in a large bowl. Add lemon juice, olive oil, garlic, dried oregano, salt, rosemary, black pepper, and cayenne. Toss until chicken and potatoes are evenly coated.",
            "Place chicken pieces skin-side up in the prepared pan. Tuck potato pieces around chicken. Drizzle with 2/3 cup chicken broth. Spoon any remaining marinade from the bowl over chicken and potatoes.",
            "Bake in the preheated oven for 20 minutes. Toss chicken and potatoes, then place chicken skin-side up again.",
            "Continue baking until chicken is browned and cooked through, about 25 minutes more; an instant-read thermometer inserted near the bone should register 165 degrees F (74 degrees C).",
            "Transfer chicken to a serving platter and keep warm; leave potatoes in the pan.",
            "Turn on the broiler, or set oven to highest heat. Toss potatoes again to coat in pan juices. Place the pan under the broiler and broil until potatoes are crisped, about 3 minutes.",
            "Transfer potatoes to the platter with chicken.",
            "Place the roasting pan on the stovetop over medium heat. Add the remaining 1/3 cup chicken broth and scrape up browned bits from the bottom of the pan. Strain pan juices over chicken and potatoes. Sprinkle with fresh oregano."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Seafood",
            "Shellfish",
            "Shrimp"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "8 mins",
            "Total": "18 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "565",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "47g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/8527068/sheet-pan-new-orleans-style-shrimp/",
        "recipe_name": "Sheet Pan New Orleans-Style Shrimp",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/os3G7ohWKkbCUSEd-Ms5XVJHOTQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(595x0:597x2):format(webp)/Sheet-Pan-New-Orleans-Style-Shrimp-1x1-1-c8eb4273a1a74e1f8ee0cc149f4f6b37.jpg",
        "recipe_ingredients_formatted": [
            "¾ cup unsalted butter, melted",
            "¼ cup Worcestershire sauce",
            "1 tablespoon freshly squeezed lemon juice",
            "1 teaspoon freshly ground black pepper",
            "1 teaspoon Cajun seasoning",
            "¼ teaspoon hot pepper sauce (such as Tabasco®)",
            "2 pounds uncooked large shrimp, peeled and deveined",
            "2 cloves garlic, minced"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 400 degrees F (200 degrees C). Line a sheet pan with foil.",
            "Mix melted butter, Worcestershire sauce, lemon juice, pepper, Cajun seasoning, and Tabasco sauce together in a small bowl.",
            "Rinse shrimp in a colander and pat dry with paper towels to remove the excess water. Place in a large bowl.",
            "Add minced garlic to the bowl with the shrimp. Pour in butter sauce and toss with the shrimp and garlic. Pour shrimp and sauce onto the prepared sheet pan, and spread shrimp out into an even layer.",
            "Cook in the pre-heated oven until the shrimp turn pink (be careful not to overcook), about 8 minutes. Serve with the sauce from the pan and French bread for dipping.",
            "Do not substitute margarine for this meal. The butter is a key ingredient, so real unsalted butter should be used."
        ]
    }
]