[
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Everyday Cooking",
            "Vegan",
            "Soups and Stews"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "45 mins",
            "Total": "1 hr 5 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "461",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "7g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/278142/plant-based-cream-of-potato-soup/",
        "recipe_name": "Plant-Based Cream of Potato Soup",
        "recipe_img_url-src": "None",
        "recipe_ingredients_formatted": [
            "1 tablespoon olive oil",
            "2 slices plant-based bacon, cut into 1-inch pieces",
            "1 cup diced onion",
            "1 cup diced carrots",
            "1 cup diced celery",
            "4 tablespoons all-purpose flour, divided",
            "2 medium potatoes, peeled and cubed",
            "1 teaspoon dried thyme",
            "½ teaspoon ground black pepper, or more to taste",
            "6 cups vegetable broth",
            "2 large bay leaves",
            "½ cup vegan butter",
            "1 ½ cups almond milk",
            "1 teaspoon dried parsley",
            "1 teaspoon dried chives, or more to taste"
        ],
        "recipe_directions_formatted": [
            "Heat oil in a 6-quart Dutch oven over medium heat. Add plant-based bacon and cook until crispy, 5 to 7 minutes. Add onion, carrots, and celery and cook for 3 minutes.",
            "Reduce heat to medium-low. Add 3 tablespoons flour and cook, stirring continuously, until lumps are dissolved. Stir in potatoes, thyme, and pepper. Add broth and bay leaves. Increase heat to high and bring to a boil. Reduce heat to medium-low, cover, and cook for 25 to 30 minutes.",
            "While the soup is cooking, melt vegan butter in a skillet over low heat. Stir in remaining 1 tablespoon flour and cook until thickened, 1 to 2 minutes. Add milk. Cook, stirring constantly, over low to medium-low heat until mixture thickens to a cream-like consistency.",
            "When the soup has finished cooking, pour in the vegan cream and simmer for 1 to 2 minutes. Stir in parsley and chives and serve.",
            "You can use fresh thyme if preferred, and any plant-based milk.",
            "I use Sweet Earth(R) Benevolent Bacon.",
            "For a cheesy flavor, add 4 ounces or more of a shredded vegan cheese (such as an almond-based mozzarella or Chao) at the end of Step 4, just before serving.",
            "Optional seasoning if you don't have celery and carrots: 1 teaspoon paprika, 1 teaspoon ground turmeric, and 1/2 teaspoon celery salt. Add these spices when pan-frying the \"bacon.\""
        ]
    }
]