[
    {
        "recipe_tags_formatted": [
            "Cuisine",
            "Asian",
            "Japanese",
            "Soups and Stews"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/gallery/miso-soup-recipes/",
        "recipe_name": "12 Miso Soup Recipes That Are Full of Flavor",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/X2Q1YlvVCBVuH2h6ip2wKvKgfgk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(324x0:326x2):format(webp)/1120059_Miso-Soup_Photo-by-LilSnoo-f04c8489fe7a4b6090a51723feb0ab85.jpg",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "It's easier than you think to make restaurant-worthy miso soup in the comfort of your own kitchen — you just need a few ingredients and a good recipe. Whether you're looking for a delicious vegan- or vegetarian-friendly option or a protein-packed broth that's full of savory flavor, you'll find a new go-to appetizer or dinner in this collection of our favorite miso soup recipes.",
            "Cozy ingredients like pumpkin, ginger, and toasted sesame seeds add flavor and warmth to this vegetarian- and vegan-friendly soup.",
            "Use your Instant Pot to make this \"Japanese-inspired take on traditional chicken noodle soup\" that's \"full of fresh ingredients and delicious flavor,\" says recipe creator JoDee Phillips.",
            "You need just six ingredients to make this homemade miso soup: finely chopped wakame, water, dashi granules, miso paste, silken tofu, and green onions.",
            "This top-rated miso soup recipe couldn't be easier to make with just five ingredients. \"Tastes identical to miso soup you would buy at a restaurant,\" says 5-star reviewer MPOLLITT.",
            "Full of rich umami flavor, this vegetarian soup is as delicious as it is easy to make. It comes together in just 20 minutes, so it's perfect for your next weeknight dinner.",
            "This hearty soup is \"very satisfying on a cold night,\" says recipe creator BrandonT, who notes that shiitake or straw mushrooms can be used in place of white mushrooms.",
            "Even the pickiest of eaters will love this miso soup with chicken and ramen noodles. Dress up this basic recipe with a soft-boiled egg and sliced green onions.",
            "Kale, quinoa, carrots, mushrooms, and a full tablespoon of antioxidant-packed turmeric make this vegan-friendly soup delicious and nutritious.",
            "Chicken, celery, carrots, butternut squash, cabbage, turnips, leeks, bell peppers, and jalapenos are cooked in a savory vegetable broth to make this healthy and hearty dinner.",
            "Everyone at your table will love this savory miso broth filled with shrimp, chicken, and rice vermicelli noodles. Top with sesame seeds and green onions.",
            "\"Very tasty soup,\" raves 5-star reviewer Kylie. \"This was one of my first attempts at using miso. This was easy to make and quite good!\" Substitute tofu for chicken if you're looking for a vegan option.",
            "Impress your dinner guests with this restaurant-worthy dish made with miso broth, ramen, pork belly, and seaweed.",
            "Try one of our Best Recipes With Miso Paste. Plus, explore our Easy Japanese Recipes for Quick Weeknight Dinners."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Vegetable Soup Recipes",
            "Squash Soup Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "20 mins",
            "Cook": "1 hr 55 mins",
            "Total": "2 hrs 15 mins",
            "Servings": "8",
            "Yield": "8 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "203",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "4g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/237113/vegan-japanese-winter-squash-and-leek-soup/",
        "recipe_name": "Vegan Japanese Winter Squash and Leek Soup",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/jjGlRS4MROgU7GweBkrbiENH0CA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/2061847-536ab1a1533c4e9287726c647eaae658.jpg",
        "recipe_ingredients_formatted": [
            "1 (2 pound) Japanese winter squash (kabocha), halved and seeded",
            "3 tablespoons canola oil, or more as needed",
            "1 large sweet onion, chopped",
            "3 large leeks - white part cut horizontally and green parts cut lengthwise",
            "2 cups water, or more as needed",
            "3 small russet potatoes, chopped",
            "3 large carrots, cut into rounds",
            "4 cups vegetable stock, or more if needed",
            "1 pinch garlic salt, or more to taste",
            "ground black pepper to taste"
        ],
        "recipe_directions_formatted": [
            "Preheat oven to 350 degrees F (175 degrees C). Arrange squash, cut-side up, on a baking sheet.",
            "Bake in the preheated oven until squash is tender, 30 to 40 minutes; cool slightly. Remove skin from squash and chop the flesh.",
            "Heat canola oil in a large pot over medium heat; cook and stir onion and white parts of leek until golden brown, 10 to 15 minutes.",
            "Mix water, green parts of leeks, potatoes, baked squash, and carrots to onion mixture; bring to a boil. Reduce heat, cover pot, and simmer, stirring every 10 minutes and adding more water as needed, until vegetables are tender, about 1 hour.",
            "Pour vegetable stock into vegetable mixture; season with garlic salt and pepper. Raise temperature to medium and cook until boiling, 15 to 20 minutes.",
            "Be forewarned, leeks are great at holding grit, as you'll discover when you slice it the long way!",
            "Vegan margarine can be used in place of the oil if desired.",
            "You can also puncture the squash a few times and put in the microwave on the 'baked potato' setting. Then slice it open in two, scrape out the seeds and fibers, and do it again until the flesh is soft."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Soups, Stews and Chili Recipes",
            "Soup Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "20 mins",
            "Total": "30 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "165",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "14g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/276864/quick-miso-soup/",
        "recipe_name": "Quick Miso Soup",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/g1SG78YeztqUmuWPP2mVCLH3338=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(124x0:126x2):format(webp)/397928-0d40bc73401f4c85b50b0b2311286f81.jpg",
        "recipe_ingredients_formatted": [
            "1 tablespoon canola oil, or more as needed",
            "4  large shiitake mushrooms, stemmed and thinly sliced",
            "1 bunch fresh chives, chopped",
            "1 clove garlic, peeled and sliced",
            "½ (14 ounce) package firm tofu, cubed",
            "1 (14 ounce) can low-sodium beef broth",
            "1 (14 ounce) can low-sodium chicken broth",
            "2 ½ tablespoons white miso paste"
        ],
        "recipe_directions_formatted": [
            "Heat oil in a medium saucepan over medium-high heat. Add mushrooms, chives, and garlic slices; cook for 1 minute. Add tofu and cook for 2 minutes. Pour in beef broth and chicken broth, then stir in miso paste until dissolved.",
            "Bring to a boil. Reduce heat to a simmer and cook for 10 minutes. Ladle into bowls to serve.",
            "Adjust miso to taste as it is the \"salt\" of the soup."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Noodle Soup Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "5 mins",
            "Prep": "15 mins",
            "Cook": "30 mins",
            "Total": "50 mins",
            "Servings": "2",
            "Yield": "2 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "759",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "22g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/282829/kitsune-udon/",
        "recipe_name": "Kitsune Udon",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/oylwieaovGbFAj5y3NxDY5GfR5M=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/8932095-2b8b8fdd23024bd3a004917f70ae6085.jpg",
        "recipe_ingredients_formatted": [
            "1 ounce kombu (Japanese dried kelp)",
            "5 cups cold water",
            "¾ cup bonito flakes"
        ],
        "recipe_directions_formatted": [
            "Break kombu into 2-inch pieces; this should equal about 2 cups, loosely packed. Bring water and kombu to a gentle boil in a medium saucepan over medium heat; boil for 5 minutes. Remove from heat, then remove and discard kombu. Sprinkle in bonito flakes and bring to a simmer over medium heat, about 2 minutes. Once simmering, remove from heat, strain, and discard solids. Place dashi back into the saucepan and set aside.",
            "Place aburaage in a medium bowl. Cover with hot water and let soak until light and fluffy, about 5 minutes. Strain, allow to cool briefly until cool enough to handle, and gently press aburaage with your hands to squeeze out any excess water.",
            "Bring 1 cup dashi, 1 1/2 tablespoon soy sauce, 1 tablespoon mirin, and sugar to a boil in another medium saucepan over medium-high heat. Reduce to a simmer over medium-low heat and add the soaked aburaage. Cook, covered, until the majority of the liquid is absorbed, about 5 minutes. Flip aburaage halfway through.",
            "Bring the remaining 4 cups of dashi to a gentle boil over medium heat. Stir in salt, remaining 1 tablespoon soy sauce, and remaining 1 tablespoon mirin. Add frozen udon noodles; cook over medium heat, stirring occasionally, until noodles have separated and are tender yet firm to the bite, about 2 minutes.",
            "Divide noodles and broth evenly into 2 bowls. Top with seasoned aburaage and sliced scallions.",
            "Aburaage is deep-fried tofu pouches made from soybeans. The cooking process it goes through in this recipe turned it into inariage. You can use 2 ounces of fried bean curd instead.",
            "Traditional dashi is made with kombu and bonito flakes. It can also be made with dashi tea packets steeped in hot water."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Cuisine",
            "Asian",
            "Japanese",
            "Soups and Stews"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "35 mins",
            "Total": "45 mins",
            "Servings": "2",
            "Yield": "2 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "702",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "16g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/246785/spicy-miso-soup-with-roasted-shiitake-mushrooms-and-green-beans/",
        "recipe_name": "Spicy Miso Soup with Roasted Shiitake Mushrooms and Green Beans",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/1wMpEpg4ZkcWIlxngow8f5U_3N8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/3457364-138fd1bd5ebe42bf800814e1c69c44b3.jpg",
        "recipe_ingredients_formatted": [
            "6 ounces shiitake mushrooms, sliced",
            "1 tablespoon olive oil, divided",
            "2 teaspoons sea salt, divided",
            "6 ounces green beans, cut into thirds",
            "4 cups vegetable broth",
            "1 ½ teaspoons soy sauce",
            "1 teaspoon sesame oil",
            "1 ½ teaspoons rice vinegar",
            "1  Thai chile, scored",
            "3 tablespoons yellow miso paste",
            "2 tablespoons hot water",
            "1 (8 ounce) package dried rice noodles",
            "1  large egg",
            "2  green onions, thinly sliced",
            "1 sheet Reynolds Wrap® Aluminum Foil",
            "1 sheet Reynolds® Parchment Paper"
        ],
        "recipe_directions_formatted": [
            "Preheat oven to 400 degrees F and line a baking sheet with Reynolds® Parchment Paper. Place mushrooms on baking sheet and drizzle with half the olive oil and half the salt. Set aside momentarily.",
            "Center green beans on a sheet of Reynolds Wrap® Aluminum Foil and drizzle with remaining olive oil and salt. Fold over edges of foil to create a packet. Ensure it is tightly sealed.",
            "Place the mushrooms and the foil pack of green beans in the oven and roast for 10 minutes, stirring the mushrooms halfway through.",
            "Heat vegetable broth to a low simmer in a medium pot. Pour in the soy sauce, sesame oil, and rice vinegar. Add the whole Thai chili to simmering broth (this will be removed later).",
            "Whisk the miso paste with hot water in small bowl until smooth then add to the broth. Continue to simmer for an additional 10 minutes.",
            "Cook noodles according to package directions while the broth is simmering. When the noodles are done, evenly divide them into two serving bowls.",
            "Bring a small pot of water to a boil and carefully drop in the egg to cook for 6 minutes. Remove from water and peel.",
            "Divide the mushrooms and green beans between the two bowls and then pour the broth evenly between the bowls.",
            "Slice the egg in half and place 1 half in each bowl. Garnish with sliced green onion.",
            "Packet cooking with Reynolds Wrap(R) Aluminum Foil is a great way to ensure juicy, roasted green beans."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Noodle Soup Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "4 hrs 3 mins",
            "Prep": "15 mins",
            "Cook": "4 hrs 30 mins",
            "Total": "8 hrs 48 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "1104",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "47g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/263052/restaurant-style-shoyu-miso-ramen/",
        "recipe_name": "Restaurant-Style Shoyu Miso Ramen",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/V6d-PmoV7R6VfSVqi0zN_vytGL4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(639x0:641x2):format(webp)/5189525-07bb81e25f5b478096403e13368c459a.jpg",
        "recipe_ingredients_formatted": [
            "¼ cup dried black fungus",
            "2 cups mirin",
            "1 ¼ cups soy sauce, divided",
            "½ cup brown sugar",
            "6  green onion bulbs, chopped, divided",
            "½  onion, coarsely chopped",
            "6 cloves garlic, peeled",
            "2 pounds skin-on, boneless pork belly",
            "butcher's twine",
            "4  eggs",
            "2 tablespoons brown sugar",
            "½ cup miso paste",
            "4 (3 ounce) packages ramen noodles, or to taste",
            "4 sheets nori (dry seaweed), quartered",
            "1  naruto (fish paste stick with a red spiral pattern). sliced"
        ],
        "recipe_directions_formatted": [
            "Preheat the oven to 275 degrees F (135 degrees C).",
            "Place black fungus in a large bowl and fill with water.",
            "Combine mirin, 1/2 cup soy sauce, 1/2 cup brown sugar, 3 green onion bulbs, chopped onion, and garlic in an oven-safe pot over high heat. Bring to a boil.",
            "Place pork belly skin-side down on a flat work surface. Roll up lengthwise and wrap with butcher's twine. Place pork belly in the pot with the mirin mixture and partially cover with a lid.",
            "Bake in the preheated oven until pork is tender and an instant-read thermometer inserted into the center reads at least 145 degrees F (63 degrees C), about 4 hours.",
            "Bring a separate pot of water to a boil over high heat. Gently place eggs in the pot and cook until yolks are barely set, 8 to 10 minutes. Transfer eggs to a bowl filled with ice water. Let sit, about 1 minute. Remove from water and peel eggs.",
            "Place eggs in a container with 1 cup water, 1/2 cup soy sauce, and 2 tablespoons brown sugar. Dampen a paper towel in the mixture and use it to cover the container. Refrigerate 4 hours to overnight.",
            "Drain the fungus and add to the liquid in the pot with the pork belly. Cover with a lid and refrigerate, 4 hours to overnight.",
            "Skim fungus from the top of the pork belly mixture and place in a pot with 8 cups water; fungus should be covered in pork belly fat. Add 1/4 cup soy sauce and miso paste. Bring to a boil.",
            "Remove skin from the pork belly using a knife. Chop the meat into pieces of desired thickness. Cut eggs in half lengthwise.",
            "Bring a separate pot of water to a boil. Cook ramen in boiling water, stirring occasionally, until noodles are tender, yet firm to the bite, about 3 minutes. Drain.",
            "Place 4 slices of nori diagonally in the corner of each bowl. Place noodles on top; arrange 2 egg halves and a few pork belly slices in separate corners. Cover with black fungus, top with green onions, and pour in broth. Top each bowl with a few slices of naruto. Let sit, about 3 minutes, before serving.",
            "Use fresh ramen noodles if possible."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Soups, Stews and Chili Recipes",
            "Soup Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "10 mins",
            "Prep": "10 mins",
            "Cook": "1 hr 55 mins",
            "Total": "2 hrs 15 mins",
            "Servings": "6",
            "Yield": "6 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "686",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "42g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/263053/japanese-shoyu-ramen-pressure-cooker/",
        "recipe_name": "Japanese Shoyu Ramen (Pressure Cooker)",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/jt3nkcl-UbNEq3WNGrOqGoMZ7y4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/4533930-a162b982f75a4437b289e3492ab4c8c2.jpg",
        "recipe_ingredients_formatted": [
            "1 (2 1/2 pound) whole chicken, cut into pieces",
            "1 cup dried scallops",
            "1 cup dried anchovies",
            "¼ cup dried shrimp",
            "¼ cup bonito flakes",
            "1 (1 inch) piece ginger, thinly slices, divided",
            "1 (4 inch) piece dashi kombu (dried kelp)",
            "3 quarts water"
        ],
        "recipe_directions_formatted": [
            "Place chicken, scallops, anchovies, shrimp, bonito flakes, half the ginger, and kombu in an electric pressure cooker. Add water; close and lock the lid. Select the Soup setting; set timer for 90 minutes according to manufacturer's instructions. Allow 10 to 15 minutes for pressure to build.",
            "Release pressure using the natural-release method according to manufacturer's instructions, 10 to 40 minutes. Strain broth through a colander or fine-mesh sieve. Skim the fatty oil off the top of the broth.",
            "Combine soy sauce, mirin, sake, green onions, bonito flakes, sugar, garlic, and kombu in a medium saucepan over high heat. Bring to a boil. Reduce heat to low and simmer until flavors blend, about 10 minutes. Strain tare sauce through a fine-mesh sieve into a bowl.",
            "Pour 2 tablespoons of tare sauce into a large bowl. Ladle in about 2 cups of broth. Add 1/6 of the ramen noodles. Repeat with remaining tare, broth, and ramen.",
            "Substitute 3 pounds of chicken bones for the whole chicken if desired.",
            "Add any toppings that you like, such as chashu (see my recipe), menma, corn, toasted seaweed or soft boiled egg. Garnish with green onions."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Beef Soup Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "25 mins",
            "Cook": "11 mins",
            "Total": "36 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "645",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "40g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/247429/traditional-beef-sukiyaki/",
        "recipe_name": "Traditional Beef Sukiyaki",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/tdX2eVN8QQr8-GyhbXFbELi7SFY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(2015x0:2017x2):format(webp)/7559100-bc5ec7804c664875a7b02b9a6813a092.jpg",
        "recipe_ingredients_formatted": [
            "1 ½ cups water",
            "⅔ cup soy sauce",
            "⅔ cup white sugar",
            "⅓ cup sake"
        ],
        "recipe_directions_formatted": [
            "Combine water, soy sauce, sugar, and sake in a bowl to make broth.",
            "Arrange beef, tofu, Chinese cabbage, yam noodles, shiitake mushrooms, enoki mushrooms, and green onion on separate plates on the table.",
            "Heat oil in an electric skillet or a large skillet set over a hot plate at the table. Add beef slices; cook and stir until browned, about 1 minute. Pour in some broth; bring to a boil. Stir in tofu, cabbage, noodles, shiitake mushrooms, enoki mushrooms, and green onion; simmer until softened, about 5 minutes.",
            "Ladle cooked sukiyaki mixture into serving bowls. Replenish broth in the skillet.",
            "Crack each egg into a small bowl and beat lightly. Serve sukiyaki alongside eggs for dipping.",
            "If using dried shiitake mushrooms, follow directions on the package to rehydrate.",
            "This recipe contains raw egg. We recommend that pregnant women, young children, the elderly, and the infirm do not consume raw egg. Learn more about egg safety from our article, How to Make Your Eggs Safe."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Seafood"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "15 mins",
            "Total": "25 mins",
            "Servings": "2",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "291",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "31g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/229869/authentic-japanese-scallop-soup-with-ramen-noodles/",
        "recipe_name": "Authentic Japanese Scallop Soup with Ramen Noodles",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/ynekrkZpsToAajvx_cVagRistdg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/1672139-cb81f1c82f69453faaa26fb1f826da6a.jpg",
        "recipe_ingredients_formatted": [
            "1 (3 ounce) package instant ramen noodles (exclude seasoning packet)",
            "2 ½ cups water",
            "2 tablespoons soy sauce",
            "2 tablespoons mirin (Japanese sweet wine)",
            "1 ⅓ teaspoons dashi broth powder",
            "1 teaspoon rice vinegar",
            "5  shiitake mushrooms, sliced",
            "2  green onions, sliced",
            "1 teaspoon minced fresh ginger",
            "1 tablespoon butter",
            "8  scallops"
        ],
        "recipe_directions_formatted": [
            "Bring a medium pot of water to a boil. Add ramen and cook, breaking up noodles as they soften, until tender yet firm to the bite, about 3 minutes. Drain, rinse with cold water, and drain again. Divide noodles between two soup bowls.",
            "While the ramen is cooking, bring 2 1/2 cups water to a boil in a separate pot. Stir in soy sauce, mirin, dashi powder, and rice vinegar. Reduce the heat to low and add mushrooms, green onions, and ginger; simmer until mushrooms are tender, 3 to 5 minutes. Turn off the heat and cover to keep warm.",
            "Melt butter in a skillet over medium-high heat. Add scallops and cook until opaque in the middle and golden brown on the edges, about 2 minutes per side.",
            "Pour 1/2 of the hot stock into each bowl over ramen, then top with scallops."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Soups, Stews and Chili Recipes",
            "Soup Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "10 mins",
            "Total": "20 mins",
            "Servings": "2",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "100",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "11g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/100535/japanese-soup-with-tofu-and-mushrooms/",
        "recipe_name": "Japanese Soup with Tofu and Mushrooms",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/u4rwdNrx9zmrqy4PX8Rw3y33Nik=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/3819741-acc0e0a261074435b8a0f4a235295945.jpg",
        "recipe_ingredients_formatted": [
            "3 cups prepared dashi stock",
            "¼ cup sliced shiitake mushrooms",
            "1 tablespoon miso paste",
            "1 tablespoon soy sauce",
            "⅛ cup cubed soft tofu",
            "1  green onion, chopped"
        ],
        "recipe_directions_formatted": [
            "Bring dashi stock to a boil in a medium saucepan; reduce heat to simmer, add mushrooms, and cook for 3 minutes.",
            "Mix miso paste and soy sauce together in a small bowl; stir into stock along with tofu. Simmer for 5 minutes.",
            "Serve topped with green onion."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Soups, Stews and Chili Recipes",
            "Soup Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "20 mins",
            "Total": "35 mins",
            "Servings": "6",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "196",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "15g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/45518/seaweed-nori-soup/",
        "recipe_name": "Seaweed (Nori) Soup",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/RzLydUcdFhV6dwWxxH-WdWmOJcY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1223x0:1225x2):format(webp)/7774074-961cb4306e0b42b38b88cf326223bb56.jpg",
        "recipe_ingredients_formatted": [
            "1 pound ground pork",
            "2 quarts water",
            "1 cube chicken bouillon",
            "1 (8 ounce) can sliced water chestnuts",
            "3 sheets nori (dry seaweed), broken into pieces.",
            "1 large egg, beaten",
            "½ teaspoon salt",
            "4  green onions, chopped",
            "¾ teaspoon sesame oil"
        ],
        "recipe_directions_formatted": [
            "Cook ground pork in a large saucepan over medium-high heat until browned. Drain off excess fat and add water. Bring to a boil, then reduce heat to medium, and simmer uncovered for 15 minutes.",
            "Stir in bouillon cube to dissolve. Add water chestnuts and nori. Stir in egg and season with salt. Remove from heat and mix in green onions and sesame oil. Serve immediately."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Soups, Stews and Chili Recipes",
            "Broth and Stock Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "5 mins",
            "Prep": "5 mins",
            "Cook": "20 mins",
            "Total": "30 mins",
            "Servings": "4",
            "Yield": "4 cups"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "1",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/132030/konbu-dashi/",
        "recipe_name": "Konbu Dashi",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/hXdBAlEGiVUkBMEpCohcZ4eNfA8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2):format(webp)/4981545-konbu-dashi-Buckwheat-Queen-4x3-1-7716f81ac7004134b3a047e8139d7954.jpg",
        "recipe_ingredients_formatted": [
            "1 (4 inch) piece dashi kombu (dried kelp)",
            "4 cups water"
        ],
        "recipe_directions_formatted": [
            "Wipe kombu with a damp cloth to clean it. Cut into 1-inch pieces and place in a saucepan with water. Bring to a boil; reduce the heat to medium-low and simmer for 20 minutes. Remove from the heat and let stand for a few minutes. Strain through a mesh strainer before using.",
            "Dashi should be pale gold in color and smell like the sea. Keep dashi covered and refrigerated when not in use. Dashi will keep for up to 14 days. The stock will smell sour when it has gone bad.",
            "Dashi can also be made cold by soaking the konbu in water for 1 to 2 hours."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Vegetable Soup Recipes",
            "Onion Soup Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "45 mins",
            "Total": "1 hr",
            "Servings": "6",
            "Yield": "6 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "25",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "1g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/49278/japanese-onion-soup/",
        "recipe_name": "Japanese Onion Soup",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/330ppNVlrTWYPHiJhvSnOij5Ihk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/1066833-cdee17e1ed6449548aae942ecda05140.jpg",
        "recipe_ingredients_formatted": [
            "½ stalk celery, chopped",
            "1 small onion, chopped",
            "½  carrot, chopped",
            "1 teaspoon grated fresh ginger root",
            "¼ teaspoon minced fresh garlic",
            "2 tablespoons chicken stock",
            "3 teaspoons beef bouillon granules",
            "1 cup chopped fresh shiitake mushrooms",
            "2 quarts water",
            "1 cup baby portobello mushrooms, sliced",
            "1 tablespoon minced fresh chives"
        ],
        "recipe_directions_formatted": [
            "In a large saucepan or stockpot, combine the celery, onion, carrot, ginger, garlic, and a few of the mushrooms. Add chicken stock, beef bouillon, and water. Place the pot over high heat, and bring to a rolling boil. When the mixture reaches boiling, cover, reduce heat to medium, and cook for 45 minutes.",
            "Place all of the remaining mushrooms into a separate pot. When the boiling mixture is done, place a strainer over the pot with the mushrooms in it. Strain the cooked soup into the pot with the mushrooms. Discard strained materials.",
            "Serve the broth with mushrooms in small porcelain bowls, and sprinkle fresh chives over the top. Use Asian soup spoons for an elegant effect."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Kitchen Tips",
            "How To"
        ],
        "recipe_details_formatted": "None",
        "recipe_nutrition_details_formatted": {
            "Calories": "None",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "None"
        },
        "recipe_card-href": "https://www.allrecipes.com/article/how-make-dashi-stock-miso-soups-and-more/",
        "recipe_name": "How to Make Dashi Stock for Miso Soups and More",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/gi8ARvJf-sDJ5gtOk7yVtE5VWMk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(324x0:326x2):format(webp)/4981545_20Konbu20Dashi20Photo20by20Buckwheat20Queen20650x465-bc18d71c662048a8a66f047838ab0698.jpg",
        "recipe_ingredients_formatted": "None",
        "recipe_directions_formatted": [
            "Dashi is a light, pale-gold soup and cooking broth that smells like the sea. It's an essential ingredient in many classic Japanese dishes — miso soup, noodle dishes, stews, and more. You can find dashi granules and dashi powder for instant dashi broth at well-stocked grocery stores. But it's actually quite simple to make homemade dashi. And the flavor of homemade dashi can be more subtle than store-bought instant dashi.",
            "There are several types of dashi stock. The most popular dashi is made with dried fish flakes (katsuobushi or bonito flakes) and dried kelp (kombu). There are also vegetarian or vegan dashi, including versions that call for dried kelp without the fish flakes and shiitake dashi that uses dried shiitake mushrooms. The common feature of all, though, is the taste of umami, which is hard to describe but is essentially the essence of savory flavor.",
            "No matter which version you're making, dashi stock is super simple to make.",
            "1. If you're using a recipe with kombu (dried kelp), wipe away any dirt with a paper towel or damp cloth. Then add it to a saucepan of water and soak for 30 minutes to soften it.",
            "2. Slice a few slits in the softened kelp leaves and return them to the water. Bring the water to a boil.",
            "3. Remove the kombu from the water once it boils to keep the broth from getting bitter.",
            "4. If you're using bonito flakes, add them to the boiling water -- and take the pan off the heat. The bonito flakes will settle to the bottom of the pan as the broth cools a bit.",
            "5. Strain the bonito flakes through a strainer lined with cheesecloth. A coffee filter will also work.",
            "You can also make a cold-brew version of dashi simply by soaking kombu in water for 1-2 hours. Here are 3 simple variations on dashi stock.",
            "Konbu Dashi",
            "\"This is a good vegetarian broth and enhances the subtle flavor of Japanese cuisine,\" says Rachael. \"It is also a bit friendlier to the western chef than katsubuoshi, which is made from dried fish flakes and can be very aromatic.\" It calls for kombu, a variety of dried edible kelp.",
            "Hoshi-Shiitake Dashi",
            "\"This is one of the many ways to make Dashi soup,\" says Hinata. \"This soup stock is good for recipes like Nikujaga, a Japanese meat and potatoes dish.\" Use the mushrooms in other recipes after they make the stock!",
            "Bonito Dashi",
            "This simple recipe combines dashi kombu (dried kelp) with bonito shavings (dried fish flakes).",
            "Now that you have your dashi stock. You'll want to use it in these top-rated recipes.",
            "Authentic Miso Soup",
            "This 5-star soup includes a recipe for dashi made with kombu and bonito flakes. The dashi soup is then flavored with miso paste, dried wakame, chunks of tofu, and chopped green onions. Other popular additions for miso soup are enoki mushrooms, daikon radishes, and carrots.",
            "Japanese Nabeyaki Udon Soup",
            "\"This is a wonderful Japanese soup, very popular throughout Japan,\" says jaime, \"with chicken, eggs, and vegetables. A meal in and of itself!\"",
            "Beef Sukiyaki",
            "Vegetables, noodles, and beef are served in a steaming, flavorful broth made with dashi, mirin, and soy sauce in this Japanese dish, sukiyaki.",
            "Check out our collection of Japanese Soups and Stews Recipes.",
            "What is dashi powder? Dashi stock powder is the instant version of dashi stock. To make it, you simply combine the granules with hot water. The taste is typically stronger than homemade.",
            "Is there a dashi stock substitute? If you don't have dashi stock on hand, try mushroom broth, which can mimic the perception of umami. Other stocks or broths -- beef, chicken, vegetarian -- are also good substitutes.",
            "How should I store homemade dashi? Keep dashi covered and refrigerated when not in use. It will keep for up to two weeks. When it's gone bad, you may notice a sour smell."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Noodle Soup Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "15 mins",
            "Cook": "25 mins",
            "Total": "40 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "548",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "42g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/228898/japanese-nabeyaki-udon-soup/",
        "recipe_name": "Japanese Nabeyaki Udon Soup",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/1XYMtDaVVPURKKR6tdFMTdQI-Hc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1511x0:1513x2):format(webp)/6517480-db5fb86ec22245a3aaed7d6034e9bd43.jpg",
        "recipe_ingredients_formatted": [
            "6 cups prepared dashi stock",
            "¼ pound chicken, cut into chunks",
            "2  carrots, diced",
            "⅓ cup soy sauce",
            "3 tablespoons mirin",
            "½ teaspoon white sugar",
            "⅓ teaspoon salt",
            "2 (12 ounce) packages firm tofu, cubed",
            "⅓ pound shiitake mushrooms, sliced",
            "5  ribs and leaves of bok choy, chopped",
            "1 (9 ounce) package fresh udon noodles",
            "4  eggs",
            "2  leeks, diced"
        ],
        "recipe_directions_formatted": [
            "Heat dashi stock, chicken, carrots, soy sauce, mirin, sugar, and salt in a pot over medium heat. Simmer until chicken is no longer pink in the center, 5 to 7 minutes. Add tofu, mushrooms, and bok choy, stirring until vegetables are tender, about 5 minutes more.",
            "Stir udon noodles into broth and simmer until tender, 3 to 4 minutes. Add leeks and crack eggs into soup; simmer until eggs are slightly firm, about 5 minutes more."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Soups, Stews and Chili Recipes",
            "Soup Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "None",
            "Prep": "10 mins",
            "Cook": "10 mins",
            "Total": "20 mins",
            "Servings": "4",
            "Yield": "4 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "92",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "6g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/208297/miso-soup-with-shiitake-mushrooms/",
        "recipe_name": "Miso Soup with Shiitake Mushrooms",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/ookShuoDYYi_LbfAeahoPKjWdT0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/4518137-23767a14922f4211bd802147bf301ec3.jpg",
        "recipe_ingredients_formatted": [
            "4 cups vegetable broth",
            "4  shiitake mushrooms, thinly sliced",
            "¼ cup miso paste",
            "4 teaspoons soy sauce",
            "⅓ cup diced firm tofu",
            "2  green onions, trimmed and thinly sliced"
        ],
        "recipe_directions_formatted": [
            "Bring the vegetable broth to a boil in a saucepan. Add the mushrooms, reduce heat to low, and simmer 4 minutes. Stir the miso paste and soy sauce together in a small bowl; add to the broth along with the tofu and continue cooking for 1 minute more. Pour the soup into bowls and top with the green onions to serve."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Soups, Stews and Chili Recipes",
            "Broth and Stock Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "50 mins",
            "Prep": "5 mins",
            "Cook": "5 mins",
            "Total": "1 hr",
            "Servings": "8",
            "Yield": "8 servings"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "12",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "1g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/175594/dashi-stock-konbudashi/",
        "recipe_name": "Dashi Stock (Konbudashi)",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/K2Sq5jYLRlEMM2wNIaY_JJQjIXY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x0:481x2):format(webp)/1111801-51cd70da2bd24790bde1f249a5584b1a.jpg",
        "recipe_ingredients_formatted": [
            "1 ounce dashi kombu (dried kelp)",
            "1 quart water",
            "½ cup bonito flakes"
        ],
        "recipe_directions_formatted": [
            "Wipe away any dirt from the kombu with a paper towel, being careful not to rub off the white powdery deposits on the seaweed. Place the kombu and water in a saucepan, and allow it to soak for 30 minutes to become soft.",
            "Remove the kombu from the water, and cut several lengthwise slits into the leaf. Return the kombu to the water, and bring it to a boil. As soon as the water begins to boil, remove the kombu to prevent the stock from becoming bitter.",
            "Stir the bonito flakes into the kombu-flavored water, bring back to a boil, and take the pan off the heat. Allow the water to cool. When the bonito flakes have settled to the bottom, strain the dashi through a strainer lined with cheesecloth or a coffee filter."
        ]
    },
    {
        "recipe_tags_formatted": [
            "Recipes",
            "Soups, Stews and Chili Recipes",
            "Soup Recipes"
        ],
        "recipe_details_formatted": {
            "Additional Time": "5 mins",
            "Prep": "15 mins",
            "Cook": "10 mins",
            "Total": "30 mins",
            "Servings": "4",
            "Yield": "None"
        },
        "recipe_nutrition_details_formatted": {
            "Calories": "65",
            "Total Fat": "None",
            "Carbohydrates": "None",
            "Protein": "6g"
        },
        "recipe_card-href": "https://www.allrecipes.com/recipe/231545/authentic-miso-soup/",
        "recipe_name": "Authentic Miso Soup",
        "recipe_img_url-src": "https://www.allrecipes.com/thmb/Bqoop9V96w-x_I9Pn3TZsnyToqg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1511x0:1513x2):format(webp)/9069102-44651730a49146a5ac257445c5f9e1ea.jpg",
        "recipe_ingredients_formatted": [
            "4 cups water",
            "1 (4 inch) piece dashi kombu (dried kelp)",
            "½ cup bonito flakes",
            "6 ounces tofu, cut into chunks",
            "1 teaspoon dried wakame",
            "3 tablespoons miso paste",
            "¼ cup chopped green onions"
        ],
        "recipe_directions_formatted": [
            "Heat water in a large pot over low heat. Add kombu and cook until just simmering. Stir in bonito flakes, then remove dashi stock from the heat. Let dashi sit, uncovered, for 5 minutes. Strain and set aside.",
            "Heat 3 1/2 cups dashi in a pot over medium heat. Add tofu and wakame and stir to combine. Remove 1 cup warmed dashi to a small bowl and whisk in miso paste. Pour miso mixture back into the pot with remaining dashi. Stir until warmed through. Serve garnished with chopped green onions."
        ]
    }
]